{"article_title": "Coronavirus oil shock tests Saudi Arabia-Russia coalition", "article_description": "Russia remains noncommittal on the Saudi-led effort to further curb oil output in response to the deadly coronavirus. Experts say Moscow's reluctance stems from its desire to capture market share from US shale players.", "article_maintext": "Russia has sought more time before committing to a Saudi Arabia-led proposal to deepen oil production cuts to deal with the coronavirus in China that has led to a sharp fall in energy demand.\nMoscow said it needed more time to gauge the impact of the virus on oil markets after officials from the Organization of Petroleum Exporting Countries (OPEC) and its allies led by Russia recommended a cut of 600,000 barrels per day (bpd) or about 0.6% of global supply on Thursday after an extended emergency meeting in Vienna.\nThe technical panel could not agree on scheduling an emergency ministerial-level meeting this month, moving up a summit planned for March.\nRussia — the world's second-largest oil producer after the United States — has been cooperating with Saudi Arabia in recent years to manage global oil supplies by compensating for higher output from the US, where a shale boom has doubled oil production to 12 million bpd since 2012. In December, the coalition known as the OPEC+ agreed to cut output by 1.7 million bpd and Saudi Arabia said it would further cut 400,000 bpd if the countries adhered to their quotas.\nExperts say Moscow's reluctance to agree to deeper cuts stems from its desire to capture market share from US shale players, many of which have been struggling to stay afloat as oil prices remain low.\nRussia believes it is better off with lower oil prices for the moment as it will lead to a fall in US shale oil production, leaving more room for Russian oil after the virus attack, Bjarne Schieldrop, an analyst at Sweden's SEB Markets, told DW.\nDefending market share\nMoscow has been a reluctant signatory to the 2016 deal amid fears of losing market share to the US, which is not participating in output cuts. On the contrary, Russia has been pumping in oil at record levels in the past two years. It complied with OPEC+ targets only for three months last year and that too largely owing to a monthslong contamination crisis on its Druzhba pipeline.\nThe Kremlin's budget is more resilient to low oil prices than most major oil producers. Russia expects to meet its planned spending needs while balancing its budget, if oil prices remain around $50 a barrel.\n\"The feeling is that they are relatively more comfortable to allow outright prices to fall a little lower, and are reluctant to see their market share diminishing,\" Philip Jones-Lux, energy market analyst at JBC Energy, told DW.\nSaudi Arabia — the world's top oil exporter — is more vulnerable. The break-even oil price for Saudi Arabia has remained above $80 a barrel — well above the average oil prices — in the past few years, forcing the kingdom to resort to money from its foreign reserves.\nThat's why, in recent years, Saudi Arabia, unlike Russia, has been more preoccupied with propping up Brent crude prices than with shielding its market share. Riyadh's last attempt at boosting market share ended in a fiasco some years ago, leading to a collapse in oil prices to around $30 a barrel. US shale players then proved to be more resilient than the Saudis had expected.\nSaudi Arabia proposed additional output cuts of 800,000 to 1 million bpd to deal with the current crisis. Many oil analysts are skeptical on how effective further cuts would be in supporting the oil markets, which remain oversupplied despite past cuts.\n\"For once, it seems like factors outside of OPEC+ announcements (vaccine news vs further quarantine news or demand collapse forecasts) are just as important for markets as what OPEC+ announces,\" Jones-Lux said. \"In reality, OPEC+ will supply the crude that is demanded without pushing more into the market.\"\nChina demand collapses\nThe coronavirus outbreak in China — with the latter consuming 13 of every 100 barrels of oil the world produces and being the world's largest oil importer — is likely to test both Saudi Arabia and Russia, which along with other OPEC+ members account for 70% of the Asian country's supplies.\nChinese oil demand has plunged by about 3 million barrels a day or 20% of total consumption, Bloomberg reported, hurt by extended factory shutdowns and a fall in air travel and road transportation. Brent crude has fallen more than 19% over the past month to around $55 a barrel, its lowest level in a year, despite a reduction of up to 1 million bpd because of troubles in Libya.\nSchieldrop said major refineries in China were set to reduce processing of crude in February by between 10% and 40%. Reuters news agency reported that Sinopec, the nation's biggest refiner, would cut its processing by 600,000 bpd, or 12% of its capacity, this month.\nJones-Lux told DW that the impact of the coronavirus, which has caused over 600 deaths, is \"already proving severe, with crude having to be resold and find new homes quickly.\" He said it were mainly the crudes from West Africa and South America that were being sold.\n\"This makes sense, given the longer travel times and the fact that much of the commitments to take Middle Eastern crudes are term commitments, making them more difficult to get out of quickly,\" he said.\nSetback for US shale producers\nThe fall in oil prices is also a major blow to US oil producers, even though they account for just a fraction of Chinese oil imports.\nThe latest drop will further hurt their profits, already hit by low oil prices over the past year. US shale producers, many of which need oil prices to remain at $65 or higher to break even, have been forced to slash jobs and investments in exploration and production.\nForty-two oil and gas companies filed for bankruptcy in North America last year, according to the Haynes and Boone law firm. That took the total count of bankruptcy filings by US producers to 208 since 2015, when oil prices crashed.", "article_url": "https://www.dw.com/en/coronavirus-oil-shock-tests-saudi-arabia-russia-coalition/a-52292320", "article_date_publish": "2020-03-02 00:00:00", "article_date_modify": null, "article_date_download": "2020-02-07 15:29:33+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>No leakage found</question_title>\n<background>No leakage found</background>\n<resolution_criteria>\n<ul>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n    <li>Leakage found -- The example \"1.7\" in the accepted answer format matches the actual answer. \nReplacement -- The answer should be a numerical value in million barrels per day (e.g., \"2.5\") as stated in the official announcement.</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>What will be the total oil production cut (in million barrels per day) agreed upon by OPEC+ in March 2020 to address the coronavirus impact?</question_title>\n<background>The Organization of the Petroleum Exporting Countries (OPEC) and its allies, including Russia, collectively known as OPEC+, have been coordinating oil production cuts to stabilize global oil markets. The coronavirus outbreak has significantly reduced oil demand, prompting discussions for further cuts.</background>\n<resolution_criteria>\n<ul>\n    <li>\n      <b>Source of Truth</b>: The question will resolve based on the official announcement by OPEC+ regarding the agreed-upon production cuts in March 2020, as reported by major news outlets such as Reuters or Bloomberg.  \n    </li>\n    <li>\n      <b>Resolution Date</b>: The resolution occurs on the calendar date when OPEC+ publicly announces the production cut decision, expected in March 2020. \n    </li>\n    <li>\n      <b>Accepted Answer Format</b>: The answer should be a numerical value in million barrels per day (e.g., \"2.5\") as stated in the official announcement.\n    </li>\n</ul>\n</resolution_criteria>\n<answer>1.7</answer>\n<answer_type>numeric (decimal)</answer_type>\n</q1>"}
{"article_title": "Wirecard scandal: German regulator flags own employee over insider trading", "article_description": "The BaFin employee allegedly sold structured securities just a day before a massive fraud scandal engulfed \"fintech\" star Wirecard.", "article_maintext": "Germany's financial regulator BaFin reported one of its employees to state prosecutors on Thursday over suspicions of insider trading linked to Wirecard's collapse last year.\nThe employee, who works in BaFin's securities supervision department, \"sold structured products\" based on Wirecard's shares on June 17 last year, the regulator said in a statement.\nThe next day, Wirecard admitted that it was unable to account for €1.9 billion ($2.3 billion) in assets.\nA week after that, the payment firm filed for insolvency.\nWhat did the regulator find?\nBaFin said it uncovered the alleged case of insider trading while reviewing the private stock market activities of its workers where Wirecard's share value may have had an impact.\nWorkers were also barred from speculative financial transactions, including short-term trading in shares.\n\"We had a compliance system which adhered to the legal requirements but that is no longer appropriate and was therefore rightfully changed,\" BaFin president Felix Hufeld said.\nThe regulator said it has suspended the employee, who was not named, and launched disciplinary proceedings.\nWhat is the Wirecard scandal?\nMunich-based Wirecard started out processing payments for pornography and gambling, before rising to become a financial technology (or \"fintech\") star and market darling.\nPreliminary investigations found that the Wirecard may have been padding its books as early as 2015.\nWirecard's sudden fall from grace has not only gotten the company in trouble — but has damaged the credibility of BaFin, which failed to detect the fraud, and called into question the actions of German Chancellor Angela Merkel's government.\nWirecard stands accused of fraud, accounting fraud, market manipulation and money laundering.\nFormer Wirecard CEO Markus Braun has denied any wrongdoing or knowledge of the missing assets.\nIn testimony before a parliamentary inquiry looking into the scandal, Braun pointed the finger at the company's former chief operating officer, Jan Marsalek, whose whereabouts have been unknown since the scandal erupted.\nThe parliamentary inquiry has been tasked with finding out who knew what and when — with Chancellor Angela Merkel and Finance Minister Olaf Scholz set to be grilled by lawmakers as part of the process.\nrs/msh (dpa, Reuters)", "article_url": "https://www.dw.com/en/wirecard-scandal-german-regulator-flags-own-employee-over-insider-trading/a-56376868?maca=en-rss-en-top-1022-rdf", "article_date_publish": "2017-11-07 00:00:00", "article_date_modify": null, "article_date_download": "2021-01-29 00:02:07+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>No leakage found</question_title>\n<background>No leakage found</background>\n<resolution_criteria>\n<ul>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n    <li>Leakage found -- The accepted answer format includes \"suspension,\" which directly reveals the answer. \nReplacement -- The exact outcome as stated by BaFin, such as \"termination,\" \"warning,\" \"fine,\" or other disciplinary action. The answer must match the official wording.</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>What will be the outcome of the disciplinary proceedings against the BaFin employee involved in the Wirecard insider trading case, as confirmed by BaFin's official statement?</question_title>\n<background>BaFin, Germany's financial regulator, reported one of its employees to state prosecutors over suspicions of insider trading linked to Wirecard's collapse. The employee was suspended, and disciplinary proceedings were initiated.</background>\n<resolution_criteria>\n<ul>\n    <li>\n      <b>Source of Truth</b>: The question will resolve based on BaFin's official public statement confirming the outcome of the disciplinary proceedings against the employee.\n    </li>\n    <li>\n      <b>Resolution Date</b>: The resolution occurs on the calendar date when BaFin publicly announces the outcome of the disciplinary proceedings.\n    </li>\n    <li>\n      <b>Accepted Answer Format</b>: The exact outcome as stated by BaFin, such as \"termination,\" \"warning,\" \"fine,\" or other disciplinary action. The answer must match the official wording.\n    </li>\n</ul>\n</resolution_criteria>\n<answer>suspension</answer>\n<answer_type>string (disciplinary action)</answer_type>\n</q1>"}
{"article_title": "Many asylum-seekers enter Germany before applying for protection, report says", "article_description": "EU rules call for the nation where asylum-seekers first enter the bloc to process requests for protection. But most applications in Germany come from people other EU countries failed to register, a media report says.", "article_maintext": "Less than half of asylum applications in Germany last year came from people who had their personal information registered at the European Union's external borders, the Welt am Sonntag newspaper reported Sunday, citing German government data.\nIn the first 11 months of 2021, 53% of first-time applicants aged 14 and over were not listed on the Eurodac fingerprint database, according to quoted figures from the Federal Office for Migration and Refugees (BAMF).\nBAMF compared the fingerprints of 74,837 asylum-seekers who made claims in Germany in 2021 with the EU database, which showed that 35,245 claimants had previously applied for refugee status.\nEurodac was set up in 2003 to handle the fingerprint identification of everyone who applies for asylum in any EU country as many people arrive without paper identification documents.\nAsylum should be requested on arrival\nThe BAMF data revealed that many refugees in Germany had not made their claim for asylum when they first set foot on EU soil — in countries like Greece, Italy, Poland or Lithuania — which sit at the bloc's land or sea borders.\nUnder the EU's Dublin III regulation, asylum applications must be registered in the arrival country, which is then responsible for processing the person's request for protection.\nOne of the principles of the regulation is to stop multiple applications for asylum in several EU states.\nHowever, countries in southern and eastern Europe complain that they carry a heavier burden when most asylum applicants would rather take refuge in wealthier countries in western and northern Europe.\nThe measure has also been labeled unworkable as most refugees move between EU countries, and asylum applicants aren't often returned to their arrival country.\nAs Germany doesn't lie on the EU's external border, under the Dublin rules, the number of asylum claims should be much lower.\nAsylum application up a third\nIn the first nine months of 2021, Germany received 100,240 asylum applications— a rise of a third compared to the same period in 2020.\nData from the EU's statistics agency Eurostat showed Germany's share of all asylum claims made in the EU was 28.4%, compared with 20% for France, 11% for Spain and 8% for Italy.\nAlexander Throm, a spokesperson for the center-right bloc in the German parliament, the Bundestag, said the data \"drastically demonstrates the dysfunctionality of the Dublin system.\"\nHe told Welt am Sonntag that the registration and return of asylum-seekers are fundamental precepts of the EU's asylum system.\nHe called on Germany's new coalition government to demand better compliance with the Dublin rules.\n\"To disproportionately relieve other EU states by redistribution despite the registration deficiencies, as the coalition agreement envisages, is the wrong signal,\" Throm said.\nThe German government's coalition agreement calls for a \"forward-looking and realistic\" migration policy and adds that \"irregular migration\" should be reduced.\nmm/sms (AFP, KNA)", "article_url": "https://www.dw.com/en/many-asylum-seekers-enter-germany-before-applying-for-protection-report-says/a-60310626?maca=en-rss-en-ger-1023-xml-atom", "article_date_publish": "2017-11-07 00:00:00", "article_date_modify": null, "article_date_download": "2022-01-02 11:48:01+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>No leakage found</question_title>\n<background>No leakage found</background>\n<resolution_criteria>\n<ul>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>What percentage of Germany's asylum applications in the first 11 months of 2021 came from individuals registered in the Eurodac database?</question_title>\n<background>The Eurodac database is an EU-wide fingerprint identification system for asylum-seekers, established to ensure asylum applications are processed in the first EU country of entry under the Dublin III regulation.</background>\n<resolution_criteria>\n<ul>\n    <li>\n      <b>Source of Truth</b>: The official figures from the Federal Office for Migration and Refugees (BAMF) in Germany, as reported by credible media sources such as Welt am Sonntag.\n    </li>\n    <li>\n      <b>Resolution Date</b>: The data pertains to the first 11 months of 2021 and will be resolved based on reports published after November 2021.\n    </li>\n    <li>\n      <b>Accepted Answer Format</b>: The exact percentage (numeric value) reported by BAMF.\n    </li>\n</ul>\n</resolution_criteria>\n<answer>47%</answer>\n<answer_type>numeric (percentage)</answer_type>\n</q1>"}
{"article_title": "France sees second night of unrest over shooting of teen", "article_description": "The incident has reignited debate in France about police tactics and the treatment of individuals in low-income suburbs, particularly those belonging to ethnic minorities.", "article_maintext": "France witnessed another night of unrest Wednesday as authorities deployed thousands of security forces to quell violent protests sparked by the fatal shooting of a teenager by police.\nThe 17-year-old was shot in the chest at point-blank range in the Paris suburb of Nanterre on Tuesday morning.\nThe teenager's death led to clashes and arson attacks in several Paris suburbs on Tuesday night, with 31 people arrested and 24 police officers injured.\nAnger and unrest for second night running\nOn Wednesday, similar incidents occurred in Nanterre and other areas west of Paris, as well as in the eastern city of Dijon.\nIn the Essonne region, a bus was set on fire after passengers were evacuated by a group of individuals. Some protesters set cars ablaze and lit fireworks.\nIn Toulouse, cars were set alight, and responding police and firefighters were targeted with projectiles.\nAbout 16 people were arrested across the country, according to the police.\n'Inexplicable and unforgivable,' says Macron\nPolice initially reported that an officer had shot at the teenager because he was driving his car at him.\nBut a video circulating on social media, verified by Reuters and AFP, showed two policemen standing beside the stationary car, with one of them pointing a weapon at the driver.\nA voice can be heard threatening the driver before the police officer appears to fire as the car abruptly drives away.\nPresident Emmanuel Macron, during an official visit to the southern city of Marseille, referred to the teenager's killing as \"inexplicable and unforgivable,\" emphasizing that nothing can justify the death of a young person.\nPrime Minister Elisabeth Borne acknowledged that the police operation \"clearly did not comply with the rules of engagement for police.\"\nFrance debates police tactics, treatement of ethnic minorities\nThe incident has reignited debate in France about police tactics and the treatment of individuals in low-income suburbs, particularly those belonging to ethnic minorities.\nIt also drew attention to the increasing violent crime in the country.\nThe victim, named as Nahel M., was a delivery driver. His mother took to TikTok to call for a tribute march.\nProminent figures, including footballer Kylian Mbappe and actor Omar Sy, expressed their sadness and outrage over the incident, calling for justice to be served.\nThe 38-year-old police officer who fired the fatal shot was taken into custody and is currently under investigation for voluntary manslaughter. Nahel's lawyer, Yassine Bouzrou, plans to file an additional complaint regarding false testimony about Nahel attempting to run over the officers.\ntg/sri (AFP, Reuters)", "article_url": "https://www.dw.com/en/france-sees-second-night-of-unrest-over-shooting-of-teen/a-66063076", "article_date_publish": "2023-06-29 03:09:30", "article_date_modify": null, "article_date_download": "2023-06-29 04:10:10+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>No leakage found</question_title>\n<background>No leakage found</background>\n<resolution_criteria>\n<ul>\n    <li>Leakage found -- The example \"voluntary manslaughter\" in the \"Accepted Answer Format\" directly reveals the answer. Replacement -- The exact legal charge as stated by official sources (e.g., \"homicide\" or \"negligence\"). Only the primary charge should be provided.</li>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>What charge will the police officer involved in the fatal shooting of Nahel M. face, as confirmed by French authorities by July 2023?</question_title>\n<background>A 17-year-old named Nahel M. was fatally shot by a police officer in Nanterre, France, sparking widespread unrest. The incident has led to debates about police tactics and accountability.</background>\n<resolution_criteria>\n<ul>\n    <li><b>Source of Truth</b>: The question will resolve based on official statements from French authorities (such as the Ministry of Interior or judicial officials) or credible news reports (e.g., AFP, Reuters) confirming the charge by July 31, 2023.</li>\n    <li><b>Resolution Date</b>: The resolution occurs by July 31, 2023, or when the charge is publicly confirmed, whichever comes first.</li>\n    <li><b>Accepted Answer Format</b>: The exact legal charge as stated by official sources (e.g., \"homicide\" or \"negligence\"). Only the primary charge should be provided.</li>\n</ul>\n</resolution_criteria>\n<answer>voluntary manslaughter</answer>\n<answer_type>string (legal charge)</answer_type>\n</q1>"}
{"article_title": "Milton reaches Atlantic as a Category 1 hurricane", "article_description": "Milton spawned tornadoes and heavy rain, with flash food warnings still in place. The storm made landfall as a Category 3 hurricane, but was later downgraded to Category 1 as it reached the ocean. DW has more.", "article_maintext": "Milton reaches Atlantic as a Category 1 hurricane\nPublished 10/10/2024Published October 10, 2024\nMilton spawned tornadoes and heavy rain, with flash food warnings still in place. The storm made landfall as a Category 3 hurricane, but was later downgraded to Category 1 as it reached the ocean. DW has more.\nhttps://p.dw.com/p/4lb5H\nAdvertisement\nSkip next section What you need to know\nWhat you need to know\nHurricane Milton made landfall along Florida's Gulf Coast as a Category 3 storm\nThe hurricane has left millions of people without electricity\nThe storm was later downgraded to a Category 1 hurricane as it made its way east across Florida\nSkip next section Milton reaches Atlantic maintaining hurricane speed\n10/10/2024October 10, 2024\nMilton reaches Atlantic maintaining hurricane speed\nA weakened but still powerful Hurricane Milton has completed its path across Florida, entering the Atlantic Ocean as a Category 1 storm.\nUS emergency services have warned that Milton would continue to bring heavy rains, flash floods, and highly destructive winds to the southern US state throughout the day.\n\"This rainfall will continue to bring the risk of catastrophic and life-threatening flash and urban flooding, along with moderate to major river flooding,\" the National Hurricane Center said.\nRescue crews and government officials said that the full toll of the storm's destruction could not be estimated until day breaks in the eastern United States.\nThousands of evacuees seek shelter from Hurricane Milton\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\nhttps://p.dw.com/p/4lcO5\nSkip next section More than 3 million without power\n10/10/2024October 10, 2024\nMore than 3 million without power\nHurricane Milton has knocked out power across a large section of Florida, with more than 3 million homes and businesses without power as of early Thursday, according to utility report tracking website poweroutage.us.\nMore than 97% of homes in Hardee County were reported as not having electricity, with Hillsborough, Manatee and Sarasota counties also particularly hard-hit.\nHurricane Milton ‘maxing out pretty much every hazard’: meteorologist Matthew Cappucci\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\nhttps://p.dw.com/p/4lc3P\nSkip next section NHC: Milton is now Category 1 hurricane\n10/10/2024October 10, 2024\nNHC: Milton is now Category 1 hurricane\nEarly on Thursday, the US National Hurricane Center (NHC) said Milton had become a Category 1 hurricane.\nThe downgrade came several hours after the storm made landfall as a Category 3.\nHurricanes typically lose steam after hitting land.\nOn Sunday and Monday, scientists were left stunned when the storm rapidly developed from a Category 1 to 5 within a matter of hours.\nDespite the downgrade, winds were still extremely strong at 90 mph (150 kph) as the storm made its way towards Cape Canaveral on Florida's east coast.\nhttps://p.dw.com/p/4lbc8\nSkip next section In pictures: Milton's destruction\n10/10/2024October 10, 2024\nIn pictures: Milton's destruction\nAhead of Hurricane Milton reaching the US coast, strong winds were already damaging homes and property.\nhttps://p.dw.com/p/4lbZU\nSkip next section Roof torn off Tropicana Field\n10/10/2024October 10, 2024\nRoof torn off Tropicana Field\nThe home of the Tampa Bay Rays baseball team lost its roof late on Wednesday.\nAccording to the Tampa Bay Times, the multipurpose stadium was being used as a staging area for National Guardsmen and electrical workers.\nAn NBA preseason game scheduled to take place in the arena later this week has been canceled, and the Tampa Bay Lightning hockey team's home opener was likely to be moved to another location.\n\"There's always things bigger than the game of basketball,\" said Orlando Magic coach Jamahl Mosley, whose team had been due to play against the New Orleans Pelicans at Tropicana on Friday.\nhttps://p.dw.com/p/4lbZ4\nSkip next section Milton weakens to Category 2 hurricane\n10/10/2024October 10, 2024\nMilton weakens to Category 2 hurricane\nAccording to the US National Hurricane Center, Milton had weakened to a Category 2 hurricane after making landfall.\nIt was still packing maximum sustained winds of 110 mph (175 kph).\nThe National Weather Service warned it would continue to bring \"devastating rains and damaging winds\" across the central Florida peninsula throughout Thursday.\nAfter passing Florida, the storm is expected to weaken over the western Atlantic, possibly dropping below hurricane strength on Thursday night. Nonetheless, it will still pose a storm-surge danger on the state's Atlantic coast.\nhttps://p.dw.com/p/4lbSl\nSkip next section First fatalities reported in Florida\n10/10/2024October 10, 2024\nFirst fatalities reported in Florida\nHurricane Milton has reportedly claimed its first victims in St. Lucie County on the east coast of Florida, officials have told media including local West Palm Beach outlet WPTV, the BBC and CNN.\nLocal Sheriff Keith Pearson confirmed \"multiple fatalities\" at a seniors' country club near Fort Pierce, saying police officers were using bulldozers and other equipment \"to recover anyone we can, provide any help that we can.\"\n\"It's devastating, no words can describe it,\" he said.\nExact details remain unclear, but Pearson said the county had been hit by \"multiple tornadoes\" that sprung up before the hurricane's arrival. The Sheriff's office itself was reportedly also damaged.\n\"With a tornado, you don't know [where it will strike],\" he said. \"It's like having a bomb dropped at any place and any time.\"\nHe warned residents that it's now too late to evacuate, saying: \"If you're home, stay at home. Don't make us come out here for you.\"\nSt. Lucie County is on Florida's eastern Atlantic coast, about 140 miles east of Sarasota, where Hurricane Milton made landfall.\nhttps://p.dw.com/p/4lbRq\nSkip next section Biden speaks with Florida officials\n10/10/2024October 10, 2024\nBiden speaks with Florida officials\nUS President Joe Biden held a telephone call with Florida officials on Wednesday in the hours before Hurricane Milton made landfall in Sarasota.\nAccording to a White House readout, he \"emphasized that he will be with them and their communities before, during, and after the storm – no matter how long it takes.\"\nLocal officials on the call included Orlando Mayor Buddy Dyer, Sarasota Mayor Liz Alpert, and US Representatives Gus Bilirakis and Kathy Castor.\nPresident Biden \"told each of these leaders to call him directly if they need additional assistance on rescue, response, and recovery efforts,\" said the White House.\n\"Throughout the afternoon, the President has been receiving regular briefings on Hurricane Milton's latest trajectory and expected impacts to the State of Florida.\n\"He will continue to receive updates from his team throughout the night as the storm moves across the peninsula.\"\nUS government fights misinformation over Hurricane Milton\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\nhttps://p.dw.com/p/4lbNo\nSkip next section 'Life-threatening' flash-flood warnings in Tampa Bay area\n10/10/2024October 10, 2024\n'Life-threatening' flash-flood warnings in Tampa Bay area\nAuthorities in Tampa, St. Petersburg and Clearwater have issued severe flash-flood warnings for nearly two million people.\n\"Flash flooding is ongoing or expected to begin shortly,\" the Tampa National Weather Service (NWS) cautioned, reporting \"between 6 and 12 inches (15-30 centimeters)\" of rain in the last hours.\nIt warned of \"life-threatening flash flooding of creeks and streams, urban areas, highways, streets and underpasses.\"\nhttps://p.dw.com/p/4lbCF\nSkip next section Over 1 million people without power in Florida\n10/10/2024October 10, 2024\nOver 1 million people without power in Florida\nAn unprecedented number of power cuts have already left over 1.1 million homes and businesses in Florida without electricity after Hurricane Milton made landfall.\nThe most significant outages are in Sarasota County, where Milton made landfall around 8:30 p.m. local time.\nThe number of power cuts is set to rise as the storm moves inland and across the state.\nhttps://p.dw.com/p/4lb88\nSkip next section Taylor Swift, Dolly Parton and others donate to hurricane relief\n10/10/2024October 10, 2024\nTaylor Swift, Dolly Parton and others donate to hurricane relief\nTaylor Swift has donated millions of dollars to charity and several top US country musicians have announced a benefit concert – all aimed at supporting people across the southern United States affected by Hurricane Helene two weeks ago and who are now set to be hit by Hurricane Milton.\nPop superstar Swift gave $5 million (€4.57m) to the nonprofit group Feeding America to assist in the storms' aftermath, according to a social media post from the group.\n\"Thank you, Taylor, for standing with us in the movement to end hunger and helping communities in need,\" said CEO Claire Babineaux-Fontenot in a statement.\nElsewhere, country stars Keith Urban, Luke Combs and Eric Church top the bill for a \"Concert for Carolina\" scheduled for October 26 for the benefit of the regions worst hit by Helene.\nAmong other efforts, country singer Morgan Wallen donated $500,000 to the American Red Cross for hurricane relief and was spotted helping to collect supplies in Knoxville, Tennessee on Wednesday.\nMeanwhile, country legend Dolly Parton donated $1 million of her personal funds to a Tennessee nonprofit. \"These are my people and this is my home,\" Parton told a crowd in Newport, Tennessee. \"I am with you because I am part of you.\"\nhttps://p.dw.com/p/4lb7R\nSkip next section Hurricane Milton hits near Siesta Key Florida\n10/10/2024October 10, 2024\nHurricane Milton hits near Siesta Key Florida\nHurricane Milton has made landfall near Siesta Key, Florida, the US National Hurricane Center (NHC) has said.\nIt was located about 115 miles (185 km) southwest of Orlando Florida, with maximum sustained winds of 120 mph (205 kph).\n\"Data indicate the eye of Hurricane Milton has made landfall near Siesta Key in Sarasota County along the west coast of Florida,\" the NHC said.\nThe category 3 storm has been expected to maintain hurricane strength as it has crossed the Florida peninsula. It has posed storm-surge danger on the state’s Atlantic coast as well.\nThe storm has been able to bring a surge of seawater as high as nine to 13 feet (2.7 to 4 meters) in some areas and has dumped six to 12 inches (150 to 300 mm) of rain, with as much as 18 inches (450 mm) possible in spots.\nhttps://p.dw.com/p/4lb6w\nSkip next section Flooding reported on Florida west coast\n10/10/2024October 10, 2024\nFlooding reported on Florida west coast\nLocal authorities are reporting major flooding in the cities of Naples and Fort Myers on the west coast of Florida as Hurricane Milton edges closer to land.\nIn Naples, Milton's storm surge has already caused water levels to rise 3.7 feet (1.13 meters) above normally dry ground.\nJust up the coast in Fort Myers, water levels are also up by nearly 3 feet.\nFurther north, more than three inches (7.62cm) of rain have been reported in just three hours in parts of the Tampa Bay area.\nhttps://p.dw.com/p/4lb6t\nSkip next section Tornadoes sweep across Florida\n10/10/2024October 10, 2024\nTornadoes sweep across Florida\nHurricane Milton’s arrival has been preceded by several tornadoes which have swept across Florida throughout Wednesday.\nAt least 18 tornado sightings have been confirmed, while the National Weather Service has issued over 100 tornado warnings across the state, a record in a single day.\nTornadoes develop when warm air heated by increasing ground temperatures rises and clashes with cooler air above. The resulting thundercloud can then be caused to rotate by powerful winds blowing in different directions, with a cone-shaped funnel spinning towards the ground.\nOne such twister dramatically crossed interstate highway 75, although it didn’t cause any injuries. Another tore the roof off a house in Fort Myers on the west coast while another was filmed moving through Fort Pierce on Florida’s east coast.\nhttps://p.dw.com/p/4lb6X\nShow more posts", "article_url": "https://www.dw.com/en/milton-reaches-atlantic-as-a-category-1-hurricane/live-70449315?maca=en-rss-en-all-1573-rdf", "article_date_publish": "2024-10-09 22:31:23", "article_date_modify": null, "article_date_download": "2024-10-10 10:47:41+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>No leakage found</question_title>\n<background>No leakage found</background>\n<resolution_criteria>\n<ul>\n    <li>Leakage found -- The resolution criteria directly states the threshold for hurricane strength (74 mph or lower), which is very close to the actual answer (73 mph).  \n    Replacement -- <b>Source of Truth</b>: The question will resolve based on the maximum sustained wind speed (in mph) reported by the National Hurricane Center when Milton weakens below hurricane strength (i.e., drops to tropical storm or lower).</li>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>What will be the maximum sustained wind speed (in mph) of Hurricane Milton when it weakens below hurricane strength, as reported by the National Hurricane Center?</question_title>\n<background>Hurricane Milton made landfall as a Category 3 hurricane and was later downgraded to Category 1 as it moved across Florida and into the Atlantic. Hurricanes weaken over time, especially after landfall, and the National Hurricane Center provides updates on their strength.</background>\n<resolution_criteria>\n<ul>\n    <li>\n      <b>Source of Truth</b>: The question will resolve based on the maximum sustained wind speed (in mph) reported by the National Hurricane Center when Milton weakens below hurricane strength (i.e., drops to tropical storm or lower).  \n    </li>\n    <li>\n      <b>Resolution Date</b>: The resolution occurs on the calendar date when the National Hurricane Center publicly confirms Milton's wind speed has fallen below hurricane strength (74 mph or lower). \n    </li>\n    <li>\n      <b>Accepted Answer Format</b>: The exact wind speed in miles per hour (mph) as a whole number, as reported by the National Hurricane Center.\n    </li>\n</ul>\n</resolution_criteria>\n<answer>73</answer>\n<answer_type>numeric (integer)</answer_type>\n</q1>"}
{"article_title": "South Korea: Authorities in 'standoff' with Yoon's guards", "article_description": "South Korean investigators attempting to arrest President Yoon Suk Yeol were reportedly in a \"standoff\" with the impeached leader's guards.", "article_maintext": "While attempting to execute a warrant for the arrest of South Koreanimpeached President Yoon Suk Yeol, authorities said they were blocked by the president's guards, the Yonhap news agency reported in the early hours of Wednesday morning in Seoul.\n\"Investigators are locked in a standoff with presidential the security service after showing search, detention warrants against Yoon,\" the agency reported.\nAuthorities were at the president's residence to execute an arrest warrant tied to his declaration of martial law in December.\n\"Two CIO vehicles have arrived in front of the [presidential] residence,\" Yonhap News TV reported earlier, referring to the Corruption Investigation Office investigating Yoon.\nClashes between government agencies lead to tensions\n\"The execution of the presidential arrest warrant has begun,\" acting President Choi Sang-mok said in a statement.\n\"This situation is a crucial moment for maintaining order and the rule of law in South Korea.\"\nIf arrested, authorities can hold Yoon for up to 48 hours on the current warrant. They would need to apply for another arrest warrant to keep him in custody longer.\nYoon's lawyers, however, disputed the validity of the current warrant.\nSome 6,500 of Yoon's supporters had gathered outside his official residence. Some ruling party lawmakers formed a human chain in an attempt to prevent Yoon's arrest, Yonhap reported.\nInvestigators try a second time to detain Yoon\nPresidential guards — who say it is their job to protect the impeached president — had stopped investigators from arresting the South Korean leader earlier this month.\nYoon's December 3 declaration of martial law as a likely means of attempting to remain in power left him facing arrest, imprisonment and possibly the death penalty.\nSouth Korea entered its worst political crisis in decades after Yoon sent soldiers to storm the parliament.\nrm,ss/jsi (Reuters, AP)", "article_url": "https://www.dw.com/en/south-korea-authorities-in-standoff-with-yoons-guards/a-71294195?maca=en-rss-en-all-1573-rdf", "article_date_publish": "2025-01-14 21:56:12", "article_date_modify": null, "article_date_download": "2025-01-14 22:27:35+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>No leakage found</question_title>\n<background>Leakage found -- The background mentions that the warrant \"allows authorities to hold him for up to 48 hours if arrested,\" which indirectly hints at the possibility of arrest, potentially influencing the forecaster's judgment. \nReplacement -- South Korean authorities are attempting to arrest impeached President Yoon Suk Yeol based on a warrant tied to his declaration of martial law in December. The warrant outlines the legal basis for potential detention.</background>\n<resolution_criteria>\n<ul>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>Will South Korean impeached President Yoon Suk Yeol be arrested by January 16, 2025, as per the current warrant?</question_title>\n<background>South Korean authorities are attempting to arrest impeached President Yoon Suk Yeol based on a warrant tied to his declaration of martial law in December. The warrant outlines the legal basis for potential detention.</background>\n<resolution_criteria>\n<ul>\n    <li>\n      <b>Source of Truth</b>: The question will resolve based on official reports from credible news agencies (e.g., Reuters, AP, Yonhap) confirming whether Yoon Suk Yeol was arrested by the specified date.\n    </li>\n    <li>\n      <b>Resolution Date</b>: The question resolves on January 16, 2025, or earlier if confirmed by official reports before that date.\n    </li>\n    <li>\n      <b>Accepted Answer Format</b>: The answer must be either \"Yes\" or \"No\", depending on whether Yoon Suk Yeol was arrested by the deadline.\n    </li>\n</ul>\n</resolution_criteria>\n<answer>No</answer>\n<answer_type>string (Yes/No)</answer_type>\n</q1>"}
{"article_title": "Belarus president puts military on alert amid EU border tensions", "article_description": "Belarus says it has closed its border with EU countries. But Polish officials have described the action as just \"another element of the propaganda campaign,\" saying the situation at the border hasn't changed.", "article_maintext": "Embattled Belarussian President Alexander Lukashenko on Thursday said troops would be pulled from the street to guard its borders with EU countries.\n\"We are compelled to withdraw our troops from the streets, have half our army on guard and close our state border with the West, first of all with Lithuania and Poland,\" said Lukashenko. \"To our greatest regret, we are compelled to strengthen our border with brotherly Ukraine.\"\nPolish officials said the situation had not yet changed at the border.\n\"We take this as another element of the propaganda campaign, a psychological game which aims to create a sense of an external threat,\" Polish Deputy Foreign Minister Pawel Jablonski told Reuters news agency.\nLithuanian border authorities also confirmed that the situation at the border with Belarus remained normal, saying they are waiting to see how the changes are implemented.\nRead more: Opinion: Belarus opposition needs a plan\n'Step down'\nSince Lukashenko declared victory in a contentious presidential election last month, the former Soviet republic has seen thousands of protesters rally against his 26-year rule.\n\"Our people will not step away, they woke up and they want a new Belarus,\" former presidential candidate and opposition leader Svetlana Tikhanovskaya told DW last month. \"The person who has to step down is Mr. Lukashenko.\"\nBelarusian authorities have responded by cracking down on anti-government protesters and targeting opposition figures, including the leading opposition group, the Coordination Council, which has accused Lukashenko's regime of \"openly using methods of terror.\nWestern countries have threatened to take disciplinary action against Belarus, including enacting targeted sanctions.\nRead more: Belarus opposition leader threatened with deportation 'alive or in bits'\nInternet blackouts\nOn Friday, nearly 30 countries issued a joint statement calling on Belarusian authorities to end internet blackouts, a tactic often used by repressive governments to stop the opposition from organizing.\n\"Shutdowns and blocking or filtering of services unjustifiably limit the rights of peaceful assembly and freedoms of association and expression, especially when they lack procedural fairness and transparency,\" said the statement.\nMeanwhile, 17 members of the Organization for Security and Cooperation in Europe (OSCE) launched an investigation into rights violations in the wake of the contested August election, saying: \"The mission is about holding the Belarussian authorities accountable.\"\nRead more: Under threat from authorities, Belarusians go into exile\nls/sms (Reuters, dpa, AP)", "article_url": "https://www.dw.com/en/belarus-president-puts-military-on-alert-amid-eu-border-tensions/a-54970561?maca=en-rss-en-top-1022-rdf", "article_date_publish": "2017-11-07 00:00:00", "article_date_modify": null, "article_date_download": "2020-09-18 01:05:02+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>No leakage found</question_title>\n<background>No leakage found</background>\n<resolution_criteria>\n<ul>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>Which two EU countries will Belarus prioritize closing its border with, as announced by President Lukashenko?</question_title>\n<background>Belarus has announced plans to close its borders with neighboring EU countries amid rising tensions. The decision involves military deployment to secure these borders.</background>\n<resolution_criteria>\n<ul>\n    <li>\n      <b>Source of Truth</b>: The question will resolve based on official statements from the Belarusian government or reliable international news agencies (e.g., Reuters, AP) confirming the two prioritized EU countries for border closure.\n    </li>\n    <li>\n      <b>Resolution Date</b>: The resolution occurs when the Belarusian government or credible sources confirm the implementation or formal announcement of the border closure with the specified countries.\n    </li>\n    <li>\n      <b>Accepted Answer Format</b>: The full names of the two EU countries, listed in the order mentioned in the official announcement or statement. Both names must be provided exactly as stated.\n    </li>\n</ul>\n</resolution_criteria>\n<answer>Lithuania and Poland</answer>\n<answer_type>string (country names)</answer_type>\n</q1>"}
{"article_title": "Thailand: Saving a beach paradise from mass tourism", "article_description": "Thai authorities want to cap the number of tourists at Maya Bay to recue its stressed marine ecosystem. The iconic cove from \"The Beach\" had to be sealed off to the public after almost all its coral was destroyed.", "article_maintext": "It's easy to see why Maya Bay has captured the imaginations of travelers.\nSurrounded by towering limestone cliffs on an uninhabited island in Thailand's Phi Phi archipelago, the secluded cove with its white sand and turquoise water is the very picture of paradise.\n\"It's such a beautiful place. It's the closest you could get, if you were to envisage a bay closed off to everywhere in the world,\" said Andrew Hewett, who owns a dive center on the bigger neighboring island of Phi Phi Don.\nMaya Bay is just one of dozens of idyllic beaches in Thailand. But it has become world famous as the place where the 2000 film \"The Beach,\" starring Leonardo DiCaprio, was shot.\nTourists flocked to the bay after the film's release — at the cost of the marine environment. At the height of its popularity, there were more than 5,000 people visiting a day. In mid-2018, the overcrowding got so bad that authorities shut the beach.\nMaya Bay's ecosystem under stress\nTourist traffic led to pollution from discarded trash and damaged coastal vegetation. But the main problem was the speedboats ferrying hordes of daytrippers into the bay and dropping their anchors onto the coral below.\nAccording to Thon Thamrongnawasawat, a marine biologist from Thailand's Kasetsart University, at the time the bay was closed, there was only 8% of coral coverage left, compared to up to 70% some 30 years ago.\nHe's been studying the Maya Bay area for decades, and his was one of the loudest voices calling for the beach to be shut. Initially meant to last just a few months, the closure has been extended indefinitely to give the coral more time to recover.\nHope for Maya Bay's corals\nSince 2018, dive teams have planted 20,000 coral fragments in the bay to help rehabilitate the reef.\n\"It's growing very well,\" Thamrongnawasawat rold DW. \"So we think that Maya Bay will return to be one of the very good coral reefs in maybe 5 to 10 years.\"\nHe says they're hoping to boost coral coverage to 50% within a decade, and to 60% in 15 to 20 years. New species have also been spotted since the closure, including black tip reef sharks who have returned there to breed.\nWhat will change at Maya Bay?\nAuthorities are planning to eventually reopen the bay to tourists, possibly as early as later this year, but they haven't announced a date yet. What is certain, though, is that visiting Maya Bay in the future will be a different experience to the one it used to be.\nTo protect corals, boats bringing in tourists will only be able to dock at a new pier on the opposite side of the island, rather than coming ashore on the beach.\n\"The visitors will come in another way, so they will not touch Maya Bay anymore,\" Songtam Suksawang, the former director of Thailand's national parks department and now an adviser to it, told DW.\nThere will be a cap on the number of tourists at the beach, and on the amount of time they can stay. Visitors will not be allowed to stray from a newly built boardwalk, and they'll have to book online in advance. Park rangers will also use digital trunk radio and other monitoring systems to keep tabs on tour boats.\n\"If we can manage the behavior of the visitors… we can conserve nature,\" Suksawang said, adding that the measures were needed \"if we want to sustain Maya Bay in the long run for the next generation.\"\nCautionary tale\nMaya Bay is just one of many spectacular places in the Phi Phi Islands. And its story could serve as a warning for other sites about the consequences of unchecked mass tourism.\n\"The local reefs can only manage so many stress factors,\" said Hewett from the dive center, who is also a spokesperson for the Phi Phi Island Conservation and Preservation group. In the 27 years he's lived in the area, he says he's seen the number of tourists — and the speedboats bringing them — balloon. Without regulation, or some kind of quota system for the islands, he's worried other pristine spots could suffer the same fate as Maya Bay.\n\"I think we do need to be looking at something which controls and manages the amount of people that come ... if we're going to allow the reefs to recuperate at a normal speed.\"\nBut he acknowledges that \"there are a lot of people that will be very disappointed about doing that because their businesses thrive on mass tourism.\"\nThe overtourism dilemma\nThe number of foreign visitors traveling to Thailand has grown rapidly in the past two decades. In 2000, the country received 9.5 million international arrivals. By 2019, there were nearly 40 million. The largest share of foreign tourists comes from China — where the number of people able to afford travel is only expected to increase as incomes rise — followed by Malaysia, then India, Korea, Laos, Japan and Russia, according to 2019 data.\nFor popular destinations like the Phi Phi Islands, allowing the tourist-dependent economy to thrive while protecting the natural beauty that attracts visitors in the first place can be a difficult balance to strike.\n\"We have to take care of nature, but we have to work with tourists in the long-term. [Fewer people] will mean less money, but we will have a future,\" said Phumipat Phutthipanjapong of the Phi Phi Island Tourist Business Association.\nThe stakeholder group was set up several years ago amid growing tourism to the islands. They organize regular beach cleanups to limit trash, monitor boat activity on the reefs and are working to boost recycling in hotels and restaurants.\nBut beyond sustainability issues, many Phi Phi businesses are now more immediately concerned with the battle to survive the shutdown caused by the coronavirus pandemic.\nA more sustainable path for tourism?\nAccording to Stefan Gössling, a professor of sustainable tourism at Sweden's Lund University, the pandemic could actually be an opportunity for the global tourism sector to set a more sustainable course. Popular destinations, in particular, he says, could ward off the problems that come with mass tourism by embracing business models that focus on quality rather than quantity.\n\"We know that you can attract specific types of tourists who might stay longer, who spend more, who are more interested in participating in local activities,\" he said.\n\"All of a sudden you realize that probably with a few tourists, you will be able to do much more to have a much greater economic impact locally than with many, many more tourists in another scenario.\"\nThe changes at Maya Bay are part of an effort to make tourism more sustainable in the long term, and it will likely take some time for visitor numbers to return to pre-pandemic levels. But Hewett describes it as \"wishful thinking\" to expect local companies to put sustainability ahead of their own survival.\nThe pandemic has been \"positive for the health of marine life\", he said. \"On the other side, there's business and people are in a hurry to try and make money.\"", "article_url": "https://www.dw.com/en/thailand-saving-a-beach-paradise-from-mass-tourism/a-57230396?maca=en-rss_en_environment-22607-xml-atom", "article_date_publish": null, "article_date_modify": null, "article_date_download": "2021-04-23 08:06:38+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>No leakage found</question_title>\n<background>No leakage found</background>\n<resolution_criteria>\n<ul>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>By what year does Thailand aim to increase coral coverage in Maya Bay to 50%?</question_title>\n<background>Maya Bay, a popular tourist destination in Thailand, was closed in 2018 due to environmental damage caused by mass tourism. Efforts are underway to restore the coral reefs, with marine biologists setting targets for coral coverage recovery.</background>\n<resolution_criteria>\n<ul>\n    <li>\n      <b>Source of Truth</b>: The question will resolve based on official statements or reports from Thai authorities or marine biologists, such as announcements from Thailand's national parks department or Kasetsart University.\n    </li>\n    <li>\n      <b>Resolution Date</b>: The resolution occurs when the target year for achieving 50% coral coverage is publicly confirmed by credible sources.\n    </li>\n    <li>\n      <b>Accepted Answer Format</b>: The answer should be a specific year (e.g., \"2030\") as stated in official reports or announcements.\n    </li>\n</ul>\n</resolution_criteria>\n<answer>2030</answer>\n<answer_type>numeric (year)</answer_type>\n</q1>"}
{"article_title": "Madagascar: Cyclone Batsirai destroys homes as it makes landfall", "article_description": "The tropical storm struck Madagascar's eastern coast at full force. Officials have warned it could inflict \"significant and widespread damage.\"", "article_maintext": "Winds reaching 235 km/h (155mph) pounded Madagascar's coast on Saturday as Cyclone Batsirai made landfall.\nIt struck the Mananjary district, more than 530 kilometers (310 miles) southeast of the capital Antananarivo at around 20:00 local time.\nThere were reports of power outages, destroyed homes and fallen trees.\n\"The winds are terrible. I've never experienced this. Mananjary has never experienced such a situation. The waves are very high,\" Hanitra Raharisoa told the Reuters news agency.\nThe country's disaster management agency said 27,000 people had been displaced from their homes.\nWidespread destruction expected\nBatsirai is the second major storm to hit the island nation in less than two weeks.\nStorm Ana caused widespread destruction and killed 55 people when it struck last month. The storm also forced tens of thousands of people from their homes.\nEarlier on Saturday, Madagascar's meteorological office warned Cyclone Batsirai could cause \"significant and widespread damage.\"\nThe National Office for Risk and Disaster Management said the cyclone threatens nearly 600,000 of the island's 28 million people.\nIt has already blown by Mauritius and Reunion, killing at least person in Mauritius.\nThe impact of Batsirai on Madagascar was expected to be \"considerable,\" Jens Laerke, spokesman for the UN's humanitarian organization OCHA, said on Friday.\n\"We are very nervous,\" Pasqualina Di Sirio, who heads the WFP operation in Madagascar, told reporters by video link from the island.\nlo/aw (AP, AFP, Reuters)", "article_url": "https://www.dw.com/en/madagascar-cyclone-batsirai-destroys-homes-as-it-makes-landfall/a-60675891?maca=en-rss-en-top-1022-xml-atom", "article_date_publish": "2017-11-07 00:00:00", "article_date_modify": null, "article_date_download": "2022-02-06 02:33:29+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>No leakage found</question_title>\n<background>No leakage found</background>\n<resolution_criteria>\n<ul>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>How many people will Cyclone Batsirai displace from their homes in Madagascar by November 2017?</question_title>\n<background>Cyclones often cause significant displacement due to destruction of homes and infrastructure. The Madagascar National Office for Risk and Disaster Management tracks displacement figures from natural disasters.</background>\n<resolution_criteria>\n<ul>\n    <li>\n        <b>Source of Truth</b>: The question will resolve based on the official displacement figures reported by the Madagascar National Office for Risk and Disaster Management or a reputable international organization (e.g., UN OCHA) by November 30, 2017.\n    </li>\n    <li>\n        <b>Resolution Date</b>: The resolution occurs on the calendar date when the final displacement figure is publicly reported (no later than November 30, 2017).\n    </li>\n    <li>\n        <b>Accepted Answer Format</b>: The answer must be a whole number (no decimal) representing the total displaced population.\n    </li>\n</ul>\n</resolution_criteria>\n<answer>27000</answer>\n<answer_type>numeric (whole number)</answer_type>\n</q1>"}
{"article_title": "Malaysia, Indonesia seek allies in EU deforestation row", "article_description": "New EU rules set for 2024 call for banning agricultural products from deforested land, which Southeast Asian producers say will subject small farmers to impossible bureaucratic demands from far away in Brussels.", "article_maintext": "Malaysia and Indonesia want to bring other Southeast Asian countries on their side amid ongoing disputes with the European Union over environmental and deforestation regulations that are set to take effect in late 2024, with the two nations worried about the regulations' impact on the region's agriculture exports.\nMalaysian Prime Minister Anwar Ibrahim said earlier this month that his Thai counterpart, Srettha Thavisin, \"has given me the assurance that Thailand would come on board to work together with Malaysia and Indonesia, and hopefully other countries, in presenting our case, particularly to the EU.\"\nIndonesia and Malaysia, which together account for around 85% of global palm oil production, argue that the EU Deforestation-Free Regulation is discriminatory and unfairly punishes small-scale farmers who will struggle to cope with the bureaucratic demands set by Brussels.\nWhat is the new EU deforestation regulation?\nThe EU's regulation will ban imports of cattle, cocoa, coffee, palm oil, rubber, soy and wooden items if they are produced on land that was found to have been deforested after December 31, 2020.\nBoth Southeast Asian states have independently initiated complaints against the EU to the World Trade Organization (WTO).\nWhereas Jakarta has accused Brussels of \"regulatory imperialism\" and Malaysian producers have bemoaned \"crop apartheid,\" other Southeast Asian states have taken a more diplomatic approach, seeking to understand the EU directives unilaterally in one-on-one discussions with EU officials.\nSoutheast Asian governments and producers are most concerned about the incoming EU bureaucratic hurdles necessary to prove their products haven't been grown on deforested land.\nUnder the new EU directive, local companies will have to provide extensive mapping of their entire supply chains, including geolocation data.\nAccording to the EU's terms, these compliance mechanisms will be mandatory for larger companies from December 2024 and a few months later for smaller firms.\n\"The issue of perception is crucial. If the EU's intentions are perceived as illegitimate, policies may be met with skepticism, seen as regulatory imperialism or disguised protectionism,\" said Bernd Lange, chair of the European Parliament's Committee on International Trade.\n\"Active engagement with the countries through, for example, their embassies in Brussels is key,\" Lange told DW. \"I have started such a process and already learned a lot. Understanding specific concerns is essential for finding solutions.\"\nCould Thailand join dispute?\nThailand is the world's third-largest producer of palm oil, after Indonesia and Malaysia. It is also a significant exporter of other products, such as timber, cocoa and rubber, that EU regulations will impact.\nThe country is also the world's biggest rubber producer, and exports of these goods to the EU were worth €1.5 billion last year, according to government data. Malaysia currently sells around 17% of its rubber products to the EU. Vietnam is another major rubber exporter focused on the European bloc.\nAccording to Thai government estimates, small-scale palm oil accounts for 70% of the country's production. But EU officials contend that the deforestation regulation targets large-scale illegal deforestation, not smallholders.\nBridget Welsh, an honorary research associate at the University of Nottingham Asia Research Institute Malaysia, reckons the chances are \"reasonably good\" that Thailand will join Indonesia and Malaysia's campaign as they \"are concerned with the issue and leaning away from the EU in their foreign policy.\"\nHowever, a Thai government official, who requested anonymity because they were not permitted to talk about the issue, told DW it was improbable that Bangkok would join Malaysia and Indonesia in any legal complaints against Brussels, not least because Thailand this year gave the go-ahead to restart stalled talks over a free-trade agreement with the EU.\nInstead, Thailand would become more vocal about the economic impacts of the EU directive and perhaps join Malaysia and Indonesia's Joint Task Force set up in June with the European Union that saw its first roundtable discussions in August, the official said.\nWhat do Indonesia and Malaysia want?\nChris Humphrey, executive director of the EU-ASEAN Business Council, said his organization has long been worried \"about the possibility of concerns from Southeast Asian nations on the EU Green Deal escalating into a significant trade dispute.\"\n\"There are legitimate concerns over implementation, but equally, the objectives of the policies are also legitimate,\" Humphrey added.\n\"It is clear to us that more needs to be done to bridge the gap between both the EU and ASEAN, but that is being done now and hopefully will prevent a further escalation of the dispute.\"\nIndeed, Jakarta and Kuala Lumpur have steered away from their legal challenges and now seem more focused on negotiations with Brussels to lessen the impact of green directives on their economies.\nAs part of a new forum established this year, the two countries are lobbying the EU to be classified as low-risk countries for deforestation, which would simplify due diligence procedures for their companies. Countries deemed a high risk will still have more rigorous checks.\nThey also want the EU's demands to conform to the international standard laid out in 2004, under the Roundtable on Sustainable Palm Oil, and to match deforestation laws of national governments.\n\"It is now our common responsibility to find a solution to regional concerns about the ability of smaller Southeast Asian suppliers to compete,\" said David McAllister, chair of the European Parliament's Committee on Foreign Affairs.\n\"This should be done in a non-patronizing tone of mutual respect,\" he told DW.\n\"Through joint certification, the Joint Task Force that brings producing countries and the European Commission together, as well as through financial support for forest partnerships, we can make meaningful progress.\"\nAccording to a European Commission official speaking on condition of anonymity, the EU is \"significantly stepping up its engagement … to ensure the new law is effectively implemented while working in partnership with producer countries.\"\nThe official said a new initiative related to these disputes will be launched at COP28, which is set to begin in the United Arab Emirates on Thursday.\nEdited by: Wesley Rahn", "article_url": "https://www.dw.com/en/malaysia-indonesia-seek-allies-in-eu-deforestation-row/a-67564595", "article_date_publish": "2023-11-27 14:16:17", "article_date_modify": null, "article_date_download": "2023-11-27 14:33:07+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>No leakage found</question_title>\n<background>No leakage found</background>\n<resolution_criteria>\n<ul>\n    <li>Leakage found -- \"expected by late 2024\" indirectly hints at the answer (December 2024). \n        Replacement -- <b>Source of Truth</b>: The question will resolve based on the official EU announcement or documentation specifying the implementation date for larger companies under the deforestation regulation.</li>\n    <li>Leakage found -- \"expected by late 2024\" indirectly hints at the answer (December 2024). \n        Replacement -- <b>Resolution Date</b>: The resolution occurs when the EU publicly confirms the implementation date.</li>\n    <li>No leakage found</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>What will be the implementation start date for larger companies under the EU deforestation regulation, as per the article?</question_title>\n<background>The EU Deforestation-Free Regulation aims to ban imports of agricultural products linked to deforestation. Compliance mechanisms will be mandatory for companies exporting to the EU.</background>\n<resolution_criteria>\n<ul>\n    <li><b>Source of Truth</b>: The question will resolve based on the official EU announcement or documentation specifying the implementation date for larger companies under the deforestation regulation.</li>\n    <li><b>Resolution Date</b>: The resolution occurs when the EU publicly confirms the implementation date.</li>\n    <li><b>Accepted Answer Format</b>: The exact month and year as stated in the official EU announcement (e.g., \"December 2024\").</li>\n</ul>\n</resolution_criteria>\n<answer>December 2024</answer>\n<answer_type>string (date)</answer_type>\n</q1>"}
{"article_title": "UNESCO reports surge in journalist killings", "article_description": "One journalist was killed every four days in 2022-2023, a new report by the UN's cultural body says. The majority of the crimes went unpunished.", "article_maintext": "Killings of journalists across the world rose 38% in 2022-2023 compared with the two previous years, with 162 verified deaths, according to a new report by UNESCO released on Saturday.\n\"In 2022 and 2023, a journalist was killed every four days simply for doing their vital job to pursue truth,\" UNESCO Director-General Audrey Azoulay said in a statement.\nDangerous regions\nMore than half of the killings in 2022 and 2023 occurred in countries where an armed conflict was taking place, with most journalists being killed in their home countries.\nOther journalists were killed in the course of their work on organized crime or corruption or while reporting on protests, the report said.\nIn 2022, Mexico saw the highest number of journalist killings, with 19 cases, while in 2023 the highest number was in the Palestinian territories, at 24.\nIn general, the report said the most dangerous areas for journalists are Latin America and the Caribbean, as well as Arab countries.\nNorth America and Western Europe were the least dangerous regions for journalists, with six killings.\nAltogether 14 of the journalists killed in 2022-23 were women — 9% of the total.\nWidespread impunity\nThe report showed that most of the cases go unpunished, with 85% percent of cases identified by UNESCO since 2006 still unsolved or abandoned, according to responses figures provided by individual countries.\nThat is a slight decrease compared to 2018, when 89% of cases remained unsolved, and to 2012, when the impunity rate was a whole 95%.\n\"These crimes must not and cannot go unpunished. Yet this is still the case for almost 85% of them,\" Azoulay said.\nThe biannual report by the Paris-based scientific and cultural organization analyses the state of journalists' safety worldwide.\ntj/kb (AFP, dpa)", "article_url": "https://www.dw.com/en/unesco-reports-surge-in-journalist-killings/a-70666861?maca=en-rss-en-all-1573-xml-atom", "article_date_publish": "2024-11-02 07:44:33", "article_date_modify": null, "article_date_download": "2024-11-02 09:12:26+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>No leakage found</question_title>\n<background>No leakage found</background>\n<resolution_criteria>\n<ul>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>How many journalists will be killed in 2024, according to UNESCO's next biannual report?</question_title>\n<background>UNESCO regularly releases reports on the safety of journalists worldwide, including statistics on journalist killings. The reports are published biennially and provide verified data on such incidents.</background>\n<resolution_criteria>\n<ul>\n    <li>\n      <b>Source of Truth</b>: The question will resolve when UNESCO publishes its next biannual report on journalist killings (expected in late 2024 or early 2025), typically available on UNESCO's official website or through official press releases.\n    </li>\n    <li>\n      <b>Resolution Date</b>: The resolution occurs on the calendar date when the 2024 report is formally released by UNESCO.\n    </li>\n    <li>\n      <b>Accepted Answer Format</b>: The exact number of journalist killings in 2024 as stated in the report, provided as a whole number.\n    </li>\n</ul>\n</resolution_criteria>\n<answer>162</answer>\n<answer_type>numeric (integer)</answer_type>\n</q1>"}
{"article_title": "Indian Bollywood star Saif Ali Khan stabbed at Mumbai home", "article_description": "Khan's team said he underwent surgery and was in a stable condition. His wife Kareena Kapoor Khan and their children were unharmed.", "article_maintext": "Indian Bollywood star Saif Ali Khan was admitted to hospital for surgery after being repeatedly stabbed in what was believed to have been a robbery attempt at his home in Mumbai, his public relations team said.\nHis wife, Bollywood star Kareena Kapoor Khan, said she and the couple's two children were fine. A female employee was meanwhile attacked and was receiving treatment, police said.\nWhat do we know about the incident?\nThe 54-year-old Bollywood actor lives in Mumbai's upscale Bandra neighborhood with his wife and two sons. Police said the attack \"appears to be a robbery attempt,\" adding that the perpetrator had been identified and a search was currently underway.\nSince the attack last night, there has been a heavy police presence at Khan's residence. Several Indian news agencies carried footage of officers carrying out investigations.\nThe doctors said Khan was \"on the path to complete recovery\" after surgery.\n\"He sustained a major injury to the thoracic spinal cord due to a lodged knife in the spine. Surgery was performed to remove the knife and also repair the leaking spinal fluid,\" said Nitin Dange, one of the doctors operating on Khan.\nIncident shocks stars, politicians\nWishes and prayers for his recovery poured in from members of the film industry and other celebrities.\n\"Shocked and saddened to hear about the attack on Saif sir. Wishing and praying for his speedy recovery and good health,\" actor NT Rama Rao Jr. said on X.\nOthers expressed concern over the security breach.\n\"If such high-profile people with [high] levels of security can be attacked in their homes, what could happen to common citizens?\" Clyde Crasto, spokesperson of the Nationalist Congress Party, wrote on X.\nKhan has appeared in around 70 films and television series in his career, some of which he has also produced.\nHe is the son of cricketer Mansur Ali Khan Pataudi and actress Sharmila Tagore.\ntg/rmt (AFP, Reuters)", "article_url": "https://www.dw.com/en/indian-bollywood-star-saif-ali-khan-stabbed-at-mumbai-home/a-71305985?maca=en-rss-en-asia-5133-rdf", "article_date_publish": "2025-01-16 09:56:55", "article_date_modify": null, "article_date_download": "2025-01-16 14:57:59+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>Leakage found -- The phrase \"condition of Saif Ali Khan after surgery as stated by his doctors\" indirectly hints at a positive outcome, which aligns with the answer \"on the path to complete recovery.\" \nReplacement -- What will be the medical prognosis for Saif Ali Khan by January 2025?</question_title>\n<background>No leakage found</background>\n<resolution_criteria>\n<ul>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n    <li>Leakage found -- The phrase \"describe his condition post-surgery\" hints at a specific outcome. \nReplacement -- The exact phrase used by the doctors to describe his medical prognosis must be provided. The answer should match the wording in the official statement.</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>What will be the medical prognosis for Saif Ali Khan by January 2025?</question_title>\n<background>Saif Ali Khan, a prominent Bollywood actor, was stabbed in a robbery attempt at his Mumbai home and underwent surgery for his injuries.</background>\n<resolution_criteria>\n<ul>\n    <li>\n      <b>Source of Truth</b>: The question will resolve based on the official statement from the doctors treating Saif Ali Khan, as reported by credible news sources like AFP or Reuters by January 2025.\n    </li>\n    <li>\n      <b>Resolution Date</b>: The resolution occurs by the end of January 2025, based on the latest available medical update.\n    </li>\n    <li>\n      <b>Accepted Answer Format</b>: The exact phrase used by the doctors to describe his medical prognosis must be provided. The answer should match the wording in the official statement.\n    </li>\n</ul>\n</resolution_criteria>\n<answer>on the path to complete recovery</answer>\n<answer_type>string (medical condition)</answer_type>\n</q1>"}
{"article_title": "India: More than 60 people rescued after deadly building collapse", "article_description": "Rescue teams carried out search operations all night, racing to reach survivors after a deadly building collapse outside Mumbai. While the cause of the collapse is unclear, charges have been filed against the builder.", "article_maintext": "Rescue teams pulled out around 60 people from a collapsed five-story apartment building in the town of Mahad in Raigad district, 160 kilometers (99 miles) south of Mumbai, the district administration said on Tuesday.\nThe building, comprising 47 apartments, collapsed on Monday evening, Maharashtra state police said.\nIndia's National Disaster Response Force (NDRF) sent rescue crews and canine teams to the site of the accident.\nAt least two people have been confirmed dead and 18 are still trapped under the rubble, district officials said.\n\"Initially the top three floors of the building collapsed when some people came out,\" said Nidhi Choudhari, the District Collector. There were fewer people in the building since Monday was a working day, she said.\nThree teams of the NDRF are carrying out rescue operations, said state minister Aditi Tatkare who visited the site on Tuesday morning.\n\"Those with serious injuries were taken to Mumbai for advanced treatment,\" she told the Hindustan Times newspaper. \"Probe has begun. We want a special investigation team to be constituted,\" Tatkare added.\nArchitect to face charges\nThe district administration has filed charges against the builder, the architect, and the contractor late Monday.\nUddhav Thackery, chief minister of Maharashtra state, where Mahad is located, gave local authorities his assurance of support for speedy rescue and relief work in a statement on Twitter.\nThe cause of the collapse was not entirely clear. Such incidents are not uncommon in India, particularly during the monsoon season, when rainy conditions make buildings with shoddy construction more vulnerable. Earlier this month, a crane collapse at an Indian shipyard killed at least 11 workers.\nMore than 1,200 deaths worldwide have been attributed to monsoon-related disasters this year, including 800 in India.\nRead more:Mumbai struggles to cope with crumbling infrastructure\ndr,adi/dj (dpa, AFP, Reuters)", "article_url": "https://www.dw.com/en/india-more-than-60-people-rescued-after-deadly-building-collapse/a-54680458?maca=en-rss-en-top-1022-rdf", "article_date_publish": "2017-11-07 00:00:00", "article_date_modify": null, "article_date_download": "2020-08-25 04:09:15+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>No leakage found</question_title>\n<background>No leakage found</background>\n<resolution_criteria>\n<ul>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>How many people will be confirmed dead in the Mahad building collapse by November 2017, as stated by district officials?</question_title>\n<background>A five-story apartment building collapsed in Mahad, India, on November 6, 2017. Rescue operations were conducted to save survivors and recover victims.</background>\n<resolution_criteria>\n<ul>\n    <li>\n      <b>Source of Truth</b>: The question will resolve based on the official death toll reported by district officials in November 2017, as cited in credible news sources (e.g., Reuters, AFP, or dpa).\n    </li>\n    <li>\n      <b>Resolution Date</b>: The resolution occurs when the final confirmed death toll is reported by district officials by the end of November 2017.\n    </li>\n    <li>\n      <b>Accepted Answer Format</b>: The answer must be an exact whole number representing the confirmed death count.\n    </li>\n</ul>\n</resolution_criteria>\n<answer>2</answer>\n<answer_type>numeric (integer)</answer_type>\n</q1>"}
{"article_title": "Opinion: Bad news for professional sports, good news for German society", "article_description": "After a German government decision aimed at combating the Omicron variant of COVID-19, the second half of the Bundesliga season is to start with games behind closed doors. This is only logical, writes Thomas Klein.", "article_maintext": "So, it's happening again; so-called \"ghost games\" are returning to the Bundesliga. As of December 28, all professional sports, cultural and other comparable major events will be forced behind closed doors – no spectators allowed.\nChancellor Olaf Scholz announced the measures on Tuesday evening saying the government's aim was to reduce personal contactas a way of curbing the risk of infection.\nWhen the second half of the Bundesliga season kicks off with the match between Bayern Munich and Borussia Mönchengladbach on January 7, TV viewers will once again be able to clearly hear the discussions between coaches and the officials on the pitch. The chanting of the supporters, celebrations of goals in the stands – in short, the emotions that make football so special – will again be silenced for an indefinite period of time.\nMajor loss of revenue for Bundesliga clubs\nAnd it didn't take long before the outcry of the club bosses, which cannot be ignored, could be heard in the media. Cologne managing director Alexander Wehrle stated that his club stood to lose €1.8 million ($2.03 million) for every matchday played behind closed doors. Bayern Munich officials spoke of losses of between €4 million to €5 million per home game – but they should be able to take this in stride due to the club's well-filled fixed deposit account. And earlier in the week, the newly elected chairman of the supervisory board of the German Football League (DFL), Hans-Joachim Watzke said: \"Professional football in Germany has coherent plans as outdoor events with already significantly reduced spectator capacity.\"\nOmicron unimpressed\nSure, stable infection figures after matchdays certainly speak for the Bundesliga and its game day plans. But don't expect Omicron to pay any heed to the Bundesliga clubs' existing measures.\nThe dangerous thing about this new variant is that it appears to be many times more contagious than its predecessors. Even more than before, the real dangers lurk during \"arrival and departure, in the toilets and then, of course, in the (VIP) boxes,\" explains aerosols researcher Gerhard Scheuch.\nAnd experience has shown that it is not always possible to maintain sufficient physical distancing on the way to or from a match. Fans crowded together on buses, trains and in front of the entrance gates of the stadiums – amount to a virtual paradise for this highly contagious variant of the virus. Even if plans for getting fans into and out of stadiums have improved, the risk still exists. In this respect, the government's decision is correct and, above all, consistent.\nAfter all, it is not only football that will have to do without support from the stands in the next few weeks. Other sports leagues, such as the Basketball Bundesliga, the German Ice Hockey League (DEL) and the men's Handball Bundesliga, will also have to do without their fans. And these sports will be hit much harder by the exclusion of spectators. None of these leagues can fall back on TV contracts worth millions – as they can in the Bundesliga and Bundesliga 2.\nGhost games for all!\nSo, this time, there is no special treatment for football. There are no exceptions for indoor or outdoor sports. It's \"ghost games\" for everyone! And yes, this is really not good news for professional sports. But it is good news for German society as a whole. Because a worldwide pandemic is not a time for individual sensitivities to be taken into account. Not even when it comes to the Bundesliga.\nThis article was translated from German.", "article_url": "https://www.dw.com/en/opinion-bad-news-for-professional-sports-good-news-for-german-society/a-60227298?maca=en-rss-en-sports-1027-rdf", "article_date_publish": null, "article_date_modify": null, "article_date_download": "2021-12-22 16:26:34+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>Leakage found -- The question title mentions \"as announced by the German government,\" which implies the answer is already known or announced. \nReplacement -- When will the second half of the Bundesliga season start with games behind closed doors?</question_title>\n<background>No leakage found</background>\n<resolution_criteria>\n<ul>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>When will the second half of the Bundesliga season start with games behind closed doors?</question_title>\n<background>The Bundesliga is Germany's top professional football league. Due to the Omicron variant of COVID-19, the German government has implemented measures to reduce personal contact, including restricting spectator attendance at major events.</background>\n<resolution_criteria>\n<ul>\n    <li>\n      <b>Source of Truth</b>: The question will resolve based on the official announcement by the German government or the Bundesliga regarding the start date of the second half of the season with games behind closed doors.\n    </li>\n    <li>\n      <b>Resolution Date</b>: The resolution occurs on the calendar date when the second half of the Bundesliga season officially begins with games behind closed doors.\n    </li>\n    <li>\n      <b>Accepted Answer Format</b>: The exact date (day, month, year) as announced by the German government or the Bundesliga.\n    </li>\n</ul>\n</resolution_criteria>\n<answer>7 January 2022</answer>\n<answer_type>string (date)</answer_type>\n</q1>"}
{"article_title": "Germany presents new €200 billion relief plan in response to soaring energy prices", "article_description": "Germany's ruling coalition has come up with a plan to reduce the impact of spiraling energy costs on consumers. The measures include a cap on gas prices, which have soared amid fallout from Russia's invasion of Ukraine.", "article_maintext": "The German government on Thursday presented plans for an energy relief package worth €150-200 billion ($145-194 billion) as households are faced with rapidly rising energy bills.\nThe package was announced at a press conference in Berlin given by Chancellor Olaf Scholz, Economy Minister Robert Habeck and Finance Minister Christian Lindner.\nThe new relief measures include a gas price cap that is to be financed by the Economic Stabilization Fund (WSF), which was originally set up to cushion the economic and social impacts of the coronavirus pandemic on the economy.\nAlthough the WSF officially expired in the summer, it is now to receive extra funding.\nThe measures do not include a previously planned gas levy in an effort to protect companies forced to purchase more expensive gas than that from Russia. It was to have gone into force October 1.\nFinancing the gas price cap had been a major challenge for the government, with Lindner insisting that Germany reimpose its limits on net borrowing, which had been temporarily lifted during the pandemic, by next year.\nWhat did the government say?\nScholz spoke of the necessity of reducing energy prices for consumers and businesses, saying gas prices had \"to come down.\"\nThe chancellor said that Germany's public finances remained stable.\nHabeck said the situation was still critical and stressed that gas consumption needed to still be reduced.\nMore to follow.\ntj/sms (AFP, dpa)", "article_url": "https://www.dw.com/en/germany-presents-new-200-billion-relief-plan-in-response-to-soaring-energy-prices/a-63279609", "article_date_publish": "2017-11-07 00:00:00", "article_date_modify": null, "article_date_download": "2022-09-29 12:23:12+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>No leakage found</question_title>\n<background>No leakage found</background>\n<resolution_criteria>\n<ul>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>What will be the total amount (in billions of euros) of Germany's new energy relief package, as announced by the government in November 2017?</question_title>\n<background>Germany's government has proposed an energy relief package to address rising energy costs for consumers and businesses. The package includes measures such as a gas price cap.</background>\n<resolution_criteria>\n<ul>\n    <li>\n      <b>Source of Truth</b>: The question will be resolved based on the official announcement made by the German government, as reported by credible news sources like AFP or dpa on or after November 7, 2017.\n    </li>\n    <li>\n      <b>Resolution Date</b>: The resolution occurs on the date when the German government publicly announces the final approved amount of the relief package.\n    </li>\n    <li>\n      <b>Accepted Answer Format</b>: The answer must be a numerical value in billions of euros, rounded to the nearest whole number or specified range as officially announced.\n    </li>\n</ul>\n</resolution_criteria>\n<answer>150-200</answer>\n<answer_type>numeric (range in billions of euros)</answer_type>\n</q1>"}
{"article_title": "Winnie-the-Pooh: When cuddly toys turn into monsters", "article_description": "In the new horror flick \"Winnie the Pooh: Blood and Honey,\" a beloved children's book character mutates into a killer. But it's happened before.", "article_maintext": "Winnie-the-Pooh, the cuddly and wise bear, is not the first character most would think to cast as the murderous villain of a slasher movie. So it was indeed curious when images and footage from the R-rated horror movie with the ominous title \"Winnie the Pooh: Blood and Honey\" went viral online in 2022.\nAfter the copyrights to Alan Alexander Milne's classic children's books \"Winnie-the-Pooh\" expired on January 1, 2022, the character became part of the public domain. As a result, since then, anyone can use and depict the iconic figure as they wish.\nThe first images from \"Winnie the Pooh: Blood and Honey\" appeared in last May last year. The idea of a slasher movie starring the yellow furry animal and his best pal, Piglet — also feral and bloodthirsty — was met with mixed reactions on the web. Some found Pooh's mutation into a killer funny, while others called for the film to be banned.\nDespite bad reviews, the film has become a box office hit. The low-budget production, made with just $100,000 (€94,165), was originally planned for a streaming-only release and just a single day in cinemas. But following an initial release in Mexico on January 27 and in the US and different countries on February 15, it has already earned over $3 million at the global box offices, according to Box Office Mojo.\nDirector Frake-Waterfield gets death threats\nIn the film, an adult Christopher Robin returns to the Hundred Acre Wood, where his childhood friends Winnie-the-Pooh and others live. Pooh and Piglet, however, have become murderous creatures.\nThe difference between the horror Pooh and the original is clear: Instead of a red T-shirt, he wears a lumberjack shirt, and wears a Pooh mask and rubber gloves.\nThe film's director, Rhys Frake-Waterfield, said he has even received death threats from Winnie-the-Pooh fans. But at the same time, the British director told Associated Press he was completely overwhelmed by the film's surprise success.\n\"Winnie the Pooh: Blood and Honey\" isn't the first horror film in which seemingly innocuous characters commit gruesome murders.\nIn Ivan Reitman's popular 1984 scary comedy \"Ghostbusters,\" the chaotic hero squad's adversary, an ancient malevolent god named Gozer, attacks New York in the form of a giant marshmallow man, a fictional advertising figure for a candy popular in the United States. Although the ghost hunters' rival is constantly grinning, he's still hellbent on destroying everything in his path.\nMarshmallow men and furry animals\n\"Ghostbusters,\" unlike \"Winnie the Pooh: Blood and Honey,\" had a large budget of $31 million (€29 million). The film was extremely successful and grossed almost 10 times that amount worldwide and is one of the most successful films of all time.\nSeveral sequels followed, most recently \"Ghostbusters: Afterlife,\" with another part scheduled for release in 2023.\n\"Gremlins,\" also released in 1984, is a horror comedy by director Joe Dante in which an inventor named Randall Peltzer buys a small furry animal named Gizmo from a mysterious dealer in Chinatown to give to his son Billy.\nIt's a mogwai, a Chinese demon, but harmless in this case. However, when the cute fellow gets wet, numerous vicious devils burst out of him, which subsequently turn into reptilian monsters and terrorize the idyllic small town where the Peltzers live.\nThe film grossed $148 million in the US alone. The sequel \"Gremlins 2: The New Batch\" followed in 1990.\nMurderous Chucky\nThe slasher film \"Child's Play,\" about the murderous doll Chucky, is pure horror flick material, unlike \"Gremlins\" or \"Ghostbusters.\" Despite its toy antagonist, it's not kid stuff.\nAlthough it wasn't an immediate hit when it was released in 1988, over time it became a cult classic among horror fans and was even expanded into a film series.\nIn the original film, the ghost of serial killer Charles Lee Ray is transported into a child's doll thanks to a voodoo ritual.\nWhether murderous or not, Winnie-the-Pooh is unlikely to be the last character moving into public domain that will be used in unexpected ways. Other famous characters that can soon be used by the public include Mickey Mouse in his original form in \"Steamboat Willie\" (1928), Bugs Bunny, Batman and Superman.\nThe director of \"Winnie the Pooh: Blood and Honey,\" Rhys Frake-Waterfield, is also looking forward to this: \"There's going to be so many different and cool unique iterations coming off that. I might do one.\"\nThis article was originally written in German.", "article_url": "https://www.dw.com/en/winnie-the-pooh-when-cuddly-toys-turn-into-monsters/a-64801823", "article_date_publish": "2023-02-28 10:58:11", "article_date_modify": null, "article_date_download": "2023-02-28 11:27:30+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>No leakage found</question_title>\n<background>No leakage found</background>\n<resolution_criteria>\n<ul>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>How much will \"Winnie the Pooh: Blood and Honey\" gross at the global box office by the end of February 2023?</question_title>\n<background>\"Winnie the Pooh: Blood and Honey\" is a low-budget horror film based on the public domain character Winnie-the-Pooh. The film was released in Mexico on January 27, 2023, and in the US and other countries on February 15, 2023.</background>\n<resolution_criteria>\n<ul>\n    <li>\n      <b>Source of Truth</b>: The question will resolve based on the official box office revenue figures reported by Box Office Mojo for \"Winnie the Pooh: Blood and Honey\" as of February 28, 2023.\n    </li>\n    <li>\n      <b>Resolution Date</b>: The resolution occurs on February 28, 2023.\n    </li>\n    <li>\n      <b>Accepted Answer Format</b>: The answer should be a numeric value representing the total global box office gross in US dollars, rounded to the nearest million (e.g., \"3 million\"). \n    </li>\n</ul>\n</resolution_criteria>\n<answer>3 million</answer>\n<answer_type>numeric (whole number)</answer_type>\n</q1>"}
{"article_title": "Fleeing Ukraine war, Russian deserters find refuge in France", "article_description": "France has become the first EU country to admit former Russian soldiers without a passport. They oppose the Ukraine war, and now want to apply for asylum.", "article_maintext": "\"Deserters are not traitors, and desertion is not a crime, because there is no other way out of this situation,\" said Alexander. The young Russian man said it is \"a reasonable decision for a well-educated person not to take part in a war of aggression.\"\nAlexander is one of six Russian deserters who have arrived in Paris in recent months. He didn't want to give his family name, to protect his identity. They first fled to Kazakhstan, and then on to France during 2022 and 2023. They are now hoping to be granted political asylum.\nPro Asyl, a German human rights and refugee protection association, estimates that at least 250,000 military conscripts have sought protection in other countries from February 2022, when Russia launched its war against Ukraine, through September 2023.\nMost have sought safety in Kazakhstan, Georgia, Armenia, Turkey, Serbia and Israel. There are reports, however, that deserters have been deported back to Russia from Kazakhstan and Armenia.\nPro Asyl said only a few Russian soldiers fled to any of the Schengen states. Reaching these countries is challenging, and EU countries have very restrictive visa regulations.\nFrance sets precedent\nFrance has now become the first EU country to allow former military personnel who oppose Russia's war on Ukraine to enter the country without a passport. However, the men were previously vetted in Kazakhstan to rule out any issues.\n\"I understand the concerns of Western countries and why they do not hand out travel documents to many deserters, as they could include Russian secret service agents or war criminals,\" said Alexander. This is why the men's journey from Russia and onward travel was monitored.\n\"We checked the background of all six deserters,\" Alexei Alshansky of the Conflict Intelligence Team (CIT), an independent investigative organization originally from Russia, told DW. CIT itself was forced to leave Russia in 2022.\nAlshansky is a former member of the Russian military who has helped deserters come to France. \"At some point, we contacted human rights activists in the EU and then the advocacy work began, lasting a year,\" said Alshansky. \"The deserters were in Kazakhstan that whole time.\"\n'I didn't know why we were in Ukraine'\nOf the six men now hoping to be granted asylum in France, only Alexander was directly involved in the Russian invasion of Ukraine, where he served as an officer. In the winter of 2022, he was stationed in Crimea, which had been annexed by Russia.\nAt first, everything looked as if Russia was running a military exercise, he told DW. But on February 24, 2022, all soldiers were sent off in a convoy.\n\"There was no order to attack Ukraine, there were no instructions, we simply crossed the Ukrainian border and only then did we realize what was going on,\" Alexander recalled. \"I was shocked and didn't know why we were in Ukraine.\"\nHe said he did not want to take part in the military operation, but he was also aware that he could not simply turn back.\n\"Either my own people would have shot me, or I would have been arrested at the border. I needed a legal way to get back to Russia,\" he said.\nWhen he was finally granted leave and returned home to Russia, he immediately applied for his discharge from the army. But in September 2022, Russia announced a partial mobilization.\n\"It was clear to me I would either be jailed or sent back to the front line, unless I fled Russia,\" he said.\nStopover in Kazakhstan\nKazakhstan is one of the few countries Russians can enter without a passport. Many Russian men have sought refuge there, including Alexander. After arriving in the country, he contacted human rights activists through acquaintances and applied for asylum.\n\"I knew it would be difficult to get protection in Kazakhstan, as Kazakhstan is still dependent on Russia to a certain extent,\" he said. \"I wasn't granted refugee status, but at least my legal stay was extended.\"\nAlexander also visited Western embassies seeking help. \"I knew that I couldn't apply for asylum there, and that I could only do so on the territory of the country,\" he said.\nAfter two years in Kazakhstan, he was finally able to leave for France. \"We were given permission to enter France because we actively oppose the war, not because we were deserters,\" he said.\nNo evidence of war crimes\n\"His involvement in the [Russian] invasion [of Ukraine] was not up to him,\" said CIT's Alshansky, even as he admitted that one cannot be absolutely sure that the deserters' stories are true.\nThat said, there is no evidence Alexander committed war crimes in Ukraine. \"He should therefore be granted humanitarian protection, and it is a great fortune he has received it,\" said Alshansky.\nAlshansky is also aware that Ukrainians cannot understand why former Russian soldiers are granted such protection. For Ukrainians, \"it may be difficult to see the situation from the other side [of the conflict] and realize that not all Russian soldiers want to fight in Ukraine,\" he said. There were a lot of Russian soldiers who only wanted to survive and may not necessarily have wanted to fight.\nAlshansky pointed out that international law says a person is not automatically classified as a war criminal just because they participate in a war. \"In the context of armed conflict, humanitarian law guarantees protection to all persons who are not involved in committing war crimes,\" he said.\nRussian deserters get no support at home\nThe number of Russian deserters has been growing since the beginning of the Ukraine war, according to CIT. This large section of the Russian population does not get any support from Russian society, even though deserting is \"a really courageous step,\" according to Alshansky.\n\"When someone attends an anti-war demonstration holding a 'no to war' placard and then spends several days behind bars as a result, they are considered a hero,\" he said. \"Such people can get a visa for another country, there are international programs for them. But if someone flees Russia after spending weeks in a pit, starving and being beaten because they refused to take part in Putin's war, they get no support.\"\nRussian deserters usually only receive support from foreign human rights organizations. \"Russian civil society is not inclined to help deserters,\" said Alshansky. \"It is basically paralyzed when it learns that a person has fled the Russian army. This attitude is unfair, to say the least.\"\nThe six Russian deserters taken in by France are now doing their bit to help other Russian men fleeing the army. They have even established an association called \"Adieu, weapons!\"\nThis article was originally written in Russian.", "article_url": "https://www.dw.com/en/fleeing-ukraine-war-russian-deserters-find-refuge-in-france/a-70665369", "article_date_publish": "2024-11-02 17:23:30", "article_date_modify": null, "article_date_download": "2024-11-03 12:03:10+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>No leakage found</question_title>\n<background>No leakage found</background>\n<resolution_criteria>\n<ul>\n    <li>Leakage found -- The source of truth mentions \"November 2, 2024,\" which indirectly reveals the answer by specifying the exact date of the article containing the answer.  \n    Replacement -- <b>Source of Truth</b>: The question will resolve based on the number of Russian deserters explicitly stated in a credible report or article published in November 2024.</li>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>How many Russian deserters have arrived in France seeking asylum by November 2024?</question_title>\n<background>Since the start of Russia's war against Ukraine in February 2022, many Russian soldiers have deserted and fled to other countries to avoid participation in the conflict. Some have sought asylum in European Union countries.</background>\n<resolution_criteria>\n<ul>\n    <li><b>Source of Truth</b>: The question will resolve based on the number of Russian deserters explicitly stated in a credible report or article published in November 2024.</li>\n    <li><b>Resolution Date</b>: The resolution occurs on the date of the article's publication (November 2, 2024).</li>\n    <li><b>Accepted Answer Format</b>: The answer must be a whole number representing the exact count of deserters mentioned in the article.</li>\n</ul>\n</resolution_criteria>\n<answer>6</answer>\n<answer_type>numeric (whole number)</answer_type>\n</q1>"}
{"article_title": "Tanzanian activist Tsehai kidnapped in Kenya: Amnesty", "article_description": "Tanzanian rights activist Maria Sarungi Tsehai was reportedly abducted in Nairobi. Kenya has a record of allowing foreign governments to abduct their citizens on its soil.", "article_maintext": "Tanzanian rights activist Maria Sarungi Tsehai was abducted in Kenya's capital, Nairobi, on Sunday, Amnesty International and her organization reported.\nTsehai was grabbed by three armed men in a black Toyota Noah in Nairobi's Kilimani area, according to Amnesty Kenya.\nWhat do we know about Tsehai's disappearance?\nTsehai, who has 1.3 million followers on X, advocates for political reform, freedom of expression, and women's rights in her country.\nShe is also a fierce critic of Tanzania's President Samia Suluhu Hassan.\nChange Tanzania, Tsehai's social movement, wrote on X that they believe her \"abductors\" are Tanzanian security agents, \"operating beyond Tanzania borders to silence... legitimate criticism.\"\nIt said that her \"courage in standing up for justice has made her a target, but we won't let this moment silence her voice.\"\nTsehai has been living in \"exile\" in Kenya since 2020, Tundu Antiphas Lissu, a leader of Tanzania's opposition Chadema party, said.\n\"We must call upon the Kenyan government and all people of goodwill from around the world to intervene in whatever capacity they can to help secure Maria's safe return to her family,\" he said.\nStephen Jackson, the UN Resident Coordinator in Kenya said he was \"very concerned\" about Tsehai\"s reported abduction.\n'Worrying trend of transnational repression'\nThere have been previous reports of foreigners in Kenya being captured and deported without proper legal procedures.\nIn October 2024, the UN's refugee agency (UNHCR) said it was \"deeply concerned\" over reports that four Turkish refugees had been abducted in the capital Nairobi, and forcibly returned to Turkey.\nKenya's Foreign Ministry said the four people were repatriated at the request of the Turkish government.\nIn November, Uganda said it worked with Kenyan authorities to arrest Ugandan opposition politician Kizza Besigye in Nairobi. They brought him back to Kinshasa to face a military trial.\nIt is \"part of a growing and worrying trend of transnational repression with governments violating human rights beyond their borders,\" Tigere Chagutah, Amnesty International's Regional Director for East and Southern Africa, said in a statement.\nTanzania's crackdown on dissent\nTanzania's opposition is accusing the government of cracking down on criticism.\nWhen President Samia Suluhu Hassan took office in 2021, she was initially praised for enhancing democratic freedoms after succeeding her autocratic predecessor, John Magufuli.\nBut she now faces growing domestic and international criticism over her government's human rights record.\nRights groups and Western governments have condemned what they perceive as a resurgence of repression, with opposition politicians facing frequent arrests, abductions, and even killings.\nTanzanian authorities have not yet commented on Tsehai's disappearance.\ness/lo (AFP, DW sources)", "article_url": "https://www.dw.com/en/tanzanian-activist-tsehai-kidnapped-in-kenya-amnesty/a-71279321?maca=en-rss-en-all-1573-xml-atom", "article_date_publish": "2025-01-12 17:30:37", "article_date_modify": null, "article_date_download": "2025-01-12 18:48:53+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>No leakage found</question_title>\n<background>No leakage found</background>\n<resolution_criteria>\n<ul>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>Will Maria Sarungi Tsehai be released by Tanzanian authorities by March 2025?</question_title>\n<background>Maria Sarungi Tsehai is a Tanzanian rights activist who was reportedly abducted in Nairobi, Kenya. Her organization claims Tanzanian security agents may be responsible for her abduction.</background>\n<resolution_criteria>\n<ul>\n    <li>\n      <b>Source of Truth</b>: The question will resolve based on official statements from Tanzanian authorities or credible news reports confirming her release by March 2025.\n    </li>\n    <li>\n      <b>Resolution Date</b>: The resolution occurs on or before March 31, 2025.\n    </li>\n    <li>\n      <b>Accepted Answer Format</b>: \"Yes\" or \"No\" based on whether she is confirmed to have been released by Tanzanian authorities by the specified date.\n    </li>\n</ul>\n</resolution_criteria>\n<answer>No</answer>\n<answer_type>String (Yes/No)</answer_type>\n</q1>"}
{"article_title": "Bundesliga transfer blog: Goalkeeper change in Berlin", "article_description": "Union Berlin and Augsburg effectively swap goalkeepers. Elsewhere, Sandro Wagner has become the latest ex-Germany player to retire, following Andre Schürrle and Benedikt Höwedes.", "article_maintext": "Latest moves\nFrankfurt and Hoffenheim swap players\nLuthe moves to the capital\nSandro Wagner quits\nGermany's transfer window is open between July 15 and October 5. Here are the latest deals from the Bundesliga...\nAugust 4\nDone deal:\nMijat Gacinovic — Frankfurt to Hoffenheim\nSteven Zuber — Hoffenheim to Frankfurt\nThis one is a surprise swap. Attacking midfielder Mijat Gacinovic is off to Frankfurt, the 25-year-old signing a deal until 2024, while wide man Steven Zuber (28) goes the other way.\nDone deal: Andreas Luthe — Augsburg to Union Berlin\nAfter Rafal Gikiewicz left Union to join Augsburg, now it's the capital club who have taken a keeper off Augsburg. Andreas Luthe (33), who impressed in the latter stages of last season, has joined Union Berlin.\nAugust 3\nDone deal: Philipp Bargfrede — Werder Bremen to free agent\nWerder Bremen are clearing house. After 16 years and 239 games at the club, Philipp Bargfrede has been let go by the club. Sebastian Langkamp has also been released by Bremen at the end of his contract.\nRumor: Jadon Sancho — Borussia Dortmund to Manchester United\nOn the day Dortmund's preseason started, Bild are reporting that Premier League side Manchester United are considering paying the €120 million asking price in installments, with the majority of the overall sum coming upfront. Dortmund have reportedly given United a deadline of August 10 to get the deal done.\nAugust 2\nDone deal: Sandro Wagner — Tianjin Teda to retirement\nFormer Germany striker Sandro Wagner is ending his playing career, but will obtain a coaching licence with the aim of becoming a coach from next year onwards.\nWagner, 32, started his career at Bayern Munich before playing for Werder Bremen, Hertha Berlin and Hoffenheim. He returned to Munich for the 2018-19 season before a final stint with China's Tianjin Teda.\nAugust 1\nDone deal: Rangnick departs Red Bull\nRalf Rangnick has ended his long association with Red Bull as his contract as Head of Development Soccer has been disbanded, the Austrian energy drinks company have confirmed.\nRangnick has been with Red Bull since 2012, first as sports director at Red Bull Salzburg, then as twice coach and sports director of RB Leipzig before taking on a wider development role in 2019.\n\"For me the right time has come to end my work at Red Bull,\" Rangnick said, thanking Red Bull owner Dietrich Mateschitzt that he \"gave me the opportunity to create something unique.\"\nJuly 31\nDone deal: Benedikt Höwedes — Lokomotiv Moscow to retirement\nFormer Germany defender Benedikt Höwedes has ended his footballing career, becoming the latest 2014 World Cup winner to hang up his boots. The 32-year-old defender told Spiegel news magazine that he had made the decision in order to spend more time with his young family.\nHöwedes made 44 appearances for Germany and was a starter at left back in all of their games at the 2014 World Cup in Brazil. Höwedes joined Schalke at the age of 13 and played there until 2017 when he was stripped of the captaincy by then-new coach Domenico Tedesco and left out of the side. Höwedes then went out on loan to Juventus and spent the last two years at Lokomotiv Moscow.\nDone deal: Dayot Upamecano – RB Leipzig extension\nDayot Upamecano is staying put at RB Leipzig, at least for now. The Frenchman, 21, has signed a contract extension that runs until 2023. The center back had been strongly linked to English Premier League side Arsenal in recent weeks but said he's looking forward to continuing to help this \"young and hungry team in an incredibly ambitious club\" take the next step in its development.\nJuly 30\nDone deal: Patrick Erras – Nuremberg to Werder Bremen\nWerder Bremen have dipped into the free agency market signing Erras, whose contract had run out with Nuremberg, the club he joined back in 2007. The 25-year-old holding midfielder made 23 appearances in all competitions for FCN last season, scoring three times.\nRumor: Pedri – Barcelona to Borussia Mönchengladbach\nGladbach sporting director Max Eberl has confirmed the club’s interest in signing Spain Under-19 international Pedri calling him “a very interesting player” when talking to ‘Gladbach Live’. A loan deal is being discussed for the player set to join Barca from Las Palmas this summer.\nDone deal: Oliver Baumann – Hoffenheim extension\nBaumann has cited being “highly valued” as one of the main reasons behind sign a contract extension that will see him stay with Hoffenheim through until 2023. 1899’s undisputed No1 has been with the club for six years making 198 appearances in all comeptitions.\nJuly 29\nRumor: Jerome Boateng — Bayern Munich to Premier League\nBoateng was a surprise package in the 2019/20 Bundesliga campaign, but with his Bayern contract running out in 2021, he has not ruled out a return to England. \"I would never say no […] I loved playing in the Premier League\" he said on Bayern’s Audi Digital Summer Tour 2020.\nRumor: Matthias Ginter — Chelsea/Atletico Madrid\nHaving already been linked with a move to Inter Milan, reports now suggest that Chelsea and Atletico Madrid are also chasing the services of Gladbach center-back Matthias Ginter. His contract is due to run out at the end of next season, making this summer a pivotal window for the 26-year-old.\nJuly 28\nDone deal: Gregor Kobel — Hoffenheim to Stuttgart\nFresh from signing Waldemar Anton, Stuttgart snapped up another youngster with Bundesliga experience by making 22-year-old Kobel loan move permanent. The goalkeeper is expected to cost the newly-promoted side €4 million ($4.68m) with further performance related bonuses.\nDone deal: Waldemar Anton — Hannover to Stuttgart\nFor a reported €4 million, the 24-year-old center back has returned to the Bundesliga. Once one of the most promising defenders in Germany, Anton will be keen to rediscover that form with Stuttgart, a team who has long been interested in him.\nDone deal: Ermedin Demirovic — Alaves to Freiburg\nThe 22-year-old striker joins Freiburg from La Liga side Alaves for a reported €3.7 million. Demirovic was on loan at Swiss side St. Gallen last season where he scored 13 goals.\nJuly 27\nRumor: Jonathan Ikone — Lille to Dortmund\nManchester United secured Champions League football for next season on Sunday, meaning their interest in Jadon Sancho is likely to increase. According to English paper, The Times, and a number of other sources, Dortmund have lined up 22-year-old Lille forward Ikone as a potential replacement. The French international made 28 appearances and scored three times in Ligue Un's truncated season.\nJuly 26\nRumor: Ozan Kabak — Schalke to Liverpool\nKabak’s first season with Schalke was far from ideal, but the 2019 Bundesliga Rookie of the Season’s stock has not dropped according to reports linking him with the Premier League winners. The 20-year-old only made 21 starts in the Bundesliga in the 2019/20 campaign.\nRumor: Matthias Ginter — Borussia Möchengladbach to Inter Milan\nInter Milan are looking to further revamp their squad to build on a strong season in the Serie A that currently has them sat just two points behind league leaders Juventus. Ginter has talked of \"staying for a few more years\", but the right fee could force Gladbach's hands.\nJuly 25\nDone deal: Keita Endo — Yokohama F. Marinos to Union Berlin\nHaving already made Maris Bülter's loan from Magedeburg permanent, Union Berlin have further bolstered their options out wide, signing Japan international Endo on a one-year loan. The 22-year-old has scored 13 goals in 79 appearances in Japan's J1 League.\nRumor: Kingsley Coman — Bayern Munich to Manchester United\nManchester United's interest in Jadon Sancho is well known but, should a deal for the Borussia Dortmund winger not materialize, the Red Devils have a Plan B: Bayern Munich winger Kingsley Coman. According to The Athletic, the 24-year-old winger has held talks with the record English champions and would be open to a transfer.\nJuly 24\nRumor: Marius Wolf — Borussia Dortmund to Hertha Berlin/Monaco\nAnother day, another rumor linking new Monaco head coach Niko Kovac with a member of his German Cup winning side from 2018. The latest is Dortmund's Marius Wolf, who is also being courted by Hertha Berlin having made 21 appearances during a season-long loan in the capital.\nJuly 23\nDone deal: Daniel Baier — Augsburg to free agent\nVeteran captain Daniel Baier has parted ways with Augsburg, with the two sides agreeing to void his contract. In nine seasons, The 36-year-old made 355 appearances for Augsburg, more than any other player in the club's history.\nJuly 22\nRumor: Filip Kostic — Eintracht Frankfurt to Monaco\nCould the Serbian winger reunite with his former coach. According to Sport Bild, newly appointed Monaco coach Niko Kovac is keen on recruiting Kostic and Real Madrid forward Luka Jovic, whom he coached during his two-and-a-half-year stint at Eintracht Frankfurt. Kostic, who has spent two seasons in Germany's financial capital, is under contract with the Eagles until June 2023.\nDone deal: Mike Frantz — Freiburg to Hannover\nAfter six years in Freiburg, veteran midfielder Mike Frantz has completed a move to second-division side Hannover. The 33-year-old midfielder has signed a two-year contract with Hannover until June 2022.\nJuly 21\nDone deal: Hannes Wolf — RB Leipzig to Gladbach\nThe 21-year-old Austrian midfielder Hannes Wolf has joined Gladbach on a one-year loan. Wolf previously played under current Gladbach coach Marco Rose at RB Salzburg. The deal includes an option to buy.\nRumor: Benicio Baker-Boaitey — West Ham to Bayern Munich\nAnother highly touted young English player is set to leave England for Germany. West Ham's 16-year-old winger Benicio Baker-Boaitey is reportedly in talks with Bayern Munich after snubbing the Premier League club's professional contract offer. Baker-Boaitey, who turns 17 in January, would reportedly cost approximately €254,000 ($290,000) in compensation.\nDone deal: Leo Balerdi — Dortmund to Marseille\nArgentinean central defender Leonardo Balerdi has completed a loan move to Ligue 1 side Marseille from Borussia Dortmund. Despite playing towards the end of last season, it seems as though Dortmund don't think he is ready to play regularly for the first team just yet.\nJuly 20\nRumor: Robin Gosens — Atalanta to Hertha Berlin\nAccording to reports, Hertha Berlin are in the mix to sign Gosens, but face stiff competition from the likes of Juventus and Inter Milan. The 26-year-old has received permission to talk to interested parties from Atalanta, who face Paris-Saint Germain in the Champions League quarter finals next month.\nDone deal: Jude Bellingham — Birmingham City to Borussia Dortmund\nBorussia Dortmund have announced the signing of England youth international Jude Bellingham on a long-term deal.\nClick here for more on the story.\nDone deal? Jean-Kevin Augustin — RB Leipzig to Leeds United\nLeipzig expect Leeds to honor a clause in Augustin’s loan deal that would makes his move permanent under condition of promotion, which the Yorkshire club secured on the weekend. The French striker has returned to Germany after the loan deal ended on June 30.\n\"I expect things will now take due course,\" Leipzig sporting director Markus Krösche told kicker. \"We were all in full possession of our mental powers when we negotiated the contract.\" Leipzig are ready to take legal action should Leeds refuse to pay the agreed upon €21 million fee.\nJuly 19\nRumor: Mario Götze — Free Agent to Fiorentina\nA free agent after his contract with Borussia Dortmund was not extended, World Cup winner Mario Götze, is expected to decide his future this week. Reports strongly suggest, the 27-year-old could be set to reunite with former Bayern Munich teammate Franck Ribery at Serie A side Fiorentina.\nDone deal: Niko Kovac to AS Monaco\nLigue 1 side Monaco have confirmed Niko Kovac as their new head coach. The 48-year-old has signed the dotted line on a three-year contract with the eight-time French champions, who finished ninth in the shortened 2019/20 campaign.\nJuly 18\nRumor: Niko Kovac to AS Monaco\nAccording to reports in France, former Bayern Munich and Eintracht Frankfurt coach Niko Kovac is poised to take over at Ligue 1 side Monaco.\nThe Berlin-born Croatian has been out of work since being sacked by Bayern in November, despite winning a league and cup double with the Bavarians in 2019. He had reportedly been on Hertha Berlin's radar too but now looks set to begin a new chapter in the French principality.\nJuly 17\nRetired: Andre Schürrle\nGerman World Cup winner André Schürrle has announced his retirement from football at the age of just 29. The attacking midfielder made 207 Bundesliga appearances during spells with Mainz, Bayer Leverkusen, Wolfsburg and Borussia Dortmund, winning two German Cups, although he also won the English Premier League with Chelsea.\nHowever, he is mostly remembered for his cross which set up Mario Götze's winning goal for Germany in the 2014 World Cup final against Argentina in Brazil, a moment which ultimately turned out to be the zenith of a difficult career which petered out with loan spells at Fulham and Spartak Moscow.\nSpeaking to German magazine Der Spiegel about his decision, Schürrle revealed how football made him \"rich but lonely\" as \"the low points got ever lower and the high points ever fewer.\"\nJuly 16\nRumor: Jude Bellingham — Birmingham City to Borussia Dortmund\nOne of the worst kept transfer secrets of 2020 looks set to be officially revealed, with young English prospect Jude Bellingham, 17, reportedly in Dortmund in order to sign a deal with the Bundesliga outfit. Bellingham, a central midfielder, just needs to add his signature to complete the €23 million deal, according to numerous outlets in England and Germany. The move has echoes of Dortmund's signing of Jadon Sancho, from Manchester City in 2017, though Bellingham has already racked up more than 40 senior appearances.\nJuly 15\nDone deal: Noel Niemann — 1860 Munich to Arminia Bielefeld\nNewly promoted Arminia Bielefeld have signed forward Noel Niemann from 1860 Munich on a free transfer. The 20-year-old made 13 appearances for the third-division side last season, scoring two goals and contributing two assists.\nJuly 14\nRumor: David Alaba — Bayern Munich to Manchester City\nAfter having their Champions League ban overturned, Manchester City are back in the transfer market – and Pep Guardiola is on the hunt for defensive reinforcements. According to The Guardian, Bayern Munich’s David Alaba is his number one choice. The Austrian international only has one year left on his contract with the German champions, and coach Hansi Flick has insisted he wants him to stay.\nJuly 13\nRumor: Milot Rashica — Werder Bremen to RB Leipzig\nRB Leipzig have had an initial bid for Werder Bremen forward Milot Rashica turned down, according to BILD. The Red Bull side reportedly offered €15 million rising to €18 million with add-ons but the Northerners are holding out for €25 million for the 24-year-old Kosovan international who has scored 24 goals in 74 appearances for Bremen.\nJuly 12\nRumor: Weston McKennie — Schalke to the Premier League\nAccording to Sky Sports in Germany, Schalke and US international midfielder Weston McKennie wants to leave the club and move to the Premier League. Schalke would apparently not stand in his way, but would expect a fee of somewhere between €20 and €30 million for the midfielder.\nRumor: Kai Havertz — Leverkusen to Chelsea\nWhile Kai Havertz is keen to leave Leverkusen this summer, his destination is less obvious. Chelsea might be the team currently in the headlines but after their loss to Sheffield United the race for the top four is back on in the Premier League. It's clear whoever wants Kai Havertz has to be in the Champions League next season.\nJuly 11\nRumor: Milot Rashica — Werder Bremen to RB Leipzig\nWerder Bremen's sporting director Frank Baumann has said that Rashica is in talks with a club but that others are also interested. \"We have to assume he won't be playing for us next season.\" Rashica reportedly has a release clause of €35 million.\nJuly 10\nDone deal: Salomon Kalou — Hertha Berlin to Botafogo\nSalomon Kalou is departing the German capital after six seasons. The 34-year-old forward, who made just seven appearances for Hertha last season, has signed an 18-month contract with Brazilian side Botafogo. Kalou scored 54 goals and registered 13 assists in 173 games for Hertha.\nDone deal: Nathan de Medina — Mouscron to Arminia Bielefeld\nNewly promoted Bielefeld have completed their third signing in less that two weeks as they prepare for their Bundesliga return. They have announced that Nathan de Medina, a 22-year-old Belgian defender, has signed with the club from Belgian side Royal Excel Mouscron.\nJuly 9\nRumor: Hannes Wolf — RB Leipzig to Borussia Mönchengladbach\nCould Marco Rose reunite with one of his former young talents? According to Kicker, the Foals are in talks with RB Leipzig over a potential one-year loan of 21-year-old Hannes Wolf. The Austrian midfielder, who moved from RB Salzburg to Leipzig one year ago, made just five appearances for the Red Bulls this past season.\nDone deal: Niko Giesselmann — Union Berlin to Fortuna Düsseldorf\nNiko Giesselmann has received another chance in the Bundesliga after being relegated with Fortuna Düsseldorf. The 28-year-old defender has signed a contract with Union Berlin that is valid for both the top-flight and the second division.\nDone deal: Christian Gebauer — Altach to Arminia Bielefeld\nNewly promoted Arminia Bielefeld have already made their second signing of the transfer season. They have announced that 26-year-old Austrian midfielder Christian Gebauer has moved to the club from Austrian side Altach on a free transfer and has signed a three-year contract until 2023.\nJuly 8\nDone deal: Benjamin Henrichs — Monaco to RB Leipzig\nBenjamin Henrichs is returning to the Bundesliga after two seasons in Monaco. The German defender will spend next season with RB Leipzig on loan from Monaco, with Leipzig possessing a buy option in the agreement. Henrichs, who was part of the Germany team that won the Confederations Cup in 2017, made only 13 appearances for Monaco last season while dealing with back trouble.\nDone deal: Hwang Hee-chan — RB Salzburg to RB Leipzig\nAnother expected deal is official. Hwang Hee-chan has joined RB Leipzig from RB Salzburg. Hwang has signed a five-year deal for around nine million euros, potentially rising to €14 million depending on bonuses.\nThe South Korean attacker will wear Timo Werner's former number 11 shirt. Hwang also becomes the 18th player to have made the move from RB Salzburg to RB Leipzig.\nJuly 7\nDone deal: Sebastian Rudy, Mark Uth — Hoffenheim/Cologne to Schalke\nSchalke's sport's chairman Jochen Schneider confirmed to Sport1 that Schalke have both Sebastian Rudy and Mark Uth in their plans for the new season. The pair have returned from loan spells at Hoffenheim and Cologne respectively.\nDone deal: Sebastian Griesbeck — Heidenheim to Union Berlin\nThe veteran midfielder has signed on with Union Berlin after helping Heidenheim attain third place in the second division, their highest ever finish in club history.\nJuly 6\nRumor: Thiago Alcantara — Bayern Munich to Liverpool\nLiverpool are emerging as strong favorites to sign Bayern Munich midfielder Thiago Alcantara, who seems set to leave the German champions this year. The Premier League side are reported to have tabled a bid of €30 millio with some outlets already reporting that the Spaniard has agreed personal terms with the English champions. When Liverpool coach Jürgen Klopp was asked about the speculation, he replied: \"Would you be surprise if I don't give an answer on that? Thiago is a good player, I like a lot of other players out there, but that's all I have to say.\"\nRumor: Benjamin Henrichs — Monaco to RB Leipzig\nGerman defender Benjamin Henrichs is edging closer to a loan move to Julian Nagelsmann's RB Leipzig. The 23-year-old departed Bayer Leverkusen for Monaco last year, but Leipzig are keen to bring him home.\nJuly 5\nRumor: Kai Havertz — Bayer Leverkusen to Chelsea\nA transfer saga is brewing. Following Bayern Chairperson Karl-Heinz Rummenigge's comments (see July 4), the English press stoked the fires of the rumors linking Havertz’s to Chelsea. However, former Leverkusen head coach Rainer Calmund thinks differently: \"From those around him, it’s clear that Spain is his dream destination.\"\nRead more: What next for Kai Havertz?\nRumor: Waldemar Anton — Hannover 96 to Stuttgart\nWaldemar Anton wants to join Stuttgart and Stuttgart want to sign the former Germany Under-21. The clubs have reportedly already reached an agreement on a deal worth €5 million plus bonuses, but Hannover president Martin Kind is yet to give the green light.\nJuly 4\nRumor: Kai Havertz — Bayer Leverkusen to Bayern Munich\nTalking to Sport1, Bayern Chairperson Karl-Heinz Rummenigge outlined that a “Havertz transfer will not be financially possible for us this year.” The 64-year-old went on to say that his \"wish for Rudi Völler [Bayer 04's sporting director] is that he stays one more year in Leverkusen.\"\nRumor: Thiago — Bayern Munich to Liverpool\nThiago reportedly has one foot out of Bayern's door with Rummenigge admitting that \"it looks like he [Thiago] wants to do something new\". Premier League champions Liverpool are reportedly the front-runners for the 29-year-old, who has made 231 appearances for Bayern since joining from Barcelona in 2013.\nRumor: Angelino — Manchester City to Leipzig\nHaving already extended Angelino's loan deal by two months; RB Leipzig are intent on securing the Spaniard’s services beyond the end of the season. With a permanent signing off the table, reports in Germany suggest the clubs are in \"advanced talks\".\nJuly 3\nDone deal: Leroy Sane — Manchester City to Bayern Munich\nAfter a year-long transfer saga, Leroy Sane has finally completed his move from Manchester City to Bayern Munich. The German international has signed a five-year contract until 2025, with reports suggesting his transfer will cost the Bavarians approximately €50 million.\nRumor: Jude Bellingham — Birmingham City to Borussia Dortmund\nDortmund appear on the verge of signing another English teenager. According to Bild, the club has reached a five-year agreement with Bellingham, with Birmingham City receiving a €23 million transfer fee. the 17-year-old played 38 games for Birmingham last season, 35 of which came in the English second-tier Championship.\nDone deal: Christian Gentner — Union Berlin\nUnion Berlin have announced that veteran midfielder Christian Gentner has signed a contract extension with the club, but have not outlined how long the new deal will last. \"The challenge of keeping Union in the Bundesliga is of enormous motivation for me,\" said the former Stuttgart man.\nJuly 2\nDone deal: Achraf Hakimi — Real Madrid to Inter Milan\nReal Madrid has confirmed that defender Achraf Hakimi, who has spent the previous two seasons on loan with Dortmund, is headed to Italy. Media reports suggest the 21-year-old defender has completed a move to Inter Milan for a fee of €40 million.\nJuly 1\nDone deal: Tanguy Nianzou Kouassi — PSG to Bayern Munich\nA day after completing their first transfer of the offseason, Bayern Munich have announced a second. They completed the free transfer of French defender Tanguy Nianzou Kouassi from Paris Saint-Germain, with the 18-year-old inking a four-year contract until 2024. He is the fourth French international Bayern have recruited over the past two seasons.\nJune 30\nDone deal: Alexander Nübel — Schalke to Bayern Munich\nAfter announcing the transfer back in Janaury, the final formalities of Alexander Nübel's deal to join Bayern Munich from Schalke have been completed. The 23-year-old keeper, who kept 15 clean sheets in 53 appearances for the Royal Blues, has set himself the target of \"constantly developing” in Bavaria.\nDone deal: Jacob Barrett Laursen — Odense to Arminia Bielefeld\nTwo days after lifting the Bundesliga 2 title, newly promoted Arminia Bielefeld completed their first signing of the new season. They announced that Jacob Barrett Laursen, a 25-year-old Danish defender, has moved to Bielefeld from Odense on a free transfer, inking a three-year contract until 2023.\nJune 29\nDone deal: Jeremy Toljan — Dortmund to Sassuolo\nBorussia Dortmund have announced that right-back Jeremy Toljan will extend his loan at Serie A side Sassuolo by a further year. According to reports, there's a clause that will see the deal made permanent should Toljan make a certain amount of appearances.\nDone deal: Rafal Gikiewicz, Daniel Caligiuri, Tobias Strobl — to Augsburg\nAugsburg have moved swiftly to complete a trio of free transfer coups. Union Berlin's Rafal Gikiewicz should solve the goalkeeping problem, while Daniel Caligiuri and Tobias Strobl, who have joined from Schalke and Borussia Mönchengladbach respectively, bring the experience of a combined 450 Bundesliga appearances with them.\nRumor: Hwang Hee-chan — Red Bull Salzburg to RB Leipzig\nAccording to reports from South Korean broadcaster KBS, forward Hwang Hee-chan is on the verge of becoming the latest Red Bull Salzburg player to make the switch to RB Leipzig. The clubs have reportedly already agreed on a transfer.", "article_url": "https://www.dw.com/en/bundesliga-transfer-blog-goalkeeper-change-in-berlin/a-54000354?maca=en-rss-en-sports-1027-xml-atom", "article_date_publish": null, "article_date_modify": null, "article_date_download": "2020-08-04 09:14:49+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>No leakage found</question_title>\n<background>No leakage found</background>\n<resolution_criteria>\n<ul>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>Which goalkeeper will replace Rafal Gikiewicz at Union Berlin by the end of the 2020 summer transfer window?</question_title>\n<background>Union Berlin's first-choice goalkeeper Rafal Gikiewicz left the club to join Augsburg during the 2020 summer transfer window. Union Berlin needed to sign a new starting goalkeeper to fill this position.</background>\n<resolution_criteria>\n<ul>\n    <li>\n      <b>Source of Truth</b>: The question will resolve based on Union Berlin's official announcement of their new starting goalkeeper signing during the 2020 summer transfer window (by October 5, 2020).  \n    </li>\n    <li>\n      <b>Resolution Date</b>: The resolution occurs on the calendar date when Union Berlin's new goalkeeper is formally announced as their starter (by October 5, 2020). \n    </li>\n    <li>\n      <b>Accepted Answer Format</b>: The full name of the goalkeeper exactly as given in Union Berlin's official announcement.\n    </li>\n</ul>\n</resolution_criteria>\n<answer>Andreas Luthe</answer>\n<answer_type>string (name)</answer_type>\n</q1>"}
{"article_title": "′Clan crime′: The who′s who of Germany′s most notorious crime families", "article_description": "Organized crime among Arab, Kurdish and Turkish communities has become a media obsession in Germany. Here's a lowdown of who is who.", "article_maintext": "Organized crime among Arab, Kurdish and Turkish communities has come to play a central role in German movies and TV series. Part of that interest has been sparked by a number of high-profile heists.\nOn Tuesday, one of them made the headlines again when a fifth suspect was arrested in Berlin for the spectacular robbery last year of Dresden's Grünes Gewölbe (\"Green Vault\") museum when invaluable historical jewelry was taken.\nIn contrast to notorious motorbike gangs or mafia groups, the groups referred to in German media and by police as \"clans\" define themselves by their family ties and a shared ethnic identity. But critics say the term \"clan crime\" puts family members under general suspicion, discriminating against those who are not criminals. \"Clan crime\" makes up less than 10% of organized crime investigations.\nThe Remmos\nThe Remmo family first came to police attention in 1992 with the murder of a restaurant owner in Berlin. Since then, some of the estimated 500 family members have turned the Remmo clan into one of Berlin's most notorious gangs with a long record of violence, drug trafficking, money laundering and fraud.\nThe theft of a hundred-kilo gold coin from the Berlin Bode Museum in 2017 is considered to be the Remmo clan's most spectacular coup. Police believe the gold, worth more than €3 million ($3.6 million), is believed to have been cut to pieces and melted. Gold particles, as well as glass fragments from the museum, have been found in apartments, vehicles, and on the clothes of Remmo family members. Two young men from the Remo family and one of their associates were sentenced to several years in prison in 2020 in connection with the theft.\nProsecutors also believe that members of the Remmo clan were involved in the \"Green Vault\" robbery in Dresden in 2019.\nThe Remmos belong to the Mhallami ethnic group, primarily native to southern Turkey and Lebanon. The Remmo family had fled war-torn Lebanon and came to Europe in the 1980s. The Mhallami mostly identify as Arab and are sometimes associated with Kurdish minorities.\nThe Abou-Chakers\nAlthough smaller than the Remmo clan, the Abou-Chaker family and its head Arafat Abou-Chaker have attracted attention from both media and authorities in Germany for a long time.\nBerlin-based Arafat Abou-Chaker took over management for Bushido, Germany's biggest gangsta rapper, in 2008. The business relationship sparked a stir (and a hit movie), before turning sour 10 years later.\nBushido then got embroiled in a court case against Arafat Abou-Chaker, accusing him of coercion, threats, and harassment. Over the years, Abou-Chaker family members have been indicted for several crimes such as intimidation, robbery, and bodily injury. A Berlin court also dealt with several Abou-Chaker members over forged documents to sell an apartment block that did not belong to them.\nThe Abou-Chaker family is of Palestinian origin and fled from a Lebanese refugee camp to Europe when civil war raged in Lebanon. Just like other suspected crime families, the Abou-Chakers are believed to own several offices and other real estates in Germany.\nThe Miris\nThe Miri clan consists of several families of Mhallami origin. They, too, are believed to have fled to Germany at the height of the Lebanon civil war in the early 1980s. The Miri clan sometimes referred to as \"M-Clan,\" is particularly active in Lower Saxony, though criminal activities have also been recorded in Berlin, Bremen, and North Rhine-Westphalia.\nMembers of the Miri clan have been involved in crimes such as drug trafficking, extortion, and pimping prostitutes. Some prominent figures of the clan are said to have close ties to the banned motorcycle gang \"Mongols MC.\"\nThe leader Ibrahim Miri became well-known across Germany when he violated a ban on returning to Germany after having been deported to Lebanon in 2019. At the time, German Interior Minister Horst Seehofer proposed a \"Lex Miri\" that would allow for deported asylum seekers to be locked up when re-entering Germany.\nAl-Zein\nWith several thousand members, the Al-Zein clan might be one of the largest families involved in organized crimes in Germany. Its supposed boss, Mahmoud Al-Zein, published his memoirs in 2020, entitled, \"The godfather of Berlin: My way, my family, my rules.\"\nIn his memoir, Al-Zein provides an insight into the world of clan criminality. A world that seems to be dominated by archaic ideas of honor and strict hierarchies.\nMahmoud Al-Zein came from Lebanon to Germany in 1982. Since then, his own rules often collided with German laws: He has been convicted for drug trafficking and other criminal offenses.", "article_url": "https://www.dw.com/en/clan-crime-the-whos-who-of-germanys-most-notorious-crime-families/a-57570978?maca=en-rss-en-ger-1023-rdf", "article_date_publish": null, "article_date_modify": null, "article_date_download": "2021-05-18 16:03:06+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>No leakage found</question_title>\n<background>No leakage found</background>\n<resolution_criteria>\n<ul>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n    <li>Leakage found -- The example provided (\"Remmo family\" or \"Abou-Chaker family\") includes the actual answer (\"Remmo clan\"), which indirectly reveals it. \nReplacement -- The answer must match the spelling and naming convention used in the source (e.g., \"Smith family\" or \"Johnson family\"). The answer must match the spelling and naming convention used in the source.</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>Which crime family will be publicly linked to the 2019 Dresden \"Green Vault\" robbery, as confirmed by German prosecutors by December 2020?</question_title>\n<background>The \"Green Vault\" robbery in Dresden in 2019 involved the theft of invaluable historical jewelry from a museum. Several crime families in Germany are known for high-profile heists, and prosecutors investigate their involvement in such cases.</background>\n<resolution_criteria>\n<ul>\n    <li>\n      <b>Source of Truth</b>: The question will resolve based on official statements or reports from German prosecutors or law enforcement confirming the family's involvement in the robbery, as documented in reputable news sources by December 31, 2020.\n    </li>\n    <li>\n      <b>Resolution Date</b>: The resolution occurs on or before December 31, 2020, based on the latest available public confirmation.\n    </li>\n    <li>\n      <b>Accepted Answer Format</b>: The name of the crime family exactly as referenced in official reports (e.g., \"Smith family\" or \"Johnson family\"). The answer must match the spelling and naming convention used in the source.\n    </li>\n</ul>\n</resolution_criteria>\n<answer>Remmo clan</answer>\n<answer_type>string (name)</answer_type>\n</q1>"}
{"article_title": "WATCH LIVE - German President Steinmeier on track for another term as special assembly votes", "article_description": "Germany's parliamentarians and delegates from across the country are picking the next head of state. Current President Frank-Walter Steinmeier is backed by all mainstream parties and is seen as almost certain to win.", "article_maintext": "Almost 1,500 delegates gathered in Berlin on Sunday to choose Germany's president — a largely ceremonial position — for the next five years.\nThe so-called Bundesversammlung (Federal Convention) consists of the members of Germany's Bundestag, or lower house of parliament, along with an equal number of delegates chosen by the country's 16 states, or Länder.\nAmong the latter delegates are some well-known personalities, including former Chancellor Angela Merkel, the national football coach, Hansi Flick, leading virologist Christian Drosten and the pianist Igor Levit.\nÖzlem Türeci, who as co-founder of the pharmaceutical company BioNTech was one of the driving forces behind the rapid development of the Comirnaty COVID-19 vaccine, is also among those selected to vote.\nWho are the candidates?\nCurrent President Frank-Walter Steinmeier, 66, a Social Democrat who served two stints as Merkel's foreign minister and previously was chief of staff to Chancellor Gerhard Schröder, is widely seen as a clear favorite to win the election.\nA recent opinion poll indicated that 85% of people living in Germany thought he was doing a good job, and he enjoys the support both of the ruling coalition and the mainstream conservative opposition parties.\nThe three other candidates are left-winger Gerhard Trabert, 65, who is running for the opposition Left Party, physicist Stefanie Gebauer, 41, who was nominated by a political group called the Free Voters, and Max Otte, 57, an archconservative economist chosen by the far-right party Alternative for Germany (AfD).\nThe latter choice made waves in the German political scene, as Otte is not a member of the AfD and remains a part of the mainstream Christian Democrats (CDU). The leaders of CDU have vowed to cancel his membership.\nHow does voting take place?\nThis time around, the Federal Convention is not meeting in the Reichstag as usual owing to pandemic regulations requiring the voters to remain 1.5 meters (5 feet) apart. Instead, the vote is taking place in the neighboring Paul Löbe House, with delegates spread over several rooms and floors.\nThe vote is cast by secret ballot, with delegates called to the voting booths in alphabetical order.\nThe result is decided according to who wins the absolute majority of votes.\nWhat does Germany's president do?\nWhile German presidents have little executive power, they aspire to be moral authorities above daily politics.\nAnyone holding the office signs bills into law and represents Germany in various ceremonies both inside and outside the country.\nDuring Steinmeier's first term in office, he championed liberal democracy in Germany and abroad and urged dialogue on sensitive issues. Recently, that included plans for compulsory vaccination against the coronavirus.\ntj/dj (dpa, AP)", "article_url": "https://www.dw.com/en/watch-live-german-president-steinmeier-on-track-for-another-term-as-special-assembly-votes/a-60760871?maca=en-rss-en-all-1573-rdf", "article_date_publish": "2017-11-07 00:00:00", "article_date_modify": null, "article_date_download": "2022-02-13 13:20:02+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>No leakage found</question_title>\n<background>No leakage found</background>\n<resolution_criteria>\n<ul>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>Who will win the German presidential election in February 2022, as decided by the Bundesversammlung?</question_title>\n<background>The German president is elected by the Bundesversammlung (Federal Convention), which includes members of the Bundestag and delegates from the 16 federal states. The president serves a five-year term and holds a largely ceremonial role.</background>\n<resolution_criteria>\n<ul>\n    <li>\n      <b>Source of Truth</b>: The question will resolve based on the official announcement of the winning candidate by the Bundesversammlung, reported by reputable news sources such as dpa or AP.  \n    </li>\n    <li>\n      <b>Resolution Date</b>: The results will be confirmed on the day of the election in February 2022. \n    </li>\n    <li>\n      <b>Accepted Answer Format</b>: The full name of the elected president exactly as provided in the official announcement.\n    </li>\n</ul>\n</resolution_criteria>\n<answer>Frank-Walter Steinmeier</answer>\n<answer_type>String (Name)</answer_type>\n</q1>"}
{"article_title": "Hermoso accuses Spanish soccer federation of 'intimidation'", "article_description": "The Spanish international has reacted to the federation calling up players who are boycotting the women's national team, claiming the move showed \"nothing had changed.\"", "article_maintext": "Spanish footballer Jenni Hermoso accused the Spanish football federation of trying to \"intimidate and threaten\" players of the national team who recently won the World Cup.\nIn a statement published on social media on Tuesday, the 33-year-old striker reacted to the federation calling up players who are boycotting the women's team.\nThe boycott comes after Spain's former soccer federation president Luis Rubiales held Hermoso's head with both hands and kissed her on the lips during the medal ceremony that followed Spain's win over England in the final of the Women's World Cup in Australia on August 20.\nWhy did Hermoso put out a statement?\nOn Friday, 39 players, including 21 members of the squad that won the World Cup last month, said they would not return to the national team as they did not yet \"feel in a safe space,\" demanding further changes within the federation.\nBut Spain's new head coach Montse Tome called up many of them on Monday. Players reaffirmed their boycott the same day.\nHermoso, who was not called up, said the federation was trying to put pressure on the players. \"The players are certain that this is yet another strategy of division and manipulation to intimidate and threaten us with legal repercussions and economic sanctions,\" she wrote.\nPlayers could face legal consequences\nUnder Spain's Sport Act, players can be fined or even have their federation licences suspended for refusing a call-up.\nThe players said they would also look into the legal implications of being added to a squad list despite their announced boycott.\nSpain's women's team is set to play against Sweden and Switzerland in the UEFA Nations League next week.\nfg/jsi (AFP, Reuters)", "article_url": "https://www.dw.com/en/hermoso-accuses-spanish-soccer-federation-of-intimidation/a-66850223", "article_date_publish": "2023-09-19 04:22:31", "article_date_modify": null, "article_date_download": "2023-09-19 04:28:12+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>No leakage found</question_title>\n<background>No leakage found</background>\n<resolution_criteria>\n<ul>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>Which two teams will Spain's women's national soccer team play in the UEFA Nations League in September 2023?</question_title>\n<background>The UEFA Nations League is a biennial international football competition contested by the senior men's and women's national teams of the member associations of UEFA. Spain's women's team is scheduled to play matches in September 2023 as part of this tournament.</background>\n<resolution_criteria>\n<ul>\n    <li>\n      <b>Source of Truth</b>: The question will resolve based on the official match schedule published by UEFA or the Royal Spanish Football Federation (RFEF) for the September 2023 UEFA Women's Nations League fixtures.\n    </li>\n    <li>\n      <b>Resolution Date</b>: The resolution occurs on the calendar date when the September 2023 UEFA Women's Nations League matches are completed (by September 30, 2023). \n    </li>\n    <li>\n      <b>Accepted Answer Format</b>: The names of the two national teams Spain is scheduled to play, listed in the order they appear in the official schedule or as mentioned in the article. Team names should be written in full (e.g., \"Sweden\" not \"SWE\").\n    </li>\n</ul>\n</resolution_criteria>\n<answer>Sweden and Switzerland</answer>\n<answer_type>string (team names)</answer_type>\n</q1>"}
{"article_title": "US election: Harris, Trump vow to win as campaigns wrap up", "article_description": "Rivals Kamala Harris and Donald Trump visited the most important battleground state on the last day of campaigning before Tuesday's vote. Follow DW's election digest.", "article_maintext": "US election: Harris, Trump vow to win as campaigns wrap up\nPublished 11/04/2024Published November 4, 2024\nRivals Kamala Harris and Donald Trump visited the most important battleground state on the last day of campaigning before Tuesday's vote. Follow DW's election digest.\nhttps://p.dw.com/p/4mYcw\nAdvertisement\nSkip next section What you need to know\nWhat you need to know\nBoth Democratic Vice President Kamala Harris and former Republican President Donald Trump were campaigning in the key swing state of Pennsylvania on the final day before the election on November 5.\nWith 19 electoral votes, Pennsylvania is the biggest prize among the seven key swing state states that could flip one way or the other. Either Trump or Harris will need at least 270 electoral votes to become the next US president.\nVice President Kamala Harris said she was \"feeling good\" as she boarded a plane from Michigan to Pennsylvania to attend a flurry of rallies peppered with celebrity appearances.\nMeanwhile, former President Donald Trump threatened to impose tariffs on Mexico as he addressed a cheering crowd in North Carolina's capital, Raleigh. He also labeled his opponent \"incompetent.\"\nHere's a roundup of the latest developments in the race to the White House on November 4, 2024:\nSkip next section Kamala Harris confident of victory in last rally at Philadelphia\n11/05/2024November 5, 2024\nKamala Harris confident of victory in last rally at Philadelphia\nUS Democratic presidential candidate Harris spent the last day of campaigning in Philadelphia, where she expressed confidence she would win.\n\"The momentum is on our side. We will win,\" Harris told the crowd.\n\"Just one more day in the most consequential election of our lifetimes and the momentum is one our side,\" she added. \"This could be one of the closest races in history — every single vote matters.\"\nHarris, 60, spoke at the famous steps at the Philadelphia Museum of Art, where the movie \"Rocky\" was shot. She called herself the underdog like Rocky and said she was ready to \"climb to victory.\"\nThe event consisted of A-list celebrities such as Lady Gaga, Oprah Winfrey and Jon Bon Jovi. Gaga sang \"God Bless America,\" and Winfrey came to the stage with some first-time voters.\nAlso on the last day of campaigning, Harris' rally in Pittsburgh, Pennsylvania, saw celebrities like Cedric the Entertainer, Katy Perry and Andra Day.\nhttps://p.dw.com/p/4mbmY\nSkip next section Trump calls for death penalty to migrants who kill US citizens, police\n11/05/2024November 5, 2024\nTrump calls for death penalty to migrants who kill US citizens, police\nOn the last day of the presidential election campaign, Trump called for the death penalty for migrants who kill US citizens or law enforcement officers.\n\"I am hereby calling for the death penalty for any migrant that kills an American citizen or a law enforcement officer,\" he told a crowd in Pittsburgh, Pennsylvania, which is a battleground state.\nTrump, 78, has consistently held an anti-immigrant rhetoric during his campaign.\nHe also said college athletes should fight migrants while complaining about migrants arriving at the southern border of the United States.\n\"Oh, those Penn State guys. I wanted them to wrestle the migrants,\" he said.\nHe also said he wanted the Ultimate Fighting Championship (UFC) to start a migrant league and a UFC league so they could fight.\n\"I think the migrant (league) might actually win. That's how nasty some of these guys are.\"\nhttps://p.dw.com/p/4mbkt\nSkip next section US cybersecurity head says disinformation rampant, but results not compromised\n11/05/2024November 5, 2024\nUS cybersecurity head says disinformation rampant, but results not compromised\nThe US cybersecurity agency CISA, alongside the Office of the Director of National Intelligence (ODNI) and the Federal Bureau of Investigation (FBI), issued a joint warning on election interference on Monday.\nThe three agencies said they had \"been observing foreign adversaries, particularly Russia, conducting additional influence operations intended to undermine public confidence in the integrity of US elections and stoke divisions among Americans.\"\n\"Russia is the most active threat,\" the statement said.\n\"These efforts risk inciting violence, including against election officials,\" the agencies said. \"We anticipate Russian actors will release additional manufactured content with these themes through election day and in the days and weeks after polls close.\"\nThe agencies said that Russian-influenced operators had posted false articles and videos claiming electoral fraud in favor of Vice President Kamala Harris.\nThe statement also said that Iran had launched \"malicious cyber activities\" to negatively impact the Republican presidential candidate Donald Trump's campaign.\nCISA chief Jen Easterly said her department had seen no activity that could directly affect the US election result, but reported a rise in disinformation thought to be orchestrated from abroad, according to reporting from Reuters.\nShe added that the 2024 US presidential election had been confronted with an \"unprecedented\" amount of disinformation from certain \"adversaries.\"\nEasterly said the \"election infrastructure has never been more secure and that the election community has never been better prepared to deliver safe, secure, free and fair elections.\"\nEasterly recently told NBC News that Russia, Iran and China were conducting influence operations to undermine American confidence in election legitimacy and \"to stoke partisan discord.\"\nhttps://p.dw.com/p/4mbHQ\nSkip next section What are the swing states?\n11/05/2024November 5, 2024\nWhat are the swing states?\nThe US is made up of 50 states, but when it comes to presidential elections some states matter more than others.\nWhile many \"safe states\" usually vote reliably one way or the other, \"swing states\" could be won by either the Democratic or Republican candidate. This toss-up potential makes them attractive to candidates since these votes could push the election either way.\nIn this race, the states to look out for are: Arizona, Georgia, Michigan, Nevada, North Carolina, Pennsylvania and Wisconsin.\nRead DW's analysis on which issues matter the most in each of the battleground states.\nhttps://p.dw.com/p/4mZcr\nSkip next section DW speaks to voters in Washington DC on final day of campaigning\n11/05/2024November 5, 2024\nDW speaks to voters in Washington DC on final day of campaigning\nDW's special correspondent Aya Ibrahim has spoken with voters in the US capital ahead of Tuesday's vote.\nUS: Final day before presidential election\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\nhttps://p.dw.com/p/4mbLV\nSkip next section 'False or misleading' claims by Musk on election reach 2 billion views on X — non-profit\n11/05/2024November 5, 2024\n'False or misleading' claims by Musk on election reach 2 billion views on X — non-profit\nFalse or misleading claims on the US election made by billionaire Elon Musk have achieved 2 billion views on the social media platform X this year, according to a report by the Center for Countering Digital Hate non-profit group.\nMusk owns the platform X and is a supporter of Republican presidential candidate Donald Trump.\nThe center said that at least 87 of Musk's posts this year have promoted claims about the US election that fact-checkers have rated as false or misleading.\nOne of the false claims, according to the report, made by Musk was that there had been a \"triple digit\" rise over the past four years of undocumented immigrants in swing states.\nIt said that Musk's political posts have received 17.1 billion views since he endorsed Donald Trump in July. The non-profit group said that this was twice as many views as all the political campaigning ads that X has recorded in its political ads disclosure dataset for the same time period.\nThe center estimated that \"it would cost a political campaign $24 million [€22 million] to run ads reaching as many views as Musk's posts did.\"\nhttps://p.dw.com/p/4mbRb\nSkip next section Harris pledges to be 'president for all' in final pitch to voters\n11/05/2024November 5, 2024\nHarris pledges to be 'president for all' in final pitch to voters\nSpeaking in swing state Pennsylvania during the final hours of her campaign, Kamala Harris promised she would govern for all if elected.\n\"I will be a president for all Americans,\" she said to the crowd in Allentown. \"Momentum is on our side. Can you feel it?\"\n\"The race is not over,\" she said, acknowledging the tight race for the White House. \"Make no mistake, we will win,\" she added.\nTurning her comments to Donald Trump, Harris said the last decade of US politics had been driven by hate and division due to the space occupied by her opponent.\n\"I believe access to health care should be a right and not a privilege for those who can afford it,\" she said. \"I am not looking to score political points, I am looking to make progress.\"\n\"I then ask you — are you ready to make your voices heard? Do we believe in freedom? Do we believe in opportunity? Do we believe in the promise of America? And are we ready to fight for it? And when we fight, we win.\"\nhttps://p.dw.com/p/4mbLn\nSkip next section Musk's $1 million voter giveaway allowed to continue, judge rules\n11/04/2024November 4, 2024\nMusk's $1 million voter giveaway allowed to continue, judge rules\nA Pennsylvania judge has decided to allow billionaire Elon Musk'sto continue giving away $1 million (€900,000) every day to registered swing state voters with just one day to go before the US presidential election.\nTesla CEO Musk, who has thrown his full support behind Donald Trump, has already given away $16 million to registered swing state voters who qualified for the giveaway by signing his political petition supporting free speech and gun rights and said the final winner will be announced on Election Day on Tuesday.\nAt a hearing in Philadelphia on Monday, Judge Angelo Foglietta rejected Philadelphia District Attorney Larry Krasner’s bid to block the giveaways.\nKrasner alleged the payouts amounted to an illegal lottery with hazily defined rules. Monday's decision came even after Musk's aides admitted to hand-picking winners based on who they thought would be good spokespeople, rather than the random selection that Musk had asserted.\nMusk's offer is limited to registered voters in the seven states expected to decide the election: Arizona, Georgia, Michigan, Nevada, North Carolina, Pennsylvania and Wisconsin.\nThe giveaway falls in a gray area of election law, and legal experts have been divided on whether Musk could be violating federal laws against paying people to register to vote.\nThe US Department of Justice has warned America PAC the giveaway could violate federal law, according to media reports, but federal prosecutors have not taken any public action.\nUS election spending poised to shatter records\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\nhttps://p.dw.com/p/4mbLa\nSkip next section How swing states will decide the election?\n11/04/2024November 4, 2024\nHow swing states will decide the election?\nPollsters say battleground states are too close to call. With a total of 50 electoral votes, these states are likely to determine who wins the election:\nhttps://p.dw.com/p/4maou\nSkip next section Trump arrives late in Reading, Pennsylvania\n11/04/2024November 4, 2024\nTrump arrives late in Reading, Pennsylvania\nTrump reached his rally in Reading on Monday evening later than scheduled, entering to the Lee Greenwood song \"God Bless the USA\" as usual.\nFemale members of the crowd were positioned behind him to be visible on the television footage, waving pink \"Women for Trump\" placards.\nHe called Pennsylvania a very special place where he had gone to school filled with incredible people.\n\"You built this country. You're going to save this country, too,\" Trump said. \"Because, you know, if we win Pennslyvania, we win the whole ball of wax. It's over.\"\nHe posed his stock opening question to the audience, of whether they felt better off now than four years ago.\n\"What a shame, what they've done to our country. They've destroyed our country, but we're going to get it back, and fast. We're a nation in decline, but that will not be long, believe me. And after four years of economic suffering, we will create the greatest economic boom the world has ever seen.\"\nTrump told the crowd \"I've been waiting four years for this, and so have you,\" urging the crowd both to vote and to encourage others to do so on Tuesday.\nhttps://p.dw.com/p/4mbJD\nSkip next section NATO chief Rutte says alliance will 'stay united' whoever wins in US\n11/04/2024November 4, 2024\nNATO chief Rutte says alliance will 'stay united' whoever wins in US\nNATO will remain solid whoever wins the US election, Secretary General Mark Rutte said in Berlin on the eve of the vote.\n\"Whoever wins those elections, we will work with Kamala Harris, we will work with Donald Trump, and make sure that the alliance stays united,\" Rutte said alongside German Chancellor Olaf Scholz.\nFormer Dutch Prime Minister Rutte said he had \"no doubt\" that whoever emerges as winner would continue to support NATO because it is \"in the interest of the United States.\"\nTrump's comments during the campaign about the war in Ukraine have caused some unease among NATO allies, and the Republican candidate also clashed with European leaders on issues such as military spending while in office from 2017 to 2021.\nhttps://p.dw.com/p/4mbAj\nSkip next section Harris 'feeling good' on star-studded final day\n11/04/2024November 4, 2024\nHarris 'feeling good' on star-studded final day\nUS Vice President Kamala Harris said she was \"feeling good,\" giving a thumbs-up and a wave as she boarded her plane to her first event of the day in Allentown, Pennsylvania's third-largest city.\nThe Democratic candidate was traveling from Detroit after campaigning in the Great Lakes swing state of Michigan.\nLike Trump, Harris is focusing her last day's campaigning on Pennsylvania, a battleground state carrying a hefty chunk of 19 Electoral College votes.\nHarris is holding a rally in Allentown with the part-Puerto Rican, part-Cuban rapper Fat Joe before visiting a Puerto Rican restaurant in Reading with New York congressional representative Alexandria Ocasio Cortez. This follows Democrats criticizing comments regarding Puerto Rico made at recent Trump campaign rallies.\nThe vice president is also set to hold an evening Pittsburgh rally with performances by DJ D-Nice amd Katy Perry before rallying at Philadelphia's Museum of the Arts, on the steps made famous in the Sylvester Stallone boxing movie \"Rocky.\"\nThe final event is set to include remarks from celebrities Lady Gaga, DJ Jazzy Jeff, Ricky Martin and Oprah Winfrey.\nhttps://p.dw.com/p/4mb99\nSkip next section US election issues: Abortion rights\n11/04/2024November 4, 2024\nUS election issues: Abortion rights\nAlong with the economy and the rising cost of living, migration and health care, abortion rights is an issue that pulls many American voters to the ballot box.\nThe vote on November 5 marks the first presidential election since the US Supreme Court overturned the landmark Roe v. Wade ruling in 2022. Until then, the 1972 decision guaranteed every woman in the US the right to decide whether to continue or terminate a pregnancy during the first trimester.\nBut in June 2022, a conservative majority of the nine-member Supreme Court voted to repeal this law.\nSince then, each US state has devised its own abortion laws, some of which are very restrictive. In some Republican-ruled states such as Kentucky or Louisiana, abortions are completely illegal, even in cases of rape. In other states, abortions are only permitted until early in pregnancy, when many people do not yet realize they are pregnant.\nRead DW's analysis on how abortion rights matter more in this election.\nAbortion looms large as US election approaches\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\nhttps://p.dw.com/p/4mZMO\nSkip next section Millions of votes across US already cast\n11/04/2024November 4, 2024\nMillions of votes across US already cast\nMore than 77 million people have participated in early voting — either in person or by mail. That's roughly half the total number of people who voted in 2020's elections.\nSo many people have already cast ballots that some officials say polling stations in states like Georgia might be largely deserted on Election Day.\nHere's a look at how early voters felt in two of the seven key swing states — Ohio and Pennsylvania.\nMillions have already cast their vote in US\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\nhttps://p.dw.com/p/4madt\nSkip next section Trump threatens tariffs on Mexico\n11/04/2024November 4, 2024\nTrump threatens tariffs on Mexico\nDonald Trump told the audience at his rally in Raleigh, North Carolina that he would impose tariffs on products entering the United States from Mexico if the country's recently elected President Claudia Sheinbaum didn't stop migrants crossing the border.\n\"She's supposed to be a very nice woman, they say. I haven't met her. And I'm going to inform her on day one or sooner that, if they don't stop this onslaught of criminals and drugs coming into our country, I'm going to immediately impose a 25% tariff on everything they send into the United States of America,\" he said.\n\"You're the first ones I've told it to, congratulations North Carolina,\" Trump said to cheers from the crowd.\n\"It's only got a 100% chance of working because if that doesn't work I'll make it 50, and if that doesn't work I'll make it 75 for the tough guys... then I'll make it 100.\"\nThe former predicted that Mexico would then deploy soldiers to its southern border to stop migrants heading north.\nAs of 2022, Mexico was the second-most prolific importer of goods into the US, behind only China and narrowly ahead of Canada.\nThe US and its two neighbors are part of the United States-Mexico-Canada Agreement, a free trade deal that replaced its better known predecessor NAFTA in 2020, which Donald Trump signed during his first term as president. This deal allows for the tariff-free trade of many goods.\nTrump also described his election rival Kamala Harris as incompetent. \"Tomorrow you have to stand up and tell Kamala that you've had enough, you can't take any more, you just can't,\" he said.\nTrump rallies supporters in North Carolina\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\nhttps://p.dw.com/p/4maox\nShow more posts", "article_url": "https://www.dw.com/en/us-election-harris-trump-vow-to-win-as-campaigns-wrap-up/live-70678198?maca=en-rss-en-top-1022-rdf", "article_date_publish": "2024-11-04 10:22:41", "article_date_modify": null, "article_date_download": "2024-11-05 06:28:55+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>No leakage found</question_title>\n<background>Leakage found -- The background directly mentions the two main candidates, one of whom is the answer (\"Kamala Harris\"). \nReplacement -- The US presidential election is held every four years, where the candidate who secures at least 270 electoral votes wins. The two main parties in the 2024 election are the Democratic Party and the Republican Party.</background>\n<resolution_criteria>\n<ul>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n    <li>Leakage found -- The accepted answer format directly lists the names of the candidates, one of whom is the answer (\"Kamala Harris\"). \n    Replacement -- The full name of the winning candidate exactly as recognized in the official announcement (e.g., \"[Candidate Name]\").</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>Who will win the US presidential election on November 5, 2024?</question_title>\n<background>The US presidential election is held every four years, where the candidate who secures at least 270 electoral votes wins. The two main parties in the 2024 election are the Democratic Party and the Republican Party.</background>\n<resolution_criteria>\n<ul>\n    <li>\n      <b>Source of Truth</b>: The question will resolve when the official election results are certified and announced by the relevant US authorities (e.g., state election boards and the Electoral College).  \n    </li>\n    <li>\n      <b>Resolution Date</b>: The resolution occurs when the final election results are officially confirmed, typically within days or weeks after November 5, 2024.\n    </li>\n    <li>\n      <b>Accepted Answer Format</b>: The full name of the winning candidate exactly as recognized in the official announcement (e.g., \"[Candidate Name]\").\n    </li>\n</ul>\n</resolution_criteria>\n<answer>Kamala Harris</answer>\n<answer_type>string (name)</answer_type>\n</q1>"}
{"article_title": "How Germany's politics is reflected in football stands", "article_description": "German football fans have been staging protests against the far-right AfD, and many fan groups have been redoubling their efforts to fight racism. But the country's general rightward shift is reflected in the stands.", "article_maintext": "Germany's shift to the right has left its mark on the country's national game, causing all kinds of ructions.\nMany German football clubs and fan groups have held demonstrations against the far right over the past year, both in the stadiums on match days and in the streets of their cities. Several major clubs from Germany's top two leagues, including Werder Bremen, VfL Bochum, FSV Mainz 05, 1. FC Köln, and Hannover 96, have called on their supporters to oppose right-wing extremism.\nThe sustained success of the far-right Alternative for Germany (AfD) appears to have sharpened attention leading up to the federal election on February 23: At a recent home game at St. Pauli, a Hamburg-based club with a strong anti-fascist tradition, fans made their feelings known by chanting: \"The whole of Hamburg hates the AfD!\"\nThey also marked International Holocaust Remembrance Day on January 27 by holding up a banner that read: \"Those who fight against Nazis can't rely on the state.\"\nMore racism, more politics\nBut this outpouring of political sentiment is far from universal — and, for some politically engaged football fans, if anything the overall trend among fans in recent years has been to shy away from overt displays of political allegiance.\n\"I'd like them to have more courage,\" said Rico Noack, chairman of Gesellschaftsspiele (\"social games\"), an organization of football fans that helps promote an inclusive society. Too often, he said, he has seen \"fan groups negotiate among themselves, decide something is 'too political,' then they settle on the smallest possible consensus, or they don't say anything at all.\"\nThis is paradoxical, because Germany's culture wars have often focused on football, by far the country's most popular sport and a major presence in German society. The 2022 FIFA World Cup in Qatar, for instance, turned political when the German national football team declared its intention to take to the pitch with \"One Love\" armbands to protest the host country's laws on LGBTQ+ people.\nSimilarly, last year, when Germany hosted the European championships, the AfD used the opportunity to launch its own attack on what it deemed \"wokeness\" in football. Maximilian Krah, the party's leading candidate in the June European election, described the men's national team on TikTok as a \"politically correct mercenary troop.\"\n\"It is the rainbow team, the pride team,\" he said, referring to the team's defense of LGBTQ+ rights. \"We can ignore it.\"\n\"Football is more political than ever,\" Noack told DW. He sees the rightward shift in Germany's political culture reflected in football culture, though \"it's not like you see actual right-wing banners\" in the stadiums, he added.\nBut both Noack and the journalist Ronny Blaschke, who has just published a book about racism in football, have noticed that racism has become less of a taboo in the stands.\n\"Especially after the so-called refugee crisis in 2015, we have observed a shift to the right in the stadiums as we have more racist incidents on the stands against Black football players,\" Blaschke told DW's Dana Sumlaji. \"We have massive racism and social media, so whenever you have Black German national players for the youth teams or for the national team, you can look in the comment sections of social media and find many racist comments.\"\nOther demonstrators 'could learn a lot from organized football fans'\nGerman football fan culture is complex. Some clubs, like St. Pauli, have long had an overtly left-wing identity. Others, like Alemannia Aachen, are thought to have associations with the far-right scene — though the club itself has denied this.\nMany other clubs, meanwhile, harbor both left and right-wing fan groups. Noack has also noticed that, with some fan groups, whatever political identity they have becomes less important on match day, when club allegiance takes precedence.\nNoack is also skeptical that political football fan cultures can have a general effect on society. But he does think that football fans have a special power: When they do organize protests, they have a confrontational, rebellious spirit — combined with unity and a sense of humor — that regular anti-AfD demonstrations sometimes lack.\n\"You could learn a lot from organized football fans: Football fans are often very creative, they are good at knowing what to do to create effective images in the media,\" he said. \"The classic example is the use of pyrotechnics and smoke bombs — they are always the pictures that get printed. Certainly, other demonstrators could learn something from that.\"\n'It feels like the last stand fighting for democracy in Germany'\nSusanne Franke is board member of the Schalker Fan Initiative — an anti-racist organization of Schalke fans founded in 1992, when violent right-wing hooligans were a regular sight in football stadiums.\nSchalke is based in the town of Gelsenkirchen, in what was formerly Germany's industrial heartland in the Ruhr Valley. Though it was once a stronghold for the center-left Social Democrats, industrial decline in Gelsenkirchen has turned the town into one of the poorest cities in Germany, and the far-right AfD has gained ground. The club's neighbor and biggest rival, Borussia Dortmund, also has a much-feared neo-Nazi contingent in its fan base dating back to the 1970s.\nFranke is concerned that football culture is reverting back to those days. \"It had got better, and now it is getting worse again. In many places fans are wrestling for control of the narrative,\" she told DW.\nFor Franke, the decision by Christian Democrat leader Friedrich Merz to pass a non-binding resolution through the German parliament with the help of the AfD has made her group's work all the more urgent. \"To me, it feels like the last stand fighting for democracy in Germany,\" she said. \"Whether you're a football fan or not, it is very important that you take this moment very seriously.\"\nThough there is no obvious evidence that football fans are any more or less politically engaged than anyone else, football's presence in German society often makes them more visible when they do express political views.\n\"Football has a huge chance, and a huge reach,\" said Franke. \"It is widely visible — in the news, in social media and in German society. This is why I honestly do hope that people will take an honest stand and say something.\"\nEdited by: Rina Goldenberg", "article_url": "https://www.dw.com/en/how-germanys-politics-is-reflected-in-football-stands/a-71614152?maca=en-rss-en-ger-1023-rdf", "article_date_publish": "2025-02-15 08:07:18", "article_date_modify": null, "article_date_download": "2025-02-15 14:51:50+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>Leakage found -- The title mentions \"far-right political movements,\" which indirectly hints at the answer (AfD). Replacement -- Which political party will German football fans protest against during the federal election on February 23, 2025?</question_title>\n<background>Leakage found -- The background mentions \"far-right political movements,\" which indirectly hints at the answer (AfD). Replacement -- German football fans have a history of organizing protests against certain political movements, often displaying banners and chanting slogans during matches. The federal election in Germany is a significant political event that could influence such demonstrations.</background>\n<resolution_criteria>\n<ul>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>Which political party will German football fans protest against during the federal election on February 23, 2025?</question_title>\n<background>German football fans have a history of organizing protests against certain political movements, often displaying banners and chanting slogans during matches. The federal election in Germany is a significant political event that could influence such demonstrations.</background>\n<resolution_criteria>\n<ul>\n    <li>\n      <b>Source of Truth</b>: The question will resolve based on reports from major news outlets (e.g., DW, Reuters, or AFP) covering protests by German football fans during the federal election period, specifically mentioning the targeted political party.  \n    </li>\n    <li>\n      <b>Resolution Date</b>: The resolution occurs on or after February 23, 2025, when the federal election takes place and subsequent reports are published. \n    </li>\n    <li>\n      <b>Accepted Answer Format</b>: The full name of the political party as stated in the reports, exactly as mentioned (e.g., \"Alternative for Germany\" or \"AfD\").\n    </li>\n</ul>\n</resolution_criteria>\n<answer>Alternative for Germany (AfD)</answer>\n<answer_type>string (political party name)</answer_type>\n</q1>"}
{"article_title": "Bundesliga Bulletin: Reus Dortmund′s super sub, Müller shines for Bayern", "article_description": "The Bundesliga returned with a bang after the international break. Borussia Dortmund had to visit a Hoffenheim side that recently hammered Bayern Munich. Elsewhere, Arminia Bielefeld hosted the defending champions.", "article_maintext": "Bundesliga Matchday 4 headlines:\n- Super subs save Dortmund\n- Bayern sweep past Bielefeld\n- Poulsen stunner boosts Leipzig\n- No away wins\nSuper subs save Dortmund\nGio Reyna impressed, Thomas Meunier hit the bar, but Dortmund lacked punch against a Hoffenheim side that have long caused them trouble. Even without star striker Andrej Kramaric, one of two club players infected with the coronavirus following international duty, the hosts made life hard for Dortmund.Inevitably when Erling Haaland and Marco Reus came off the bench, they decided the game. Haaland, staying just onside, set up Reus to pass into an empty net. Given the non-stop run of games for players at the moment, Dortmund will be very happy about these three points.\nBayern sweep past Bielefeld\nThanks to a deeper squad, Bayern Munich were able to play most of their stars against Bielefeld having rested them for the German Cup just days before. The result was a strong win, two goals each for Robert Lewandowski and Thomas Müller, though a red card for Corentin Tolisso. For Arminia, the defeat was made all the more painful without their fans (the game was played behind closed doors due to high coronavirus infection rates in the city) but on-loan winger Ritsu Doan was a bright spark.\nPoulsen stunner boosts Leipzig\nIn the battle of the top two sides in the table, RB Leipzig got the better of strong starters Augsburg. Angelino scored a header for the second league game in a row just before the break, a goal that broke Augsburg. Yussuf Poulsen's goal — a thumping, first-time, cross-goal volley — just after the hour mark ended the contest. Marco van Basten would have been proud.\nNo away wins\nPerhaps it was just the fixture list this weekend or perhaps it was the lack of enough or any fans that meant the fourth weekend of the Bundesliga season ended without a home win. Freiburg and Gladbach should have won, while Hertha lost to Stuttgart in Berlin for the first time since 2013. Also of note, there were four 1-1 draws on the same matchday, the first time since the penultimate round of the 2016-17 season.\nPlayer of the week: Thomas Müller (Bayern)\nThomas Müller looks to be benefiting from not being a part of the international set-up anymore. After playing and scoring in Bayern's German Cup game during midweek, Müller's fine form continued on Saturday evening against Bielefeld. The 31-year-old scored two and assisted one in a dominant win. Is another record-breaking season on the way?\nYoung player of the week: Ismail Jakobs (Cologne)\nCologne earned their first point of the season and while 21-year-old left-sided winger Ismail Jakobs wasn't involved in the equalizer, he was a big positive for the home side. Regularly looking to drive towards goal, Jakobs posed a problem for Frankfurt down the left. Perhaps this will be his breakout season.\nCoach of the week: Pellegrino Matarazzo (Stuttgart)\nMatarazzo secured Stuttgart's first win in the Olympiastadion in seven years. Stuttgart's early set-piece goal put them in a confident spot and a strong defensive showing, particularly in the second half when Hertha Berlin pushed for an equalizer, along with a game-ending counterattack was a sign this Stuttgart side is maturing. That's seven points now for the newcomers from their first four games.", "article_url": "https://www.dw.com/en/bundesliga-bulletin-reus-dortmunds-super-sub-m%C3%BCller-shines-for-bayern/a-55311069?maca=en-rss-en-all-1573-rdf", "article_date_publish": null, "article_date_modify": null, "article_date_download": "2020-10-18 18:54:03+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>No leakage found</question_title>\n<background>No leakage found</background>\n<resolution_criteria>\n<ul>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>Who will be the Bundesliga Player of the Week for Matchday 4, as officially announced by the league?</question_title>\n<background>The Bundesliga awards a Player of the Week honor after each matchday based on standout performances in league matches.</background>\n<resolution_criteria>\n<ul>\n    <li>\n      <b>Source of Truth</b>: The question will resolve based on the official Bundesliga announcement of the Player of the Week for Matchday 4, typically published on the league's official website or social media channels.\n    </li>\n    <li>\n      <b>Resolution Date</b>: The resolution occurs on the calendar date when the Bundesliga publicly names the Player of the Week for Matchday 4 (expected within 1-2 days after the matchday concludes).\n    </li>\n    <li>\n      <b>Accepted Answer Format</b>: The full name of the player exactly as given in the official announcement should be provided.\n    </li>\n</ul>\n</resolution_criteria>\n<answer>Thomas Müller</answer>\n<answer_type>string (name)</answer_type>\n</q1>"}
{"article_title": "Bitcoin surges past $50,000 for first time", "article_description": "The cryptocurrency's value has jumped by nearly 75% since the start of this year as more companies, including Tesla, have lent their support. The surge also coincides with volatility on the markets amid the pandemic.", "article_maintext": "Bitcoin cracked the $50,000 (€41,100) threshold on Tuesday in midday European trading.\nAround 1235 GMT, the popular cryptocurrency rose to its all-time high of $50,547.70 — jumping up 4.4% since Monday.\nIt later dropped slightly down to $49,500 around 1255 GMT.\nWhy is the price going up?\nBitcoin's value has surged almost 75% this calendar year alone as the digital currency gains more mainstream support.\nIts lowest ebb in the last 52 weeks is a little over $4,000, more than 12 times less than its current price.\nAmong the currency's famous backers are Elon Musk. In early February, Bitcoin's value surged after Musk's Tesla announced it bought $1.5 billion of Bitcoin.\nThe company also said it would accept the currency from those who wish to purchase Tesla cars.\nFollowing the news, Blue Ridge Bank said it would start providing access to Bitcoin at its branches — making the Charlottesville, Virgina bank the first commercial bank to do so.\nThe oldest bank in the United States, BNY Mellon, followed suit.\nMastercard has also said it would accept the currency despite skepticism from regulators.\nWhat is Bitcoin?\nBitcoin is one of the world's most popular digital currencies.\nIt was launched online in 2009, but made headlines in 2017 after its price soared from under $1,000 in January to almost $20,000 in December that year.\nThe virtual Bitcoin bubble later burst, but growing corporate support has changed the currency's outlook this time.\nBitcoins are traded online via blockchain, a decentralized registry system that requires large amounts of computer processing power to manage transactions.\nrs/msh (AFP, Reuters)", "article_url": "https://www.dw.com/en/bitcoin-surges-past-50000-for-first-time/a-56587603?maca=en-rss-en-bus-2091-xml-atom", "article_date_publish": "2017-11-07 00:00:00", "article_date_modify": null, "article_date_download": "2021-02-16 14:46:21+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>No leakage found</question_title>\n<background>No leakage found</background>\n<resolution_criteria>\n<ul>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>What will be Bitcoin's highest price (in USD) on Tuesday, February 16, 2021, based on midday European trading data?</question_title>\n<background>Bitcoin is a popular cryptocurrency that experiences price fluctuations due to market demand and corporate support. Its price is tracked in real-time during trading hours.</background>\n<resolution_criteria>\n<ul>\n    <li>\n      <b>Source of Truth</b>: The question will resolve based on the highest Bitcoin price recorded during midday European trading on February 16, 2021, as reported by reputable financial data sources (e.g., CoinMarketCap, Bloomberg, Reuters).\n    </li>\n    <li>\n      <b>Resolution Date</b>: The resolution occurs on February 16, 2021, based on trading data from that day.\n    </li>\n    <li>\n      <b>Accepted Answer Format</b>: The answer must be the exact highest price in USD (including cents) reached during midday European trading on February 16, 2021. The value should be provided as a numeric decimal (e.g., 50047.70).\n    </li>\n</ul>\n</resolution_criteria>\n<answer>50547.70</answer>\n<answer_type>numeric (decimal)</answer_type>\n</q1>"}
{"article_title": "In focus: The geopolitics of water", "article_description": "Without water there is no life. Due to climate change, water is increasingly becoming a precious and contested commodity.", "article_maintext": "Water and power: The politics of dams\nGERD: A show of pride\nAt 145 meters high and almost 2 kilometers long, the 5GW Grand Ethiopian Renaissance Dam is set to double the country's electricity generation. Without agreements from downstream countries, GERD was refused funding from the World Bank, but crowdfunding the $4.8bn-project through private donations and government bonds has made it a still-greater source of national pride for many Ethiopians.\nWater and power: The politics of dams\nLife on the Nile\nEgypt and Sudan fear the consequences of GERD. With it, Ethiopia will have control of the waters they depend on to keep Nile Delta farmland flourishing. As a hydropower project, water should keep flowing, but its neighbors aren't convinced by Ethiopia's assurances that it won't use the dam to divert waters to irrigate its own land, particularly as climate change threatens to make water scarcer.\nWater and power: The politics of dams\nMekong megadams\nSince the 1990s, China has built 11 giant dams on the Mekong River, which help make the country the world’s biggest producer of hydropower — its second biggest source of electricity after coal. But with Laos, Thailand, Vietnam and Cambodia all dependent on the Mekong, too, this construction spree has caused consternation downstream.\nWater and power: The politics of dams\nDrought in Cambodia\nDownriver, the Mekong Delta has suffered as China's dams change the timing and flow of its waters. Droughts have become more frequent and fish stocks have suffered, with fishing and farming communities in Thailand and Cambodia particularly hard-hit, even as satellite data has shown above-average snowmelt and rainfall adding to Chinese stretches of the river.\nWater and power: The politics of dams\nChina's global hydropower reach\nChina is also investing in hundreds of hydropower projects abroad, from Laos to Portugal, Kazakhstan to Argentina, and across Africa — including the Souapiti dam in Guinea. Previously, these colossal infrastructure projects were often financed by the World Bank, but China is increasingly taking over a major funder, and doesn't require agreements from countries sharing the same river basins.\nWater and power: The politics of dams\nDisplaced by the dam\nThe Souapiti dam in Guinea, financed by China International Water and Electric Corporation, will provide 450MW of power in a country where only a minority have access to a reliable electricity supply. But to create its giant reservoir, flooding 253 square kilometers of land, some 16,000 people from more than 100 villages have been displaced, according to Human Rights Watch.\nWater and power: The politics of dams\nBridging the border?\nThe Itaipu dam on the Paraná River between Brazil and Paraguay flooded huge tracts of forest well as one of the world's most impressive waterfalls, and displaced 65,000 people. It also caused tensions between the two countries, which signed an agreement to work together on the jointly owned hydropower project in 1973. But with the bulk of the power going to Brazil, the dam remains controversial.\nWater and power: The politics of dams\nDaming the Colorado\nThe Mexico-US border might conjure images of migration and Trump's dream of building a wall to divide the two countries. But as well as tensions over people heading north, there have been worries over the Colorado River’s flow in the opposite direction. By the time the river reaches Mexico, it has passed through seven US states and numerous dams that divert its waters to irrigate US crops.\nWater and power: The politics of dams\nWatering the Mexicali Valley\nBut the two countries have been working together to use the Morelos Dam on their shared border to water the Mexicali Valley, with a \"pulse\" system mimicking the river's natural flow into the Colorado Delta. Water politics expert Scott Moore says it shows \"cooperation between the US and Mexico, but also between environmental groups, farmers, irrigation districts and ecological management.\"\nAuthor: Ruby Russell", "article_url": "https://www.dw.com/en/in-focus-the-geopolitics-of-water/a-61540989", "article_date_publish": null, "article_date_modify": null, "article_date_download": "2022-04-21 12:42:28+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>No leakage found</question_title>\n<background>No leakage found</background>\n<resolution_criteria>\n<ul>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>What will be the total installed capacity (in GW) of the Grand Ethiopian Renaissance Dam (GERD) upon completion?</question_title>\n<background>The Grand Ethiopian Renaissance Dam (GERD) is a major hydropower project on the Blue Nile in Ethiopia, intended to significantly increase the country's electricity generation capacity. Hydropower dams are measured by their installed capacity, which is the maximum amount of power they can produce under ideal conditions.</background>\n<resolution_criteria>\n<ul>\n    <li>\n      <b>Source of Truth</b>: The question will resolve based on official reports from the Ethiopian government or GERD project authorities confirming the total installed capacity upon completion.  \n    </li>\n    <li>\n      <b>Resolution Date</b>: The resolution occurs when the GERD project is officially declared complete and its installed capacity is publicly reported.\n    </li>\n    <li>\n      <b>Accepted Answer Format</b>: The answer should be a numerical value in gigawatts (GW), rounded to one decimal place if necessary.\n    </li>\n</ul>\n</resolution_criteria>\n<answer>5GW</answer>\n<answer_type>numeric (decimal)</answer_type>\n</q1>"}
{"article_title": "2024 Olympics: Why France bans veiled athletes", "article_description": "The next Olympic host nation has been embroiled in a debate around head coverings, even though no high-level French athletes wear them. It has become an increasingly thorny subject in a number of sports.", "article_maintext": "France insists that none of its athletes will be allowed to wear the hijab, or any religious items, during the Olympic Games in Paris next year. The reiteration of national policy comes even though no top-level French athletes wear the head covering. Sports minister Amelie Oudea-Castera confirmed last weekend that no member of the country's delegation will be allowed to wear a veil because of France's strict policy of secularism in public life.\n\"That means a ban on any type of proselytizing. That means absolute neutrality in public services,\" Oudea-Castera told France 3 television. \"The France team will not wear the headscarf.\"\nIOC: Hijab is allowed in the Olympic Village\nIn response to a set of questions from DW, the International Olympic Committee (IOC) stated that athletes are only subject to the rules of their sporting federations at the Olympic Games.\n\"For sporting competitions at Paris 2024, the wearing of the hijab is dependent on the competition regulations set by the relevant International Federation (IF). In the Olympic Village, athletes are free to wear the Hijab at any time,\" an IOC spokesperson wrote.\nFor their part, the French sports ministry told DW: \"In order to apply this constitutional principle, members of the French teams cannot express their opinions and religious beliefs. Thus, one cannot wear the veil (or any other accessory or outfit demonstrating religious affiliation) when representing France in a national or international sporting competition.\"\nParis 2024 organizers told DW that rules concerning the wearing of the hijab in French sport extended \"far beyond\" their jurisdiction, adding: \"Our responsibility is to welcome athletes from around the world in the best possible conditions.\"\nWhy is the hijab a political issue in France?\nFrench law maintains strict secularism. And the issue of religious dress goes to the heart of that. These laws are intended to keep the state neutral in religious matters while guaranteeing citizens the right to freely practice their religion in private.They prohibit wearing religious symbols in some contexts, such as in state schools and by civil servants. It outlawed full-face coverings in 2010.\nThis year has also seen the ban on the abaya, a loose-fitting dress often worn by Muslim women, in schools.\nIn June, the Conseil d'Etat (Council of State) affirmed a law banning the hijab in football after a pressure group called Les Hijabeuses and the Human Rights League filed for it to be overturned.\nThe Council of State supported the FFF's (the French Football Federation) ban and stated that it \"is appropriate and proportionate\".\nLes hijabeuses called the decision \"shocking\" adding that it legitimized \"violence against women, against Islam, which exists in French society\" by excluding those women.\nNo discrimination against women – UN\nThe United Nations Human Rights Office spoke out against the French law's discriminatory effects against women this week.\n\"No one should impose on a woman what she needs to wear or not wear,\" said the organization's spokeswoman, Marta Hurtado.\nShe stressed that the International Convention on the Elimination of All Forms of Discrimination Against Women ruled out discriminatory practices.\n\"Any state party to the convention, in this case France, has an obligation to ... modify social or cultural patterns which are based on the idea of the inferiority or superiority of either sex,\" Hurtado said.\n\"Discriminatory practices against a group can have harmful consequences,\" she pointed out.\nHijab in football\nMorocco's Nouhaila Benzina became the first woman to wear the hijab at the FIFA Women's World Cup this year. She played for the Atlas Lionesses, who reached the second round at their first-ever World Cup in Australia and New Zealand.\nBut it was not long ago that football governing body FIFA lifted its ban on the hijab, declaring it safe to wear during football matches. This came after a Canadian teenager was stopped from playing in a Hijab in 2007. The Iranian women's national team had also been stopped from playing an Olympic qualifier in Jordan in 2011.\nHijab at the Olympics\nUS fencer Ibtihaj Muhammad is the most high-profile athlete to have worn the hijab at the Olympic Games. She won a bronze medal in Team Sabre at the 2016 Olympic Games in Rio de Janeiro, wearing the head covering, which made her a leading voice for diversity and equality in sport.\nOther sports disciplines that allow the hijab are weightlifting, taekwondo, volleyball and athletics.\nAdditional reporting: Jonathan Crane.\nEdited by: Matt Pearson", "article_url": "https://www.dw.com/en/2024-olympics-why-france-bans-veiled-athletes/a-66946826", "article_date_publish": "2023-09-28 13:19:09", "article_date_modify": null, "article_date_download": "2023-09-28 13:39:36+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>No leakage found</question_title>\n<background>No leakage found</background>\n<resolution_criteria>\n<ul>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>Will any French athlete wear a hijab during the 2024 Paris Olympics, based on official French policy?</question_title>\n<background>France has a strict policy of secularism in public life, which includes restrictions on wearing religious symbols, such as the hijab, in certain contexts. The International Olympic Committee allows athletes to wear the hijab in the Olympic Village but defers to individual sporting federations for competition rules.</background>\n<resolution_criteria>\n<ul>\n    <li>\n      <b>Source of Truth</b>: The question will resolve based on official statements from the French sports ministry or confirmed reports from the 2024 Paris Olympics regarding whether any French athlete wore a hijab during the Games.\n    </li>\n    <li>\n      <b>Resolution Date</b>: The resolution occurs by the end of the 2024 Paris Olympics (July 26 - August 11, 2024). \n    </li>\n    <li>\n      <b>Accepted Answer Format</b>: The answer must be either \"Yes\" or \"No\", based on whether any French athlete is confirmed to have worn a hijab during the Games.\n    </li>\n</ul>\n</resolution_criteria>\n<answer>No</answer>\n<answer_type>string (binary: Yes/No)</answer_type>\n</q1>"}
{"article_title": "Nobel Prize in medicine goes to Victor Ambros, Gary Ruvkun", "article_description": "US scientists Victor Ambros and Gary Ruvkun have been awarded the Nobel Prize in physiology or medicine for their research into microRNA.", "article_maintext": "American scientists Victor Ambros and Gary Ruvkun have been jointly awarded the Nobel Prize in medicine or physiology for their shared discovery of microRNA and the role it plays in post-transcriptional gene regulation.\nAt the announcement by the Nobel Assembly at the Karolinska Institutet in Sweden on Monday morning, Nobel Committee vice-chair Professor Olle Kämpe described the discovery of microRNA as \"a tiny molecule that has opened a new field in gene regulation.\"\nThough the pair worked in separate labs, their joint research focus led to them combining their resources to expand knowledge of microRNA and its role.\n\"The seminal discovery of microRNA has introduced a new and unexpected mechanism of gene regulation,\" said Kämpe.\n\"MicroRNAs are important for our understanding of embryological development, normal cell physiology and diseases such as cancer. As an example, tumors often perturb microRNA networks to grow.\"\nNobel Prize microRNA discovery started with a tiny roundworm\nThis Nobel Prize is all about foundational genetics.\nAt the heart of what makes a living organism function is the ability of double-stranded DNA to be translated by single-stranded RNA molecules. These \"messenger\" RNA (mRNA) create an \"information molecule\" from DNA and move into a cell’s protein factory — a ribosome — where amino acids align to this template and then fold into specialized proteins.\nThese proteins are the building blocks of all living organisms. But mutations or variations to genes can cause changes in function — often benign, but potentially disease-causing.\nThis general pathway to organism metabolism has been understood for a long time, but as Kämpe posed, \"What determines that only the right genes are transcribed into messenger RNA and then translated into the right, tissue-specific proteins at the right time?\"\nThe answer starts with one specific organism, the roundworm species Caenorhabditis elegans. Despite its size, the roundworm has 20,000 genes that code for proteins — about the same number as a human, making it an ideal lab ‘model’ for physiological research.\nDifferent mutations to C. elegans genes were found to cause growth changes. One triggered excessive growth via a repeating developmental pathway. Another restricted growth due to a different gene variation.\nAmbros found the enlarging \"lin-4\" variant in 1993, with Ruvkun isolating the \"lin-14\" mutation present in the miniature worms a year later. What wasn’t clear was how these variations interacted and influenced cell regulation. The pair joined forces to find the answer.\nA micro discovery leads to big implications for science\nAmbros and Ruvkun found their respective mutations interacted — specifically, that a sequence of code on the lin-4 gene corresponded to part of a lin-14 sequence.\nThis was the critical moment when microRNA was determined to exist, as a distinct form of RNA.\n\"At this point they had discovered a novel and unexpected mechanism of gene regulation — microRNA,\" said Kämpe. \"For a long time, however, microRNA was believed to be an oddity peculiar to C. elegans.\"\nIt required more evidence to confirm their findings.\nIt came in 2000, when Ruvkun found another gene — \"let-7\" — which was found not just in roundworm, but in humans and most animals.\nMany microRNAs, it turns out, are highly conserved across animals, plants and fungi, meaning that they are largely unchanged from species-to-species and across hundreds of millions of years of biological evolution.\nMore than 1,000 microRNA genes have been found in humans.\n\"Every microRNA regulates several genes,\" said Kämpe. \"And each mRNA is regulated by many distinct microRNAs, creating a robust system for gene regulation.\"\nWhen did RNA enter the public spotlight?\nRNA was thrust into the public consciousness with the rise of RNA-based vaccine technology at the height of the COVID-19 pandemic.\nThese vaccine products could be developed relatively quickly by creating imitation proteins based on small sections of genetic code from the SARS-CoV-2 virus.\nWhen used in a vaccine, these proteins provide a non-disease-causing target for the human immune system to find and create antibodies ready for the real virus.\nKatalin Kariko and Drew Weissman were awarded last year’s prize for their work developing mRNA vaccine technology.\nHowever while last year’s prize was very much in recognition of work that had led to direct medical applications, this year’s is more research focused.\n\"This year’s prize is definitely a physiology prize,\" said Professor Gunilla Karlsson Hederstam, chair of the Nobel Committee for Physiology or Medicine. \"Last year, of course, [was] much a more applied discovery that was translated into vaccine development, so two quite different prizes.\n\"Although there are no very clear applications available yet, understanding them, knowing that they exist, understanding their regulatory networks is always the first step.\"\nWhy type of products are being developed which utilize microRNA technology?\nSo while this year’s prize is very much focused on discovery rather than application, the realization of the Ambros-Ruvkun research may not be far away. There are currently several vaccine-type products in clinical trial stage for cancer, cardiovascular and other diseases that use microRNA technology.\nThe challenge is hitting the right target. Take a cancer cell. There may be a specific gene that a vaccine needs to address, but microRNAs regulate many different genes. The risk is that a product may act more like a bulldozer than a scalpel.\n\"But there might be ways around that,\" said Kämpe, \"Tumors quite often perturb the microRNA networks and they can do that by deleting the genes or mutating the genes that process the microRNA.\n\"In [this] case there are promising first tests to see if you can modulate the RNA-binding proteins, but to deliver microRNAs to cells and think you get one effect, I think will be very difficult.\"\nTwo more Nobel science prizes will be awarded this week, with the physics laureate to be revealed on Tuesday, and chemistry prize on Wednesday.\nWhat is the history of the Nobel Prize in Physiology or Medicine?\nThis year's Prize, set at 11 million Swedish kronor (about $1.06 million USD), is yet another recognition of genetic discovery.\nArthur Kornberg and Severo Ochoa were recognized in 1959 for identifying the synthesis mechanisms of DNA and RNA, while the famed trio Crick, Watson and Wilkins were awarded the prize in 1952 for unravelling the DNA Double Helix.\nFire and Mello (2006), and Karikó and Weissman (2023) have also had their work on RNA recognized.\nFamed Austrian neurologist and founder of psychoanalysis Sigmund Freud (1856-1939) was nominated for his work in Physiology and Medicine but was never named as a recipient.\nAt 31, Canadian surgeon and pharmacologist Frederick G. Banting is the youngest recipient of the Prize in Physiology or Medicine. He was recognized in 1923 for his discovery of insulin.\nThe American pathologist Francis Peyton Rous is the oldest, receiving his award in 1966 aged 87 for his discovery of tumor-inducing viruses.\nThe prize has been declined once. In 1939, Gerhard Domagk was prevented by Germany's Nazi Government from receiving his award for his discovery of an antibiotic against Streptococcus infections. He was later able to receive his diploma and medal in 1947.\nEdited by: Wesley Dockery", "article_url": "https://www.dw.com/en/us-scientists-victor-ambros-gary-ruvkun-win-nobel-prize-in-medicine/a-70374530?maca=en-rss-en-all-1573-xml-atom", "article_date_publish": "2024-10-07 09:37:42", "article_date_modify": null, "article_date_download": "2024-10-08 10:53:33+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>No leakage found</question_title>\n<background>No leakage found</background>\n<resolution_criteria>\n<ul>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>Who will win the Nobel Prize in Physiology or Medicine in 2024?</question_title>\n<background>The Nobel Prize in Physiology or Medicine is awarded annually by the Nobel Assembly at the Karolinska Institutet for outstanding discoveries in the fields of life sciences and medicine.</background>\n<resolution_criteria>\n<ul>\n    <li>\n      <b>Source of Truth</b>: The question will resolve when the Nobel Assembly at the Karolinska Institutet publicly announces the official 2024 Nobel Prize in Physiology or Medicine laureate(s)—typically via a press release on NobelPrize.org.  \n    </li>\n    <li>\n      <b>Resolution Date</b>: The resolution occurs on the calendar date when the 2024 laureate(s) are formally named (typically early October 2024). \n    </li>\n    <li>\n      <b>Accepted Answer Format</b>: The full name(s) of the laureate(s) exactly as given in the announcement should be provided. If more than one person shares the prize, all names must be listed in the same order as the official communiqué.\n    </li>\n</ul>\n</resolution_criteria>\n<answer>Victor Ambros and Gary Ruvkun</answer>\n<answer_type>string (name)</answer_type>\n</q1>"}
{"article_title": "Omar Marmoush: How Bundesliga forged Manchester City star", "article_description": "Mo Salah's Egyptian teammate Omar Marmoush has gone from largely unknown to big money Manchester City signing. But his rise to prominence in Germany's Bundesliga was not always smooth.", "article_maintext": "Omar Marmoush spent the first half of this season tearing the Bundesliga up. Now, after a €75 million ($79 million) move to struggling English champions Manchester City was confirmed on Thursday, he will be hoping to repeat the trick in the Premier League.\n\"It's a pleasure and an honour for me and my family to be representing Manchester City. It makes them happy; it makes me happy that my dreams are becoming a reality,\" Marmoush said on the Manchester City website. \"The last two seasons have been great, but it is just the beginning for me.\"\nThe Egyptian was a key figure for Eintracht Frankfurt, with his dynamic footwork and finishing flair bringing many a defender to their knees, and will be sorely missed.\n\"The way he's gotten himself stuck in and won over crowds, not to mention how decisive his goals and assists are, it's clear he feels at home here,\" Frankfurt coach Dino Toppmöller told German sports magazine kicker before his departure.\nWhile fans will have to get used to a Bundesliga without Marmoush's name in the headlines, the 25-year-old's first years in Germany were anything but easy.\nMarmoush's Egyptian education\n\"As a kid I dreamed of being a pro footballer. And sometimes in school I wasn't exactly the best, so it was my only way,\" Marmoush told the DFL, the company that operates the Bundesliga in late 2024.\nBorn and raised in Egypt's capital Cairo, Marmoush, like many, had dreams of a football life from a young age. Though he says his parents were initially skeptical of his love of the sport and hoped he'd focus more on his education, he soon won them over.\n\"After I started to take bigger steps they saw the potential and said: 'Ok, you can do this.' They support me every day, they're the biggest thing in my life,\" Marmoush said.\nMarmoush began playing at Cairo's American International School, where he was also attending classes. The school's football coach, Ahmed Elagroudy, still vividly remembers him as a youngster.\n\"Since Marmoush was in grade seven, it was obvious he's going to be a brilliant football player. I could see this on the pitch, he was one of our main players,\" Elagroudy told the DFL.\nThe strengths that make Marmoush stand out today were already apparent in Cairo.\n\"As he grew older, things got even better. It started to be clear he's a great scorer, it's like his foot always knew the way to the goal.\"\nElagroudy encouraged his pupil to make the jump to nearby Egyptian Premier League side Wadi Degla. After just a few weeks in their youth setup, he was promoted to the first team and made enough of an impression to represent Egypt at the U-20 African Cup of Nations (AFCON) back in 2017.\nA bumpy start in the Bundesliga\nMarmoush's AFCON appearance caught Wolfsburg's eye, and the Bundesliga side lured the 18-year-old striker to Germany, signing him to their reserves. As thrilling as the jump to Europe was, it was a difficult transition.\n\"It was not an easy step to leave my family, friends and country to come live here in Germany, where I don't know the language, the food, everything, honestly,\" said Marmoush. \"And this was the biggest challenge, not just to play in these European conditions and how fast the football is, but also on the mental side. It took me a bit of time to learn how to live here.\"\nThree years later, at age 21, Marmoush broke into Wolfsburg's first team to make his Bundesliga debut.\nLoans to then-second division St. Pauli and later Stuttgart demonstrated flashes of brilliance, but he was far from a household name. Despite a few spectacular goals, the 2022-23 season proved to be Marmoush's last at Wolfsburg as he headed south to Frankfurt that offseason.\nFrankurt fan favorite and Egypt impact\nDino Toppmöller's Eintracht — where high pressure and quick, direct play are king — proved a perfect fit for Marmoush. He enjoyed a career-best 17 goals in all competitions in 2023-24, setting the groundwork for this season's stunning form. Marmoush's performances also led to a striking partnership with Hugo Ekitike blossoming.\nHis excellent form has also cemented Marmoush's role for the Egyptian national team. Although eligible to play for Canada because his parents worked there long enough to earn citizenship, he elected to represent his country of birth and made his full team debut in 2021. He played in every game at the delayed 2022 AFCON in which Egypt finished runners-up, before scoring in the tournament two years later, when Egypt crashed out on penalties.\nMarmoush is now an established international and regularly runs out alongside personal hero Mo Salah, of Liverpool.\n\"It's a big pleasure. I'm so happy when I'm in the national team and playing with one of the best players in the world. To learn from him, both on the pitch but also off of it, and how he works and his professionalism. [Salah] is like an older brother to me,\" Marmoush said.\nAt 32, Salah's time as leader of the Egypt team is winding down, opening the door for Marmoush to be the next attacking focal point. Having established himself as such at Frankfurt, his next task is to standout among the galaxy of stars at City.\nThis article was originally published on November 8, 2024 and updated on January 24, 2025 with the news of Marmoush's transfer to Manchester City.\nEdited by: Jonathan Harding", "article_url": "https://www.dw.com/en/omar-marmoush-how-the-bundesliga-forged-manchester-city-star/a-70733853?maca=en-rss-en-sports-1027-rdf", "article_date_publish": "2024-11-08 13:28:59", "article_date_modify": null, "article_date_download": "2025-01-24 13:45:16+00:00", "generated_questions": "<analysis>\n<q1>\n<question_title>No leakage found</question_title>\n<background>No leakage found</background>\n<resolution_criteria>\n<ul>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n    <li>No leakage found</li>\n</ul>\n</resolution_criteria>\n</q1>\n</analysis>\n\n<q1>\n<question_id>0</question_id>\n<question_title>Which club will Omar Marmoush join after leaving Eintracht Frankfurt, as confirmed in January 2025?</question_title>\n<background>Omar Marmoush is an Egyptian professional footballer who played for Eintracht Frankfurt in the Bundesliga before transferring to another club. His performances in Germany attracted attention from top European clubs.</background>\n<resolution_criteria>\n<ul>\n    <li>\n      <b>Source of Truth</b>: The question will resolve based on the official announcement of Marmoush's transfer by the acquiring club, as reported by reliable sports news sources (e.g., BBC Sport, Sky Sports, or the club's official website) by January 2025.\n    </li>\n    <li>\n      <b>Resolution Date</b>: The resolution occurs on the calendar date when the transfer is officially confirmed (by January 2025).\n    </li>\n    <li>\n      <b>Accepted Answer Format</b>: The full name of the club exactly as stated in the official announcement (e.g., \"Manchester City\").\n    </li>\n</ul>\n</resolution_criteria>\n<answer>Manchester City</answer>\n<answer_type>string (club name)</answer_type>\n</q1>"}
