{"authors": ["India McTaggart"], "date_download": "2025-08-05 14:19:38+00:00", "date_modify": null, "date_publish": "2025-08-04 19:53:00", "description": "Black and white image of Meghan, 44, smiling in a garden posted on lifestyle firm’s Instagram page", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Froyal-family%2F2025%2F08%2F04%2Fbirthday-picture-duchess-of-sussex-celebrates-her-magic%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/briefs/2025/08/04/TELEMMGLPICT000434700797_17543302985450_trans_NvBQzQNjv4Bq-cVLixJZjJiTSS6NRQsYH3wSCF1R0VweJ7DS2UnVMSQ.jpeg?impolicy=OG-Standard", "language": "en", "localpath": null, "maintext": "A new image of the Duchess of Sussex has been shared to mark her 44th birthday.\nThe Duchess, pictured in black and white, can be seen smiling with a garden in the background.\nIt was published on the Instagram account of her lifestyle business, As Ever, on Monday afternoon.\nThe accompanying caption states: “Celebrating the woman behind it all.\n“She pours her heart, vision and magic touch into every detail, and today, we raise a glass to her!\n“Happy Birthday to our founder.”\nMeghan’s business, for which she has partnered with Netflix, was officially launched in April. Among the products for sale were raspberry jam, wildflower honey, shortbread biscuit mix and edible flower sprinkles.", "source_domain": "www.telegraph.co.uk", "title": "Duchess of Sussex birthday picture celebrates her ‘magic’", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/royal-family/2025/08/04/birthday-picture-duchess-of-sussex-celebrates-her-magic/", "id": "fae82d639019ed9ad327e340def6f11165441e1a2d87a270221f309e3f91a2a6"}
{"authors": ["Charles Richardson"], "date_download": "2025-08-05 14:20:11+00:00", "date_modify": null, "date_publish": "2025-08-05 09:33:00", "description": "From already-trusted tourists to emerging young talents these are the players who will fancy their chances of taking on the All Blacks", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Frugby-union%2F2025%2F08%2F05%2Fhere-is-what-the-2029-lions-team-will-look-like%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/rugby-union/2025/08/04/TELEMMGLPICT000434701539_17543311224370_trans_NvBQzQNjv4BqqVzuuqpFlyLIwiB6NTmJwfSVWeZ_vEN7c6bHu2jJnT8.jpeg?impolicy=OG-Standard", "language": "en", "localpath": null, "maintext": "I was tasked with picking a British and Irish Lions team to take on New Zealand in 2029.\nAnd so giving myself the criteria of selecting the players currently under 30 who would be in pole position, this is the 15 who could topple the All Blacks.\n15. Blair Kinghorn (Scotland)\nWe have not yet seen the best of Kinghorn – although, after a few errors against the First Nations and Pasifika XV, the Scot was strong off the bench in the second Test and started the third after a delayed start to his tour. A year younger than Hugo Keenan, Kinghorn has the potential to go from strength to strength in the coming years. Playing club rugby at Toulouse always helps, too.\n14. Tommy Freeman (England)\nThere is no reason why Freeman, ever-present in the 2025 Tests, will not end up on the right wing once again in 2029. Quick, strong and aerially astute, he kept his place in the side on the back of his strong showings in the warm-ups rather than excelling in the Tests. But it shows how much credit he had in the bank that Andy Farrell stuck with him. One of the first names on the England team-sheet in an area of real strength.\n13. Ollie Lawrence (England)\nThere is every chance that Jamie Osborne could feature in the midfield, but alongside Tom Jordan and Sam Prendergast the back line would need some ballast; an out-and-out running threat. Lawrence’s chances of touring in 2025 were cruelly ended by an Achilles injury suffered on England duty in the Six Nations, at a time when he had established himself as his country’s premier centre. Aged just 25, there is no reason why that could not continue for another four years.\n12. Tom Jordan (Scotland)\nIn another world, Jordan may well have been a Lion in 2025. Not just with the early injury to Elliot Daly – Jordan’s ability to cover 10,12 and 15 made him a prime candidate as replacement – but the Scot must have been in with a shot at making the original squad given his versatility and general excellence. Before a move to Bristol – if he can nail down a starting spot with Scotland, which will be easier said than done – he can have every hope of touring the land of his birth in 2029.\n11. Immanuel Feyi-Waboso (England)\nAs with Jordan, in another world Feyi-Waboso could have been a Lion this summer. Had injury not put a premature end to his season – he returned in June only to be sent off and banned in England’s uncapped match against France – then he would have been right in the selection picture given his strike-running threat and willingness to hit things very hard on both sides of the ball. Maybe, given the signs of rustiness on his June return, he will be better for not going.\n10. Sam Prendergast (Ireland)\nPrendergast was chucked in at the deep end for last year’s Six Nations. It showed he has some maturing and growing to do – both mentally and physically – but the talent and potential is palpable. Should he bulk up a touch then there is no reason why he could not tour with the Lions in four years’ time. Had he been in the frame for the 2025 tour, it might well have been for the benefit of his future development that he did not feature.\n9. Alex Mitchell (England)\nAlthough Mitchell featured in every match-day 23 of the 2025 tour, it would be fair to say that he never really grasped the nettle. Jamison Gibson-Park always looked like the Test starter and, before his injury, Tomos Williams looked as if he had the bench spot sewn up, too. Ben White also finished the tour in great form but after another four years of experience Mitchell will surely fancy his chances of achieving something he could not this year: a Test start.\n1. Andrew Porter (Ireland)\nA year younger than Ellis Genge, Porter gets the nod at loosehead. England are starting to unearth some fabulous props who could well end up usurping the Irishman – who, admittedly, struggled in the final Test – but Porter has the jersey and so is a sensible choice for 2029. Although the likes of Fin Baxter and Genge might have something to say about that.\n2. Dan Sheehan (Ireland)\nThe easiest pick of the lot. One of the Lions’ outstanding contributors on the 2025 tour who played as well as anyone in the travelling party. Sheehan captained the Lions in an early tour match and, depending on the form and fitness of club-and-country-mate Caelan Doris, he would surely be a candidate to lead more regularly in 2029. One of the world’s outstanding hookers and comfortably the best among the home nations.\n3. Asher Opoku-Fordjour (England)\nGiven his development this season, this could quite easily read Joe Heyes but the frightening thing about Opoku-Fordjour is that he is still just 21 years old. And he plays both sides of the scrum, which is a massive bonus on tour. There are high hopes for Thomas Clarkson, too, after his cameo on the 2025 tour.\n4. Joe McCarthy (Ireland)\nCompletely deserving of another run after impressing this summer. No one would have said that his inclusion was a surprise pre-tour, even if he was susceptible to the odd brain-fade. But the way that he took hold of one of the starting Test jerseys in the second row from his first appearance on tour was commanding and somewhat unexpected. He could easily do the same in four years. Maro Itoje could well be there again, too, but misses out on this selection because of age.\n5. George Martin (England)\nHad injury not severely disrupted the end of Martin’s season, he would have been a shoo-in for the Australia tour. As it was, his last appearance for club or country came in February. If he can get fit and stay fit then his ballast and muscle would offer so much where the Lions currently lack. The tourists (just about) got away with it against Australia, but against better opposition, who knows?\n6. Ollie Chessum (England)\nWith such a heavyweight second row, there would be a real need for a line-out-jumping six. Chessum did his chances of touring in 2029 no harm at all this year, featuring off the bench in two Tests and starting in one. Over the coming years, it looks as though he will become a central part of plans for both club and country, and might even develop into a central leadership figure, too.\n7. Tom Curry (England)\nIt is amazing when you think he is only 27 – by the time of the next tour he will be 31. There were eyebrows raised when he was selected in the Test team for 2025 but Andy Farrell was clearly aware of his value and his selections were fully vindicated. Expect Jac Morgan to still be knocking on the door, too.\n8. Caelan Doris (Ireland)\nThe forgotten man of this year’s Lions tour and, goodness, how they missed him. Injury this year robbed him of representation, but he may well have been captain – who knows – and we can say with certainty that he would have started at No 8. Do not forget, like Curry, he is only 27. It is worth noting, too, that Ben Earl is the same age.", "source_domain": "www.telegraph.co.uk", "title": "Here is what the 2029 Lions team will look like", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/rugby-union/2025/08/05/here-is-what-the-2029-lions-team-will-look-like/", "id": "2bd51d6bc648116a3ce2aec7baa37fa16b1c9b7046149ffb7011379062f3fcc5"}
{"authors": ["Anthony Peregrine"], "date_download": "2025-08-05 14:20:46+00:00", "date_modify": null, "date_publish": "2025-08-05 06:00:00", "description": "From dining with the locals to shunning budget carriers, many supposed travel truisms are deeply misguided", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Ftravel%2Fcomment%2Fmost-annoying-middle-class-opinions-about-holidays%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/travel/2025/08/04/TELEMMGLPICT000434692232_17543169055300_trans_NvBQzQNjv4BqqVzuuqpFlyLIwiB6NTmJwfSVWeZ_vEN7c6bHu2jJnT8.jpeg?impolicy=OG-Standard", "language": "en", "localpath": null, "maintext": "There are many supposed truisms about travel trotted out by right-thinking people. These are often misguided. Among the more specious are the following:\n1. Chain hotels are soulless, so to be avoided\nNo. Give me a clean room, a comfortable bed, a bath in the bathroom (Lord help us, not the bedroom), lighting I can understand, predictable standards – and I’ll supply all the soul that’s needed.\n2. Always eat where the locals eat\nWhy? Even in Europe, locals will eat some appalling muck – or perhaps you’ve never tried Provençal pieds-et-paquets or Norwegian rakfisk? And following locals in, say, Hackney might very well lead to jellied eels. How Bolivian visitors will curse you for that bit of advice.\n3. Never order a full English breakfast in foreign parts\nWhy ever not? Look around you. Japanese people seek out Japanese restaurants in London; Rafael Nadal and Carlos Alcaraz both favour Spanish restaurants near Wimbledon; Italians pile into trattorie all over the world. So eggs, bacon and the full floor show are not merely allowed but positively recommended in the morning sun of Torremolinos. It’s the finest possible setting for the best breakfast in the world. Be proud, and demand brown sauce.\n4. Keep off the beaten track\nWrong. The track is beaten because there’s something worthwhile at the end of it. Otherwise it wouldn’t be beaten. Stay off the beaten track and you’ll likely end up somewhere no-one wants to go: Chernobyl, North Korea, Roubaix, Northampton, that sort of place.\n5. Airline meals are dreadful\nReally? You’re moving at 550mph, 35,000 feet above the ground… and you’re complaining about the state of the lasagne?\n6. You mustn’t use knives and forks for Chinese food, or spaghetti\nOh yes, you must. Thin sticks are uniquely ill-designed for the eating of rice and noodles. Only a totalitarian society would insist on them. Meanwhile, the Italian requirement that spaghetti be not cut but twirled is just another of their ways – coffee invisible to the naked eye, Mario Balotelli, the Mafia – of annoying the world. Chop it up, for heaven’s sake – it tastes the same and doesn’t stain – and, when Chinese or Italians come to Britain, demand they eat their fish and chips with a brick.\n7. Always avoid other Britons on holiday\nWhy on earth? We’re usually pretty decent; also the only ones who can maintain a conversation about the pension triple lock, Bonnie Blue, Port Vale FC, roadworks on the A59, the mystery of London’s parakeets or the legacy of Ozzy Osbourne. Spaniards in a Spanish bar are no more interested in talking to you if you don’t speak Spanish than you are interested in talking to monoglot Slovenians down your local pub. Also you are the other Britons to other Britons, so need to leave wherever you are as soon as other Britons show up, so as not to torpedo their holiday.\n8. We got on marvellously, though we had no common language\nNo. You thought you got by with signs and smiles. You didn’t. As you expressed admiration for Volodymyr Zelensky, so they understood you were inviting them for a fortnight back in Peterborough.\n9. In France, you don’t order a well-done steak or a café au lait in mid-afternoon\nYes you do, if you want to. You’re the customer, Gaspard is the waiter. He disapproves? So what? If he was so great, he’d be sitting where you are and you’d be serving him.\n10. We support sustainable tourism\nTerrific. Go to Southend. Or Blackpool. Or Nice. They’ve all sustained tourism since the late 18th century.\n11. We’re not tourists, we’re travellers\nNo, you’re not. If you leave home for leisure, you’re a tourist. “Travellers” are merely tourists with ideas above their station and odd headgear. There’s no moral or qualitative hierarchy of holiday experiences. Flying to Alicante is in no way inferior to flying to Ulaanbaatar. It’s just a different departure gate.\n12. We always try to soak up local culture\nDangerous. Flamenco is occasionally OK, as is tango in Buenos Aires. That said, fado in Lisbon, dirndl skirts in Bavaria and any folk dancing anywhere have the same effect on a holiday as a colonoscopy.\n13. We never stoop to fast food outlets\nBelieve me, you would – if you saw the alternatives in some resorts I could mention. Put it this way: thank heavens for KFC in Fleetwood, Lancs.\n14. We never fly Ryanair – they treat passengers like cattle\nNo, they don’t. Look around you again. It’s mainly the passengers who behave like cattle. Ryanair staff undoubtedly take vows of patience. Were I faced with shuffling hordes trying to cram a ton of hand luggage into the overhead locker and a gallon of gin and tonic down their throats, I’d be roaring down the aisle, kicking travellers right and left towards the emergency exits. Which I’d open.\n15. We don’t buy tourist tat\nA pity. Gift shops, their owners and families depend on you buying a small cuckoo clock or plate featuring a bloke in lederhosen blowing an alpenhorn and emblazoned “Andenken aus Deutschland”.\n16. Sorry, but we don’t do lying-about-on-the-beach holidays\nYes, we get it; you’re way too cultivated for that, way too clever to relax with a book and your family and a glass of rosé and maybe some friends and maybe also a leisurely dip and laughter and a chance to educate the kids (“How do crabs have babies?” “Sideways”) and the sort of relaxation you always say you hanker for, don’t have time at home. Why waste time doing all that, when there’s a neo-Gothic chapel to explore?", "source_domain": "www.telegraph.co.uk", "title": "The 16 most annoying middle-class opinions about holidays", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/travel/comment/most-annoying-middle-class-opinions-about-holidays/", "id": "f6840ddeaa3de017cdc0559240602c55e85351ee7093672a84e77c72b4da755f"}
{"authors": ["Emma Boyle", "Emma Boyle"], "date_download": "2025-08-05 14:21:38+00:00", "date_modify": null, "date_publish": "2025-08-03 18:00:00", "description": "From its golden southern shores to the wild eastern surf breaks, these are the best beaches in Sri Lanka", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Ftravel%2Fdestinations%2Fasia%2Fsri-lanka%2Fbest-beaches-sri-lanka%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/travel/2025/07/25/TELEMMGLPICT000433287555_17534400844780_trans_NvBQzQNjv4BqFNg083D4dwMls34BZ1qmE6lBzupbaJsNVwfPhKpOn6U.jpeg?impolicy=OG-Standard", "language": "en", "localpath": null, "maintext": "Wild Indian Ocean-washed beaches define Sri Lanka’s 830-mile coastline. Southern beaches tend to be livelier and more surf-oriented, backed by vibrant restaurants and bars; meanwhile, the butter-coloured beaches of the less developed central and north-east coasts exude calm.\nThe beaches in Sri Lanka wax and wane seasonally, particularly on the south-west coast during unsettled monsoon months, when sea currents strengthen and change. Very few beaches have lifeguards, so you must always be vigilant by the water’s edge. Endangered marine turtles come ashore throughout the year to nest, and many coastal stretches are wildlife hotspots.\nAll our recommendations below have been hand-selected and tested by our resident destination expert to help you discover the best beaches in Sri Lanka. Find out more below, or for more Sri Lanka inspiration, see our guides to the best hotels, restaurants, bars and things to do.\nFind beaches by area:\nWest coast\nSouth coast\nEast coast\nWest coast\nVentura Beach, Bentota\nBentota is a well-established family-friendly resort town on the west coast, with large hotels (some of which have lifeguard lookouts), soft champagne-coloured sand, blushing sunsets and an adjacent river for windsurfing, jet-skiing and boat rides into mangrove caves. The majority of the restaurants and bars in the area are hotel-based.\nInsider tip: Boutique hotel The Villa Bentota by KK Collection is positioned on Bentota’s quieter, southern shore.\nHow to get there: There are trains to Bentota or the nearby Ahangama station.\nSawukku Beach, Alankuda\nNorthwesterly Kalpitiya is an arid 20-mile-long peninsula flanked by the vast Puttalam Lagoon. Around mid-way up is Alankuda’s unspoilt, under-the-radar, fir-fringed Sawukku beach, dotted with low-key eco resorts. In winter, you can swim, snorkel and kayak; in summer, the offshore wind creates the perfect conditions for kite surfing.\nInsider tip: Book kayaks, paddleboards and dolphin-watching trips from Bar Reef Resort.\nHow to get there: It’s a three-hour drive from Bandaranaike International Airport.\nReturn to index\nSouth coast\nKabalana Beach\nKabalana is part of the south coast’s fast-growing surf scene. Between late November and April, this 500-metre-long sandy bay, backed by guesthouses and boutique hotels (including The Sandhya and Mosvold Villa), attracts surfers to its two main breaks and bodyboarders to its sandy shallows. Sunsets are epic, and there are a variety of restaurants nearby.\nInsider tip: Book high-quality surfboards in advance from The Board Shop, a travelling rental company currently based in the neighbouring town Ahanghama.\nHow to get there: The beach is next to the main Galle-Matara road.\nWeligama Beach\nWeligama’s deep bay is synonymous with southern surfing as the rolling sandy-bottomed breaks are gentle for those looking to learn. Little shacks offering boards for hire and lessons line a strip between the beach and main road, alongside open-air fish markets and catamarans. The water is calmer further west, beyond Taprobane Island.\nInsider tip: Take a tuk tuk (five minutes’ drive) to secluded Jungle Beach (or Walliwala), a lovely quiet cove for seasonal paddling below the luxury hotel Cape Weligama.\nHow to get there: It’s right by the Galle Road, and there’s a train station in Weligama.\nMawella Beach\nMawella’s one-and-a-half-mile-long sandy beach is secreted well away from the busy southern coastal road and has seen mercifully little development. Private villas and small boutique hotels, like The Last House, share this hallowed space with fisherfolk and nesting marine turtles. There are rolling waves (fun for bodyboarding), but you can usually swim year-round.\nInsider tip: Rent kayaks, bodyboards and paddleboards from Halcyon Mawella\nHow to get there: It’s five miles from Tangalle, and the closest train station is Beliatta.\nHiriketiya Beach\nHiriketiya’s sandy beach curves deeply between two prominent headlands near the southern fishing town of Tangalle, and is a favourite with surf-loving digital nomads. It’s a popular (often busy) yet easygoing year-round swimming spot, known for its two surf breaks, profusion of boho-chic coffee shops, vegan cafes, guesthouses and yoga studios.\nInsider tip: Watch the surfing action unfold from sunset-facing cocktail bar Raa.\nHow to get there: Turn off at Dodampahala Junction, between Dickwella and Tangalle.\nDalawella\nThe translucent lagoon protected by an offshore reef in front of Wijeya Beach restaurant is a rare seasonal swimming spot popular with paddlers, with the bonus of resident green turtles and sunsets silhouetted by “The Frog Rock”. It’s very popular, though the beach slims significantly during the summer months.\nInsider tip: Wijeya Beach is an iconic spot for wood-fired pizzas and sundowners.\nHow to get there: It’s less than two miles southeast of Unawatuna.\nReturn to index.\nEast coast\nKalkudah Beach\nKarpaha Sands is just one of two high-end places to stay along this staggeringly pristine 11-mile beach with swimming on Sri Lanka’s quieter east coast, far from the main road, beyond palm and cashew nut plantations. It’s pin-drop peaceful and totally secluded.\nInsider tip: Watch the daily ritual of “madella” fishing, where giant nets are cast into the sea every morning and pulled out later by a cooperative of sarong-clad fishermen.\nHow to get there: It’s complicated! Take a tuk tuk (10 minutes) from nearby Pasikuda.\nPasikuda Beach\nPowdery blonde sand, azure water and very calm waves make this crescent-shaped east coast beach one of Sri Lanka’s finest and best for swimming. Families are drawn to the large resorts lining the bay, including Uga Bay, and the variety of water-focused activities, such as jet skiing, water skiing, banana boating, kayaking, paddleboarding and sunset sailing trips.\nInsider tip: Get your snorkelling fix at nearby Kayankerni Marine Sanctuary.\nHow to get there: It’s a 45-minute drive north of Batticaloa’s domestic airport.\nNilaveli\nYou can wade out for a good 50 metres through the calm, clear water from the sandy shore of this laid-back north-easterly beach near Trincomalee, where roaming cows are often seen plodding along the sand. In the distance lies the silhouette of snorkelling hotspot Pigeon Island, a protected marine park.\nInsider tip: Book whale watching or sunset sails through Sail Lanka Charter.\nHow to get there: Nilaveli is a 25-minute drive north of Trincomalee.\nArugam Bay\nSurfers love rugged “A Bay” for its peeling right-handers, consistent swell and lively party scene, yet it’s still a fishing village at heart – catamarans line the palm-fringed beach while fishermen wrapped in sarongs mend nets under the hot tropical sun. Hostels and guesthouses abound (one standout is Hideaway), and the dining scene is increasingly varied.\nInsider tip: Rent boards or organise surf lessons from Mambo’s Surf School.\nHow to get there: It’s south of Pottuvil, and the beach runs parallel to the main road.\nReturn to index\nHow we choose\nEvery beach in this curated list has been expertly chosen by our destination expert, to provide you with their insider perspective. We cover a range of areas and styles, from popular city beaches to lesser-known corners, to best suit every type of traveller. We update this list regularly to keep up with the latest openings and provide up-to-date recommendations.\nBack to top\nAbout our expert\nEmma Boyle\nA holiday to Sri Lanka turned into an epic 16-year adventure in the country, during which I developed a love for leopard-spotting, coconutty curries and single estate teas.", "source_domain": "www.telegraph.co.uk", "title": "The best beaches in Sri Lanka", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/travel/destinations/asia/sri-lanka/best-beaches-sri-lanka/", "id": "e822089050dee3aecaf177992eb58851cb34aec729dc70de48862b3c16b35959"}
{"authors": ["Cameron Henderson"], "date_download": "2025-08-05 14:22:41+00:00", "date_modify": null, "date_publish": "2025-08-04 22:06:00", "description": "Ahmed Mohamed arrested by ICE agents in San Diego after three-day manhunt", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fus%2Fnews%2F2025%2F08%2F04%2Fbritish-man-smuggled-out-ice-centre-left-wing-activists%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/en-us/news/2025/08/04/TELEMMGLPICT000434704786_17543404636800_trans_NvBQzQNjv4BqtiGzPmo9lKvqmGUfYJkG_-mWuXKZpdv8ChEswL5MeYM.jpeg?impolicy=OG-Standard", "language": "en", "localpath": null, "maintext": "A British man accused of being in the US illegally broke out of a migrant detention centre with the help of Left-wing activists.\nAhmed Mohamed escaped from Immigration and Customs Enforcement (ICE) custody on Tuesday while being transferred to an immigrant detention centre in California.\nMohamed, who has been charged with narcotics and weapons offences, was shackled and being frogmarched to an ICE facility in downtown Los Angeles when a masked man, understood to be a pro-immigration protester, helped him to escape while guards were distracted, Homeland Security sources told The New York Post.\nThe suspect was then loaded into a waiting van and made his getaway with the help of other protesters, according to ICE.\nAfter a three-day manhunt, Mohamed was tracked down and “swiftly arrested” on Friday by ICE agents in San Diego, who shared a social media post of the suspect.\n“You can run from the law but you cannot hide,” the post read.\n“After escaping ICE custody with the help of pro-illegal alien activists, Ahmed Mohamed of the UK was swiftly apprehended and placed back into ICE custody.\n“On top of his charges and convictions for narcotics and weapons possession, he will now be charged with escaping from confinement.”\nMohamed ‘reunited with handcuffs’\nThe agency signed off by thanking San Diego ICE staff for “reuniting Ahmed with his handcuffs”.\nThe detention centre was targeted by anti-ICE protesters in June, when rioters threw rocks at police and blocked off major roads in an attempt to push back against Donald Trump’s deportation programme.\nMr Trump responded by deploying 2,000 members of the National Guard and 700 marines to quell the protests, with Karen Bass, the LA mayor, accusing the president of acting like a bully.\nThe administration’s show of force sparked fury from Gavin Newsom, the state’s Democratic governor, who warned that “Democracy is under assault before our eyes”.\nMohamed is the latest British citizen to be detained by ICE agents, after Orlando Duncan Da Silva Bain, 19, was arrested in New York in May.\nOn entering the US, Da Silva Bain allegedly failed to declare his UK criminal record, which included child sex offences, according to ICE.", "source_domain": "www.telegraph.co.uk", "title": "British man smuggled out of LA ICE centre by Left-wing activists", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/us/news/2025/08/04/british-man-smuggled-out-ice-centre-left-wing-activists/", "id": "f2192a1002adf591ddaeeb4df71c604d55e53f7b4eb6ce1da73a1fc79252c30d"}
{"authors": ["Cameron Henderson"], "date_download": "2025-08-05 14:22:47+00:00", "date_modify": null, "date_publish": "2025-08-04 06:00:00", "description": "Convicts in minimum-security jail angered by transfer of Jeffrey Epstein’s former girlfriend", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fus%2Fnews%2F2025%2F08%2F04%2Fghislaine-maxwell-prison-inmates-sex-trafficker%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/en-us/news/2025/08/03/TELEMMGLPICT000433792404_17542519734220_trans_NvBQzQNjv4Bq6vW2WNL2uXZGnnlES5blebc_02QokmPMl3eLabfstKk.jpeg?impolicy=OG-Standard", "language": "en", "localpath": null, "maintext": "Ghislaine’s Maxwell’s arrival at a minimum-security prison in Texas has provoked anger among her fellow inmates.\nA prisoner at Federal Prison Camp (FPC) Bryan told The Telegraph she was “disgusted” by Maxwell’s transfer and that her feelings were widely shared by other inmates at the facility.\nMaxwell, the British socialite and former girlfriend of Jeffrey Epstein, was quietly moved to the prison camp 100 miles outside Houston, Texas, this week from a stricter low-security prison in Tallahassee, Florida.\nHer new prison mostly houses inmates convicted of “white-collar” crimes and low-level offences, and they are said to be angry that Maxwell is being held among them.\nMaxwell is serving a 20-year sentence for procuring underage girls for the late financier and convicted paedophile, who took his own life in prison in 2019.\nJulie Howell, 44, who is serving a one-year sentence for theft, told The Telegraph that “every inmate I’ve heard from is upset she’s here”.\n“This facility is supposed to house non-violent offenders,” she added. “Human trafficking is a violent crime.”\nInmates at minimum-security institutions, also known as FPCs, benefit from low prison guard-to-inmate ratio and limited-to-no perimeter fencing.\nIt is the same prison facility where Elizabeth Holmes, the founder of Theranos, a fraudulent blood-testing company, is serving an 11-year sentence.\nIt also allows inmates to play with puppies as part of a scheme to train dogs to become service animals.\nUpon Maxwell’s arrival at the facility, prisoners were allegedly locked down and had the blinds shut in an apparent effort to shield her from view.\nThe transfer comes a week after she was interviewed by Todd Blanche, Donald Trump’s deputy attorney general, leading to intense speculation that some sort of deal has been cut.\nMr Trump has come under pressure in recent weeks to release all information related to Epstein, after the Department of Justice and FBI concluded that he died by suicide and did not possess a “client list”.\nDuring a nine-hour interrogation with Mr Blanche, Maxwell was allegedly grilled about Epstein’s connections to Bill Clinton, the Duke of York and Bill Gates, as well several other billionaires, according to the Daily Mail.\nMaxwell’s legal team have said she is willing to testify before Congress in exchange for a presidential pardon or having her sentence commuted – a possibility Mr Trump has not ruled out.\nInmates at FPC Bryan are worried about their own safety, given the widespread threats against Maxwell and lack of tight security on the prison grounds.\nHowell said: “We have heard there are threats against her life and many of us are worried about our own safety because she’s here.”\nHer comments will only fuel concern that could be targeted at the facility, preventing her testimony about Epstein from ever seeing the light of day.\nMaxwell was allegedly moved under the cover of darkness because she had been “bombarded” with death threats from r apists who accused her of being a “snitch”, according to the Mail on Sunday.\nA source told the newspaper: “As soon as Ghislaine spoke to the government she was considered a snitch by other inmates at Tallahassee. There were very real and very credible threats on her life.\n“There were real fears inside Tallahassee that they could not guarantee her safety, which is why she was moved.”\nMaxwell ‘could be a flight risk’\nHowell, who self-surrendered in July to serve her sentence at FPC Bryan, has a daughter who was trafficked as a teenager.\nIn an email sent from prison about Maxwell’s transfer, she wrote: “I am honestly shocked she was moved to a federal prison camp with her history and charges.”\nThe married mother-of-four said that her daughter was repeatedly trafficked from the age of 17, leading to her being “beaten, choked and eventually shot”.\nHer daughter also allegedly became pregnant as a result and Howell said she has since adopted the child.\nThe former professor, who worked in children’s education for 22 years, said she helped the FBI and local law enforcement agencies track down the perpetrators, who are now serving federal prison sentences of more than 20 years.\n“That incident changed the trajectory of my daughter’s life, as well as mine,” she said.\nHowell said that the circumstances surrounding her daughter being shot provoked her mental health spiral and addiction to gambling, which she funded by resorting to theft.\nIn January, she pleaded guilty to stealing almost $1m from Tarleton State University, her former employer, between 2022 and 2024. She was sentenced to one year in prison in June.\nHowell said: “I don’t blame anyone else for the actions that brought me to FPC Bryan, but I can definitely say that the circumstances that surrounded my daughter being shot were what sparked my spiral and addiction to gambling to escape my reality.\n“Having Ms Maxwell here triggered all of those feelings.”\nHowell also warned that Maxwell could be a flight risk, given her previous efforts to avoid detection prior to her arrest.\nShe said: “This is a camp you can literally walk out of. I don’t care how many people she turns in, it doesn’t take away from her actions.\n“As a mother of a sex-trafficking victim, I’m absolutely disgusted she’s in this facility. Regardless of her reasoning, I don’t think she belongs here.”", "source_domain": "www.telegraph.co.uk", "title": "We don’t want ‘disgusting’ sex traffickers in our prison", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/us/news/2025/08/04/ghislaine-maxwell-prison-inmates-sex-trafficker/", "id": "accf1d43158ad7484099acf4a6c78788b1803ba823baffbf8a59fcd7b022c9cc"}
{"authors": ["US Staff"], "date_download": "2025-08-05 14:23:07+00:00", "date_modify": null, "date_publish": "2025-08-04 21:03:00", "description": "State Department to trial programme requiring certain visitors to pay holding bond to enter country", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fus%2Fnews%2F2025%2F08%2F04%2Ftourists-pay-money-enter-us-how-much%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/en-us/news/2025/08/04/TELEMMGLPICT000434710504_17543371731070_trans_NvBQzQNjv4BqA7N2CxnJWnYI3tCbVBgu9T0aesusvN1TE7a0ddd_esI.jpeg?impolicy=OG-Standard", "language": "en", "localpath": null, "maintext": "Tourists and people visiting the US for business could have to pay up to $15,000 to enter the country under new proposals put forward by Donald Trump’s government.\nThe State Department announced it its launching a 12-month pilot programme under which people from countries deemed to have high overstay rates and deficient internal document security controls could be required to post bonds when applying for a visa.\nThe price range of the bonds will vary between $5,000 (£3,700), $10,000 (£7,500) or $15,000 (£11,300).\nA preview of the bond notice, posted on the federal register website on Monday, said the pilot program would take effect within 15 days of its formal publication.\nThe department said it would be necessary to ensure that the US government is not financially liable if a visitor does not comply with the terms of his or her visa.\n“Aliens applying for visas as temporary visitors for business or pleasure and who are nationals of countries identified by the department as having high visa overstay rates, where screening and vetting information is deemed deficient, or offering citizenship by investment, if the alien obtained citizenship with no residency requirement, may be subject to the pilot program,” the notice said.\nThe countries affected will be listed once the program takes effect, it said. The bond could be waived depending on an applicant’s individual circumstances.\nThe bond would not apply to citizens of countries enrolled in the Visa Waiver Program, which enables travel for business or tourism for up to 90 days.\nThe majority of the 42 countries enrolled in the program are in Europe, with others in Asia, the Middle East and elsewhere.\nVisa bonds have been proposed in the past but have never been implemented.\nThe State Department has traditionally discouraged the requirement because of the cumbersome process of posting and discharging a bond.\nThe Trump administration is tightening requirements for visa applicants. Last week, the State Department announced that some visa renewal applicants would have to undergo an additional in-person interview, something that was not previously required.\nIn addition, the department is proposing that applicants for the Visa Diversity Lottery program have valid passports from their country of citizenship.", "source_domain": "www.telegraph.co.uk", "title": "Tourists could have to pay $15k deposit to holiday in US", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/us/news/2025/08/04/tourists-pay-money-enter-us-how-much/", "id": "4b56715cf8edad8eeb8ebec1615e7a51061758a810e86db6afed4db71060ac82"}
{"authors": ["Cameron Henderson"], "date_download": "2025-08-05 14:23:13+00:00", "date_modify": null, "date_publish": "2025-08-04 21:38:00", "description": "Strain on materials exposes how reliant the Unites States is on Chinese exports for its weapons supply chain", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fus%2Fnews%2F2025%2F08%2F04%2Fus-defence-firms-scrambling-rare-earth-minerals-chian-block%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/en-us/news/2025/08/04/TELEMMGLPICT000434696443_17543373278500_trans_NvBQzQNjv4Bq-yKXUOr_MwQ_nCnkwkIf1P4Xpit_DMGvdp2n7FDd82k.jpeg?impolicy=OG-Standard", "language": "en", "localpath": null, "maintext": "The US is scrambling to get hold of the rare earth metals needed to make weapons after China slashed its supply to American defence firms.\nPrices of some rare earths have increased more than 60-fold after Beijing restricted the export of the materials for defence purposes earlier this year, amid a trade war with the US.\nBeijing controls around 90 per cent of the world’s rare metal supply and dominates the production of many other critical minerals, giving the country a “stranglehold” on the US defence industrial base, experts said.\nA senior defence industry source told The Telegraph the “light is turning from yellow to red” when it comes to American companies’ ability to source the materials, that are needed for everything from fighter jets and drones, to missile-targeting and defensive satellites.\nThe strain on rare earths has exposed how reliant the US is on Chinese exports for its defence supply chain, giving Beijing leverage at a time of fraught trade discussions between the two rival powers.\nA spokesman for the China select committee labelled the situation a “wake-up call” that “underscores just how dangerous our current dependencies are”.\n“The United States cannot afford to have defence supply chains at the mercy of the Chinese Communist Party,” they said. “Congress and the administration must now urgently work together to identify and mitigate these vulnerabilities before they cost American lives.”\n‘No quick and easy fix’\nMichal Sobolick, a senior fellow specialising in United States–China relations at Hudson Institute, said: “We’ve traded with this authoritarian, Marxist regime and they now have a stranglehold on our ability to make fighter jets.\n“That’s dangerous and there is no quick and easy fix for this.”\nIn addition to restrictions on rare earths, since December China has banned exports to the US of germanium, gallium and antimony, which are critical minerals used in the making of bullets and night vision goggles.\nSome companies have warned of imminent cuts to production unless fresh supplies of minerals arrive soon.\nOn Wednesday, the chief executive of US-based Leonardo DRS said the firm has been forced to tap into its “safety stock” of germanium.\n“In order to sustain timely product deliveries, material flow must improve in the second half [of 2025],” Bill Lynn said on a conference call, according to The Wall Street Journal (WSJ).\nThe mineral is used in infrared sensors that guide missiles and other equipment.\nTwo-month delivery delays\nDrone manufacturers are said to be among the most exposed defence firms as they are often small businesses that do not have the kind of stockpiles of rare earths that larger companies do.\n“I can tell you…we talk about this daily and our companies talk about it daily,” Dak Hardwick, the vice-president of international affairs at the Aerospace Industries Association trade group, told the WSJ.\nSince China introduced export licences for rare earths in April, defence firms have been required to fill out extensive paperwork, including providing sensitive information such as product images, to ensure the material is not used for military purposes, Western buyers told the WSJ.\nThis has led to delivery delays of up to two months, with one drone manufacturing company reporting that its Chinese magnet supplier had demanded drawings of products, a list of buyers and assurances they would not be used for military applications.\n“Of course we are not going to provide the Chinese government with that information,” Chris Thompson, the vice-president of global sales for ePropelled, told the Journal.\nThe company builds motors for drones used in the Ukraine conflict.\nDoD boosting production of minerals\nMetal importers told the WSJ that Beijing’s demands to know what rare earths are being used means that licences are not being approved for traders to stockpile supplies.\nThe department of defence has moved “at warp speed” in recent months to boost production of critical minerals, according to Dr Gracelin Baskaran, the director of the critical minerals security programme at the Centre for Strategic and International Studies\nThis included a $400m investment earlier this month in MP Materials, which operates the largest rare earth mine in the Americas. As part of the deal, the company plans to scale its annual magnet manufacturing capacity from 1,000 metric tons in 2025 to 10,000 metric tons over the next decade.\nLast year, the Pentagon also set up the Critical Minerals Forum, which helps metal miners secure funding for rare earth extraction and enables larger defence firms to purchase the materials directly rather than relying on smaller subsidiaries.\n“The modern age is powered by rare earth elements, and if we don’t move aggressively to solve this problem, we are always going to be playing catchup,” an industry source said.\nMr Sobolick warned that the US has “sleepwalked into this situation” and that China’s dominance of the rare metals supply chain will give them the upper hand in trade negotiations over the next few years.", "source_domain": "www.telegraph.co.uk", "title": "US defence firms scrambling for rare earth minerals after China blocks exports", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/us/news/2025/08/04/us-defence-firms-scrambling-rare-earth-minerals-chian-block/", "id": "93658a92039bd84cff61ea6fa8096bdc74fbba6bdd815e7c644f6a0b6c5ed331"}
{"authors": ["Benedict Smith", "Rob Crilly"], "date_download": "2025-08-05 14:23:27+00:00", "date_modify": null, "date_publish": "2025-08-05 00:23:00", "description": "The US has announced plans to outpace China and Russia in the space race", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fus%2Fnews%2F2025%2F08%2F05%2Fusa-build-nuclear-reactor-on-the-moon%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/en-us/news/2025/08/05/TELEMMGLPICT000434731008_17543722171160_trans_NvBQzQNjv4Bqscmf5WPqnJx-243pw-A8vikUtV4MjwivLP9rwjOS1Ds.jpeg?impolicy=OG-Standard", "language": "en", "localpath": null, "maintext": "The US is planning to build a nuclear reactor on the Moon as it seeks to push ahead in the space race.\nSean Duffy, the new Nasa head, is preparing to announce plans to install a small reactor on the moon to allow astronauts to undertake lengthy missions on the lunar surface and pave the way for future Mars expeditions.\nA directive from the space agency, seen by The Telegraph, argues that a reactor is necessary to stop rival superpowers effectively colonising the Moon and establishing US “keep-out” zones.\nChina and Russia previously announced a joint effort to put a reactor on the Moon by the mid-2030s, it notes.\n“The first country to do so could potentially declare a keep-out zone which would significantly inhibit the United States from establishing a planned Artemis presence if not there first,” the directive says, referring to existing plans to explore the Moon and prepare for missions to Mars.\nNasa needs to “move quickly” to “support a future lunar economy” and “strengthen our national security in space”, it adds.\nSolar panels are ineffective because nights on the Moon last the equivalent of two weeks on Earth.\nA Nasa official said: “If we are going to have a habitable system on the Moon then we have to bring power.”\nHe said small reactors were already in use on submarines and aircraft carriers. “They solve the problem,” he added.\nMr Duffy, who is also the US transport secretary, has directed Nasa to seek industry proposals for a minimum 100 kilowatt reactor to launch by 2030.\nThe agency had already been working on a 40-kilowatt reactor to use on the moon by the early part of the next decade.\nMr Duffy was named interim head of Nasa after Donald Trump abruptly withdrew the nomination of Jared Isaacman, a tech billionaire and commercial astronaut.\nThe move deepened a rift between Mr Trump and Elon Musk, the SpaceX billionaire and until that point one of the president’s closest political allies.\nMr Musk, who had pushed for Mr Isaacman to be named to the top job, wrote on social media in May: “It is rare to find someone so competent and good hearted”.", "source_domain": "www.telegraph.co.uk", "title": "Trump orders nuclear reactor to be built on moon", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/us/news/2025/08/05/usa-build-nuclear-reactor-on-the-moon/", "id": "4cdbd5fe5401a705688b2c7f84be1f705b370cfcdd0605b145d2be1ab1752752"}
{"authors": ["Cameron Henderson"], "date_download": "2025-08-05 14:23:33+00:00", "date_modify": null, "date_publish": "2025-08-04 17:18:00", "description": "Controversial Republican representative launches campaign for South Carolina governor", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fus%2Fpolitics%2F2025%2F08%2F01%2Fnancy-mace-maga-darling-turned-lgbt-ally-transphobe%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/en-us/politics/2025/08/04/TELEMMGLPICT000434698758_17543234665630_trans_NvBQzQNjv4BqvByHLito6I30927tdzU6ac-tqtiXw_O_hV1g9CYoVbc.jpeg?impolicy=OG-Standard", "language": "en", "localpath": null, "maintext": "As far as political makeovers go, few have been as drastic as that of Representative Nancy Mace.\nA former transgender rights advocate, the Republican lawmaker once called out colleagues for racism and feuded with Donald Trump after blaming him for the Jan 6 Capitol riot.\nBut over the past year, Ms Mace has rebranded herself as an anti-woke crusader.\nShe spearheaded a bathroom ban against the first transgender member of Congress, repeatedly referred to transgender people using the slur “trannies”, launched a bid to become the next South Carolina governor, on a platform to stop the state from going “woke”.\nIn a speech kicking off her campaign, she said the state is “tired of politicians who smile for the cameras, lie to your face, and then vanish when it’s time to lead”.\n“I’m not one of them,” she added. “I’m running for governor because South Carolina doesn’t need another empty suit. It needs a governor who will fight for you and your values.”\nA flurry of sharp-tongued Fox News appearances, combined with regular clips of her more controversial statements going viral, have transformed Ms Mace into one of the most recognisable congresswomen of Mr Trump’s second term, sparking outrage and admiration in equal measure across the aisle.\nYet one former adviser warned that her metamorphosis may be exposed under the pressures of a gubernatorial campaign.\nBrendan Donehue, a South Carolina-based political strategist who fired Ms Mace as a client, said: “As soon as South Carolina voters realise that her record does not match her rhetoric, she’s going to be plummeting in the polls.”\nSydney Long, Ms Mace’s press secretary, said: “The reason Nancy Mace is leading the governor’s race this early is voters know she stands with them, not political insiders afraid of losing their grip on power.”\nThe South Carolina representative made headlines in November last year when she introduced a bill to ban transgender people from using women’s bathrooms in Congress.\nAsked by reporters if the bill was designed to target Sarah McBride, the Delaware representative who became the first transgender person elected to Congress, Ms Mace did not mince her words: “Yes…and then some.”\nIn the days after filing the bill, she capitalised on the attention by posting about bathrooms more than 300 times on X, including a clip in which she held up a sign saying “biological” outside a women’s lavatory on Capitol Hill.\nThe bill sparked outrage among Democrats, who accused her of bullying Ms McBride, encouraged former staff members to denounce her, and triggered protests, with Ms Mace later pictured wearing a sling after she claimed to have been assaulted by a trans rights campaigner.\nUnabashed, Ms Mace doubled down on her stance, repeatedly referring to transgender people as “trannies” – including at a congressional hearing – in an unapologetic effort to stoke controversy, and on Thursday reshared an image of herself superimposed with the caption: “Most prominent transphobe in American politics.”\n“We approve of this message,” she wrote. “Your mental illness is not our reality.”\nThe bathroom campaign has positioned her at the centre of the Trump administration’s wholesale crackdown on so-called “gender ideology extremism”, helping to cultivate an image of her as a straight-talking new darling of the Right.\nYet it marks a sharp departure from her past position, having told the Washington Examiner in 2021: “I strongly support LGBTQ rights and equality,” adding: “No one should be discriminated against.”\nIt is not the only issue on which Ms Mace has changed her views.\nHaving briefly served in the state House, in 2020 she became the first Republican woman elected to represent South Carolina in Congress, flipping the 1st District after a single term with a Democratic representative.\nAs a single mother who was unafraid to speak her mind, she seemed exactly like the sort of tough-talking Republican who could lead the GOP beyond Mr Trump.\nIndeed, she urged lawmakers to “hold the president accountable” for the Jan 6 Capitol riot and said Mr Trump’s legacy had been “wiped out”.\nHer harsh words drew the ire of the president, who called Ms Mace “an absolutely terrible candidate” who has been “disloyal” to the Republican Party and endorsed her primary challenger when she ran for re-election in 2022.\nBut as the party embraced its former leader ahead of the 2024 election, so too did Ms Mace, who endorsed him in January last year, writing on X that it had been a “complete s— show since he left the White House”.\nMs Mace also earned admiration after speaking up about the sexual abuse she had been subjected to, experiences which she says inform her view on women’s only spaces.\nAfter being raped as a teenager, Ms Mace dropped out of high school and worked at Waffle House while studying for her diploma.\nShe went on to become the first woman to graduate from the Citadel, a prestigious military academy.\nIn February, in a harrowing hour-long speech on the House floor, she accused her ex-fiance, Patrick Bryant, and his business associates of raping her and other incapacitated women.\nShe also claimed to have found non-consensual pictures and videos of herself and other women naked and engaged in sex acts.\nThe blame for failing to imprison Mr Bryant, she said, lay with South Carolina’s top prosecutor, Alan Wilson, who allegedly slow-walked any investigation into the men after she presented him with evidence.\nMr Bryant denied the allegations in a comment to AP, while Mr Wilson’s office labelled Ms Mace’s claims “categorically false” and said it had not received “any reports or requests for assistance” regarding the case.\nIn a strange twist, Mr Wilson will be Ms Mace’s primary opponent in the gubernatorial race.\nA recent poll showed Ms Mace leading the pack with 16 per cent of support among Republican voters before entering the contest.\nThat puts her one point ahead of Mr Wilson, with Lieutenant governor Pamela Evette, House representative Ralph Norman and State Senator Josh Krimbell sweeping up the remaining votes.\nPrior to launching her campaign, Ms Mace had already declared it a “two-man race” and engaged in some pre-emptive bashing of her key rival.\n“This is a two-man race, if I get in, between me and Alan Wilson, the South Carolina attorney general, who likes to put paedophiles on trial and give them one day in jail serve,” she said.\nMs Mace may be the most recognisable face in the race, but Mr Donehue said that the contest remains wide open with more than a year to go until election day.\nThat length of time, he predicted, will give voters a chance to decide which of Ms Mace’s personas they believe.", "source_domain": "www.telegraph.co.uk", "title": "Nancy Mace: The Maga darling who turned from LGBT ally to proud ‘transphobe’", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/us/politics/2025/08/01/nancy-mace-maga-darling-turned-lgbt-ally-transphobe/", "id": "aa8863063b418ef99cc2f7b232bc77bc782b0bda8a50f815fc50d1dc90c900ed"}
{"authors": ["Nick Heath"], "date_download": "2025-08-05 14:23:53+00:00", "date_modify": null, "date_publish": "2025-08-05 08:00:00", "description": "Find out how the Telegraph Media Group Honda Rugby Legacy Fund empowers UK women's and girls' rugby clubs to overcome challenges and build a thriving future for the sport.", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fwomens-sport%2Fpowering-england-rugby%2Fbristol-hampstead-harlow%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/eip/honda/bristol-hampstead-harlow/l-to-r-harlow-hampstead-bristol-credit-jude-edginton.jpg", "language": "en", "localpath": null, "maintext": "In a patch of floodlit grass behind a community centre in south Bristol, 80 girls squeeze into a training session designed for half that number. A few hundred miles away in north London, a women’s team with no clubhouse meets on borrowed ground. In Essex, a rugby club battles football for visibility. The circumstances differ, but the message is the same – women’s rugby is growing and the game must make space for it.\nAcross England, rugby clubs are transforming how women and girls access the game, and not just by forming teams, but by rethinking space, visibility and community.\nThe recipients of the Telegraph Media Group Honda Rugby Legacy Fund are showing what this sort of progress looks like from the grassroots up. And the Telegraph Media Group/Honda partnership brought 15 of their prize-fund winners together one fine summer’s day to celebrate and share their stories.\nThe three featured here – from south Bristol, north London and Essex – are proving that when space is made, both physically and socially, women and girls rush to fill it.\nBreaking barriers in Bristol\nFounded in 2022 with just 12 players, South Bristol Girls has grown as the city’s sole girls-only rugby club. With increased numbers expected next season, the demand is high, but space is not.\n“Our challenge is around the number of girls we’ve got,” says head coach Luke Summerfield. “We have fairly limited facilities at our club at the moment. We’re very restricted, especially in the winter months, in terms of the space to be able to train in. At the moment it’s in a very compact area, but we’re expecting 80 girls next season so we need to expand the training area. Buying mobile floodlights would really help.”\nThe club also relies on external support to meet basic needs. “Many of our girls rely on local charities to afford the basics – kit, boots and transport.”\nTheir £1,000 award will help them provide mobile floodlighting and essential kit support – a change Summerfield hopes will extend their reach. “Hopefully, the publicity from having been part of this celebration event will be great to show to the local community, and hopefully draw some new girls into the club as well,” he says.\nUnity without walls in north London\nHampstead Women’s Plus, founded more than 20 years ago, doesn’t have its own clubhouse or training ground, but what it lacks in facilities it makes up for in camaraderie and commitment.\n“I think in terms of those here today, we might be the only rugby club that doesn’t actually have a clubhouse,” says Maggie Simpson, one of the club’s players. “So we have a challenge of bringing our community into one place.”\nStill, she sees opportunity in that challenge. “We are not tied to a clubhouse, but we can do lots of other things, lots of other events.”\nThe club will use its £1,000 grant to revive a once-thriving girls’ section. “We had a girls’ team that was quite strong pre-Covid. Post-Covid some of the girls were getting older and going to university and we didn’t have the younger girls coming through,” says Simpson. “What we want to do with the fund is to grow our girls team again – help with marketing, going into schools, getting more girls who don’t have a rugby club already, getting them involved.”\nFellow player Ellie Sneesby, who is also the club’s sponsorship officer, says she is passionate about what rugby offers: “Rugby has transformed my life, because it’s given me a whole new group of friends. I’m incredibly active now and I just think that rugby is for every woman and everybody. An older girl can play and a small girl can play and it really is a sport for every single person.”\nReframing rugby in Essex\nIn Harlow, where it’s football that dominates the local sports scene, Harlow Ladies is using its £3,000 grant to widen the rugby tent.\n“We have a lot of clubs in the local area that we can link up with, and we support each other,” says club captain Emma Warr. “However, there is room for growth – not only increasing the number of players that we have across the girls section, the women’s section, but also growing the footprint we have in women’s coaching, refereeing and officiating.”\nThe club will invest in coaching and referee development, as well as a player support fund for essentials such as boots and scrum caps.\n“Rugby means community to me,” Warr said. “My rugby team is a family, sometimes dysfunctional, but we all support each other.\n“If you’re struggling at training, if you’re struggling in a game, they’ll pick you up. If you’re struggling in life, they’ll pick you up as well.”\nAcross these three clubs it is clear that rugby is effective as a vehicle for belonging, empowerment and growth. Whether it’s the sole girls-only set-up in Bristol, a nomadic north London side or an Essex team redefining access, these clubs are shaping the future of the game – one determined player at a time.", "source_domain": "www.telegraph.co.uk", "title": "Rethinking grassroots women's rugby UK", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/womens-sport/powering-england-rugby/bristol-hampstead-harlow/", "id": "be8b2788dfdcc3bcbfff0a5eecbd588e12911e7d990736c6acedb7728f76cf21"}
{"authors": ["Nick Heath"], "date_download": "2025-08-05 14:24:01+00:00", "date_modify": null, "date_publish": "2025-08-05 13:20:00", "description": "The Rugby Legacy Fund is helping to transform rugby facilities, ensuring women and girls feel they belong. Learn about Tetbury, Ivybridge and Torquay's progress.", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fwomens-sport%2Fpowering-england-rugby%2Ftetbury-ivybridge-torquay%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/eip/honda/tetbury-ivybridge-torquay/l-to-r-torquay-ivybridge-tetbury-credit-jude-edginton.jpg", "language": "en", "localpath": null, "maintext": "There is plenty to celebrate with the growing numbers in women’s rugby and there were lots of positive vibes in the air as 15 Telegraph Media Group Honda Rugby Legacy Fund winners met this summer to enjoy a training session with England World Cup-winning legend Maggie Alphonsi. The day also allowed the clubs to share stories and discuss how they might overcome the challenges they each face.\nFor grassroots teams like Tetbury, Ivybridge and Torquay, the fund is helping to turn outdated, often male-dominated facilities into inclusive, welcoming spaces where girls can thrive not only as players, but as officials, teammates and leaders.\nLetting in the light\nIn rural Gloucestershire, Tetbury RFC has grown from a single U12 girls’ team in 2021 to nearly 70 players across all age groups, with their first U18 team launching next season. But their facilities have not kept pace with their growth. They have been awarded a £3,000 fund to help level that playing field.\n“Our unique challenge is space – we only have one pitch to play on,” says coach Mark Benfield. “We could use floodlights to make use of the space around the pitch. To have some extra lights means we can have more girls coming in, making it a safe environment for them and utilising our space better. Then, hopefully, they can bring their friends and have more fun.”\nThe spirit of the fund was on display during the Honda winners’ day. “We’re all in the same boat here,” adds Leon Horton, another coach at Tetbury. “We’re all trying to give the girls huge amounts of energy, give them a lovely outcome and have a fun time doing it, meeting new friends.”\nChanging up\nIn Devon, Ivybridge RFC has seen its women’s section double in size since 2020 and it now supports more than 100 girls in weekly training. With two players recently representing England and Scotland at U18 level, the club has performance as well as participation in its sights – but facilities are again a limiting factor; something that they hope to address with their £1,000 award.\n“Our club’s challenge is the changing rooms,” says Georgina Robinson, women’s player and girls’ coach. “They’re very much designed – and the club has been designed – for men’s rugby over the years and now we’ve introduced women and girls. We need to make the changing rooms and the facilities generally more female friendly.”\nThe club is also deeply community focused, offering lifts, boots and support to families in a town where nearly 70 per cent of households live with some form of deprivation. Under-14s coach Nikki Moss adds: “Being here today is such a privilege and I’m really proud that we got selected from lots of entries as a small club in Devon. The money will really help support our women and girls’ rugby at the club in terms of changing some of our facilities and just generally providing equipment for the girls.”\nWhole new ball game\nTorquay Athletic RFC, also in Devon, is starting from scratch – and that’s precisely what makes its progress so exciting. This is the club’s first ever women and girls section, and it has begun with a focus on T1, the new non-contact version of the game.\n“It’s been amazing,” says Lucy Callaghan, youth and minis coach at the club. “We are so delighted to bring girls into Torquay and it’s been a really exciting journey this year. We were amazed with the numbers and how it’s grown, and the support we’ve got from other clubs.”\nTo avoid pulling players from neighbouring teams, the club made the conscious decision to start with non-contact rugby. “What’s been really interesting is that by doing the non-contact version, it’s brought in numbers, and now some of those are saying they’d like to start contact rugby. So, we’ve built it from the ground up without competing with those other clubs around us for numbers.”\nNow the club wants to use its £1,000 award to invest in match official development for girls – but their current facilities are far from suitable. “We want to improve our match officials’ facility so that girls are far more likely to want to become a match official because the facilities are going to be great for them instead of the dingey things that we’ve had in the past,” adds Jackie Coles, women’s lead at the club.\n“The fund will improve our facilities, especially one of the bathrooms. We’re going to be moving the facilities around to the front of the building, with women and girls in mind. It’s all about safety and feeling confident in the space. We’ve got some girls who are 16 saying they want to be referees. I’m not sending them around the back of the clubhouse.”\nAcross all three clubs, the message is clear. Inclusion is not just about who is invited to play – it’s about whether the facilities say, “You belong here.” With the support of the Telegraph Media Group Honda Rugby Legacy Fund, these grassroots sides are making sure the answer is a resounding yes.", "source_domain": "www.telegraph.co.uk", "title": "Transforming facilities For UK women's rugby", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/womens-sport/powering-england-rugby/tetbury-ivybridge-torquay/", "id": "154f0f54e66258c79ee1a0dbb1ed816bc0881d9e856d786f4da703dabfd79bd7"}
{"authors": ["Jotam Confino"], "date_download": "2025-08-05 14:24:20+00:00", "date_modify": null, "date_publish": "2025-08-03 18:01:00", "description": "Itamar Ben-Gvir led a Jewish prayer for the destruction of Hamas at the holy site", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fworld-news%2F2025%2F08%2F03%2Fisrael-minister-flouts-1967-deal-praying-al-aqsa-mosque%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/briefs/2025/08/03/TELEMMGLPICT000434592319_17542355101930_trans_NvBQzQNjv4BqZgEkZX3M936N5BQK4Va8RWtT0gK_6EfZT336f62EI5U.jpeg?impolicy=OG-Standard", "language": "en", "localpath": null, "maintext": "Israel’s ultra-nationalist security minister has provoked outrage by praying on the Temple Mount, violating a long-standing agreement between Israel and the Arab world.\nJews are forbidden from prayer at the east Jerusalem site under the “status quo” agreement made between Israel and Jordan in 1967. It is the holiest site in Judaism and also the location of the Al-Aqsa mosque.\nItamar Ben-Gvir visited the Temple Mount while Jews around the world marked the Tisha B’Av fast day, commemorating the destruction of the first and second Holy Temples.\nHe was filmed at the site leading a Jewish prayer. He said: “It is precisely from here, a message must be sent [to Hamas]: to ensure that we conquer all of the Gaza Strip, declare sovereignty over the entire Gaza Strip, take down every Hamas member, and encourage voluntary migration.\n“Only in this way will we bring back the hostages and win the war.”\nMr Ben-Gvir’s action forced Benjamin Netanyahu, the Israeli prime minister, to issue a statement saying that “Israel’s policy of maintaining the status quo on the Temple Mount has not changed and will not change”.\nSaudi Arabia condemned “in the strongest terms of the repeated provocative practices by officials of the Israeli occupation authorities against Al-Aqsa Mosque”.\nIts statement added: “The Kingdom affirms that such practices fuel the conflict in the region.” The Arab nation is supporting the New York declaration with France, which recognises a Palestinian State and calls on Hamas to lay down its weapons.\nOther Israeli ministers and politicians visited the Temple Mount on Sunday, including Yitzhak Wasserlauf, the national resistance minister, and Sharen Haskel, deputy minister of foreign affairs.\nMrs Haskel said: “In the shadow of Oct 7, with our people still reeling from war and 50 hostages still in Hamas’s dungeons of torture, the pain in Israeli society runs deep. The anger and grief are overwhelming.\n“But I went up [to the Temple Mount] to remember – and to promise. To promise leadership that unites, that heals, and that protects the next generation.”\nYisrael Katz, Israel’s defence minister, visited the Western Wall, saying the Temple Mount was again under Israeli sovereignty after 2,000 years.\nHe said: “Israel haters around the world continue to make decisions against us and protest, and we will strengthen our hold and sovereignty over Jerusalem, at the Western Wall, and the Temple Mount, forever.”\nIt is not against the status quo agreement for Jews to visit the Al-Aqsa mosque, only to pray there.\nNabil Abu Rudeineh, a spokesman for the Palestinian Authority, called on the international community and US to intervene “immediately to put an end to the crimes of the settlers and the provocations of the extreme Right-wing government in Al-Aqsa Mosque, stop the war on the Gaza Strip and bring in humanitarian aid”.\nJordan condemned Mr Ben-Gvir’s prayer as “an unacceptable provocation, and a reprehensible escalation.”\nIsrael has “no sovereignty over the blessed Al-Aqsa Mosque”, Jordan added.\nAbout 1,200 Jews visited the Temple Mount on Sunday according to the Waqf, the authority which manages Islamic buildings at the site.\nThe Temple Mount has been a flashpoint in the Israeli-Palestinian conflict for decades. Jordan is the custodian of the site, but Israel controls security around it.\nPalestinians and Israeli police force often clash there, especially during Ramadan and Passover, when religious Jews visit.\nUltra-nationalist religious Jews have sought to regain full control of the entire site, while Hamas and Islamic Jihad supporters have attacked Israeli police forces from the site.\nHamas has often said that the Al-Aqsa compound/Temple Mount was a red line, vowing to “liberate” all of Jerusalem through jihad.\nThe Oct 7 massacre was also named the “Al-Aqsa flood” by the terror group.", "source_domain": "www.telegraph.co.uk", "title": "Israeli minister flouts 1967 agreement by praying at Al-Aqsa mosque compound", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/world-news/2025/08/03/israel-minister-flouts-1967-deal-praying-al-aqsa-mosque/", "id": "cb429704a618f23d03e40c352c8714c14ea57f51639a1ee1faeff8296628af77"}
{"authors": ["Josephine McKenna"], "date_download": "2025-08-05 14:24:22+00:00", "date_modify": null, "date_publish": "2025-08-03 19:36:00", "description": "After Brexit, ‘you have to pay more if you don’t have insurance,’ says Italian emergency service", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fworld-news%2F2025%2F08%2F03%2Frescued-british-hiker-billed-12k-dolomites-warning-signs%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/briefs/2025/08/03/TELEMMGLPICT000434608129_17542393965090_trans_NvBQzQNjv4BqvxY1SBh3Zy94n8Z2-u3DXv4Xpit_DMGvdp2n7FDd82k.jpeg?impolicy=OG-Standard", "language": "en", "localpath": null, "maintext": "A British hiker is being billed €14,000 (£12,200) by Italian emergency rescue services for failing to heed mountain warning signs.\nThe 60-year-old, who has not been named, found himself in the midst of an avalanche on a rocky mountain path near San Vito di Cadore in the Belluno area of the Dolomites.\nHe was lucky to survive, emergency services said, but not lucky enough to get off with a smaller fine, which he would have done if this had happened before Britain’s exit from the European Union.\nThe British man is understood to have set off alone from Passo Tre Croci, near Cortina d’Ampezzo, on Thursday morning.\nHe was hiking on the Ferrata Berti path at an altitude of 8,200ft (2,500m) despite signs in English and Italian urging hikers to turn back.\n“He said he didn’t see the signs warning of the danger,” Nicola Cherubin, head of alpine rescue in San Vito di Cadore, told The Telegraph.\n“Rocks have been falling continually in that area for the past two months. With these landslides it is not secure. He was really afraid.”\nPhotos of the signage posted on the alpine service’s Facebook page read: “Warning. Trail no. 242 (Via Ferrata Berti) and trail no. 241 (Dogana Vecchia-Cengia del Banco) closed due to risk of collapse.”\nOne said in English: “Stay safe, do not go beyond this warning.”\nItaly has been warning tourists of the risks of trekking in the alps amid a record number of deaths – nearly 90 this year. The biggest causes have been inexperience and poor preparation while overcrowding has prompted calls for better management of the trails and protection for the environment.\nThe British hiker sounded the alarm at around 3.30pm after becoming distressed by falling rocks. The volunteer rescue service sent a helicopter to rescue him but were initially thwarted by low clouds, forcing it to make a second trip to confirm his location.\nHe was eventually brought to safety with no injuries but is now being asked to pay €14,000 (12,000 pounds) to the regional health service for the helicopter rescue because he is British.\nThe rescue bill for an Italian or French climber might be a few hundred euros. But for non-EU nationals, the fee is considerably higher.\n“If someone calls because they are tired or stuck because they find themselves in a place where they shouldn’t be, or if they are unharmed with no health issue, they have to pay,” a national rescue service spokesman said. “If you are from outside the EU without insurance, you have to pay more.”\nOn Sunday rescue service volunteers completely closed the three access points to the Ferrata Berti trail and erected new signage in Italian, English and German warning of continuous rockfalls.\nOn July 19, two Belgians ignored or failed to read the warning signs and were rescued in the same area.\nAlpine Rescue Service said half of the hikers or climbers billed for their rescues never pay up.", "source_domain": "www.telegraph.co.uk", "title": "Rescued British hiker billed £12k for failing to heed Dolomites warning signs", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/world-news/2025/08/03/rescued-british-hiker-billed-12k-dolomites-warning-signs/", "id": "8d2b7ca45ae5635b7a50fd6f1343a9c93a1ac79315c7ea55037812370fb3f16b"}
{"authors": ["Antonia Langford"], "date_download": "2025-08-05 14:24:34+00:00", "date_modify": null, "date_publish": "2025-08-03 00:00:00", "description": "Ukrainian drone attacks sparked a massive fire at an oil depot in a rare attack on the Black Sea resort of Sochi.", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fworld-news%2F2025%2F08%2F03%2Fukraine-russia-war-live-drone-attack-fire-black-sea-sochi%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/world-news/2025/08/03/TELEMMGLPICT000434590470_17542309721870_trans_NvBQzQNjv4BqNwJyN5aFH1f8m-UGCq32YESXDVobHLbZZp-A_Kknc4M.jpeg?impolicy=OG-Live", "language": "en", "localpath": null, "maintext": "Ukrainian drone attacks sparked a massive fire at an oil depot in a rare attack on the Black Sea resort of Sochi.\nPlumes of thick smoke rose above the city, forcing the airport to close and requiring more than 100 firefighters to tackle the blaze.\nThe oil refinery was struck by debris from one of the estimated 93 Ukrainian drones flown into Russia overnight, including 60 over the Black Sea region.\nSochi, which hosted the 2014 Olympic Winter Games and where Vladimir Putin once owned a holiday home, has witnessed only a limited number of Ukrainian attacks over the course of the war.\nHowever, the attack on Sunday appears to be part of a wider strategy to hit oil refineries and worsen potential gasoline shortages in Russia this month.\nLow domestic stocks, peak seasonal demand and repair work at domestic refineries are likely to choke the supply of gasoline in August, trade sources told Reuters on Friday.\nRussian authorities said that the Sochi drone attack was accompanied by Ukrainian strikes on oil refineries in the southern Russian cities of Ryazan, Penza and Voronezh.\nTourists at the Black Sea city told the Russian news agency Gazeta.ru that they hid in underground passages as sirens blared in the resort city.\n“There were a lot of explosions right next to us, orange flashes in the sky,” one shaken tourist told the Krasnodar TV channel. “The sound was terrible, the siren was screaming… my hands are still trembling.”\nSome tourists, however, created videos of themselves posing in front of the fire lip-syncing to a popular rap song. The three young Russian tourists who featured in the videos were detained after a clip went viral.\nIn a statement on Telegram, Krasnodar’s Ministry of Internal Affairs wrote that officers had “identified and detained the characters of a scandalous video filmed today against the backdrop of a fire”.\nAndrey Prushunin, the mayor of Sochi, wrote on Telegram that “a fuel tank caught fire at an oil depot” in the Adlersky city district of Sochi, adding: “I express my gratitude to the air defence services for their professionalism.”\nRosaviatsia, Russia’s civil aviation authority, announced that flights had been halted at Sochi airport in response to the attack.\nAirports in Russia have been repeatedly disrupted by Ukrainian attacks in recent months as part of a campaign to bring the war home to Russians, with some reporting that at least one airport was shut down temporarily on almost every single day in July.\nThe shutdowns have sparked frustration across Russia during tourist season and pose a surging cost for its aviation and tourism industries.\nMeanwhile, in Russia’s overnight attacks on southern Ukraine, seven people were wounded by a missile strike on a residential area of the city of Mykolaiv.\nIt came at the end of one of the bloodiest weeks in Ukraine in recent months, after a Russian drone and missile barrage on Kyiv killed 31 people and injured 179 on Thursday.", "source_domain": "www.telegraph.co.uk", "title": "Ukraine drone attack sparks fire in Russian resort city", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/world-news/2025/08/03/ukraine-russia-war-live-drone-attack-fire-black-sea-sochi/", "id": "c788196e00ddb8fa0e620f7a7bf4550cdcfa0500c08f3c9a285435d097fc4ecd"}
{"authors": ["Our Foreign Staff"], "date_download": "2025-08-05 14:24:40+00:00", "date_modify": null, "date_publish": "2025-08-03 16:13:00", "description": "Suitcase containing two-year-old girl had been stowed in compartment beneath passenger area of a bus", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fworld-news%2F2025%2F08%2F03%2Fwoman-arrested-toddler-found-in-luggage-new-zealand%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/world-news/2025/08/03/TELEMMGLPICT000434594887_17542335382280_trans_NvBQzQNjv4Bq3omxJyuYBquyjAbNcmiP1I2VG6LCyvZfrdetkd2syPs.jpeg?impolicy=OG-Standard", "language": "en", "localpath": null, "maintext": "A 27-year-old woman has been arrested in New Zealand after a two-year-old girl was found inside her luggage during a bus journey, police said on Sunday.\nThe child was discovered at a bus depot in Kaiwaka, around 100km (62 miles) north of Auckland, after the driver became concerned about a bag moving during a scheduled stop.\n“When the driver opened the suitcase, they discovered the two-year-old girl,” said Detective Inspector Simon Harrison. “The little girl was reported to be very hot, but otherwise appeared physically unharmed.”\nThe suitcase had been stowed in the luggage compartment beneath the passenger area – a space that can become extremely hot, especially during summer.\nThe woman, who has not been named, has been charged with ill-treatment and neglect of a child. Further charges may follow, police said.\nToddler remains in care\nThe toddler was taken to hospital for a full medical assessment and remains in care. New Zealand’s Ministry for Children, Oranga Tamariki, has also been notified.\n“We would like to acknowledge and commend the bus driver, who noticed something wasn’t right and took immediate action, preventing what could have been a far worse outcome,” said Mr Harrison.\nA spokesman for InterCity, the bus operator, told Radio New Zealand: “Police were called to respond, and they are now investigating the matter. No one was harmed during the incident and the service has resumed. As this is now an active police investigation, we are unable to comment further.”", "source_domain": "www.telegraph.co.uk", "title": "Woman arrested after toddler found inside luggage in New Zealand", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/world-news/2025/08/03/woman-arrested-toddler-found-in-luggage-new-zealand/", "id": "de879978a23a2bd1e8266900c21733d00c81f60b07f3f8391542582a80293b90"}
{"authors": ["Memphis Barker", "Joe Barnes"], "date_download": "2025-08-05 14:24:46+00:00", "date_modify": null, "date_publish": "2025-08-04 16:30:00", "description": "Moscow fears its ageing tankers used to avoid sanctions on oil exports will be sabotaged", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fworld-news%2F2025%2F08%2F04%2Fbritain-planning-attack-on-shadow-fleet-kremlin-claims%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/world-news/2025/08/04/TELEMMGLPICT000434693831_17543183336630_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQf0Rf_Wk3V23H2268P_XkPxc.jpeg?impolicy=OG-Standard", "language": "en", "localpath": null, "maintext": "The Kremlin has accused Britain of preparing “mass raids” to sink ships in the Russian shadow fleet.\nThe SVR, Moscow’s foreign intelligence service, claimed that London was plotting attacks on the fleet of old tankers used to avoid sanctions on oil exports.\nThe attacks would be designed to look like accidents, the SVR said, so that Britain and the West could claim that the ships were a danger, and move to restrict their movement.\n“British intelligence services are planning to use Nato allies to launch a mass raid on the ‘shadow fleet’; for this purpose, an ecological catastrophe in international waters is being prepared,” the SVR report claimed.\nThe report suggested that Britain planned to commission Ukrainian special forces to sink a vessel in “one of the bottlenecks of sea communication”.\nHowever, the report is likely to raise concerns that Russia is preparing its own “false flag” – an operation designed to look like an attack on them – in order to deter the West from further crackdowns on the shadow fleet.\nExperts warn that many of the vessels in the fleet are hardly sea-worthy, sparking concerns that one could easily sink and cause a massive oil leak.\nThe Kremlin could also be publishing the SVR report to shift the blame in the event of such a disaster, said Dr Sidharth Kaushal, a research fellow at the Royal United Services Institute (Rusi), a London-based think tank.\nHe said: “One interpretation might be that the Russians are insuring themselves against something breaking down or sinking, in a way that creates a pretext for restricting [their movement across the ocean].”\nUnder Unclos, the UN treaty governing maritime travel, states can restrict ships entering their territorial waters if they pose an environmental risk or safety hazard. As it stands, shadow fleet vessels regularly cross through the territorial waters of Western nations.\nMany fly so-called “flags of convenience”, such as Comoros or Gabon, in an attempt to obscure their participation in funding the Russian war machine.\nThe SVR report went on to state that London could also encourage Kyiv to set fire to a tanker in a port in a “state friendly to Russia.”\nAt least six tankers have been hit with mysterious explosions since the start of the year. Suspicion for the attacks has fallen on Ukraine, as all the tankers had docked in Russian ports and some were carrying Russian oil.\nThe US and EU sanctions regime against Russia’s shadow fleet has started to seriously impact its operations.\nAccording to the Brookings Institute, a Washington-based think tank, the volume of oil carried on its vessels has fallen from more than 50 million barrels per month to less than 20 million per month since the start of the year.\nMoscow has previously signalled its anger at the growing restrictions on the vessels by escorting them with military jets, the first time it explicitly acknowledged the shadow fleet as linked to its national security.\nThe SVR report says: “The impetus for such a campaign, according to London’s plan, should be given by a resonant incident with one or several tankers.\n“The plan provides for the organisation of a major sabotage, the damage from which will make it possible to declare the transportation of Russian oil a threat to all international shipping.\n“This will untie the West’s hands in choosing methods of counteraction.”\nThe claimed attack plans could be a desperate attempt to deter Donald Trump from following through on his threat to enact 100 per cent tariffs on Russia and countries which buy fossil fuel from Moscow. On Monday, Mr Trump said he was set to impose harsh tariffs on India for continuing to purchase Russian oil.\nFighterbomber, a Russian war blogger, said: “the countermeasures here are very simple. In a short time, several English tankers should suffer an accident... Of course it would be preferable to be closer to Great Britain.”", "source_domain": "www.telegraph.co.uk", "title": "Britain planning attack on shadow fleet, Kremlin claims", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/world-news/2025/08/04/britain-planning-attack-on-shadow-fleet-kremlin-claims/", "id": "981fed1ff7d542667fe27509a9c56efd5ad130452f28ac992f51a4d9b55610d8"}
{"authors": ["Iona Cleave", "Nick Squires", "Daphne Tolis"], "date_download": "2025-08-05 14:25:28+00:00", "date_modify": null, "date_publish": "2025-08-04 21:10:00", "description": "Three people arrested on suspicion of manslaughter following death of 78-year-old tourist", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fworld-news%2F2025%2F08%2F04%2Fhotel-owners-arrested-after-british-woman-dies-pool%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/world-news/2025/08/04/TELEMMGLPICT000434697637_17543240065310_trans_NvBQzQNjv4BqxraM-h6dqd0GMWIozadrg2qsztQTUOzfOTmkRfZ5g18.jpeg?impolicy=OG-Standard", "language": "en", "localpath": null, "maintext": "A British woman who died in a hotel swimming pool in Crete has been named as Margaret Winifred Davies.\nThe 78-year-old tourist was staying at the five-star Knossos Royal hotel in the town of Hersonissos when she lost consciousness.\nShe was dragged from the water and received first aid before being taken to hospital, but was pronounced dead.\nThree people have been arrested on suspicion of manslaughter by negligence, including a 21-year-old female lifeguard who was supposed to be on duty at the time.\nThe Cretapost website reported that the lifeguard was not at her post at the time of the incident.\nThe hotel’s director, 51, and general manager, 41, were also arrested.\nAll three suspects have been released.\nSafety complaints\nThe hotel occupies a prime position on the northern coast of Crete and promises “rolling lawns, lush landscaping and impeccable facilities”, according to its website.\nIt boasts several swimming pools, which are “designed to appeal to all senses and play an important role in the resort’s architectural structure”.\nIn a statement, the Knossos Royal expressed its “sincere condolences and deepest sympathy” to the family of the deceased and denied any wrongdoing.\n“From the very first moment we were informed about the guest’s discomfort, the hotel management responded to the incident with complete responsibility, seriousness, and professionalism, providing immediate assistance, support, and every possible medical aid to her,” it added.\nIt also urged against speculation over the woman’s cause of death before the release of an official forensic report by the Greek authorities.\nA Foreign, Commonwealth and Development Office spokesman said: “We are supporting the family of a British woman who died in Crete and are in touch with local authorities.”\nThe incident comes after a British tourist was found dead on his sun lounger on a beach near Hersonissos on July 20.\nThe 74-year-old man had lost consciousness shortly after going swimming in the sea on Stalis Beach and was pronounced dead at the scene.\nMeanwhile, a search for a British woman is continuing after she went missing from a beach in northern Greece.\nMichele Bourda, 59, is reported to have disappeared while her husband slept on a beach in Kavala.\nHer family raised the alarm, but police have so far been unable to find her.\nShe had been swimming at midday on Friday and was wearing a two-piece swimsuit featuring rhinestones, as well as yellow beach shoes and red bone-rimmed sunglasses when she went missing.\nAccording to local media, she lived with her husband, who is of Greek origin.\nShe had reportedly gone to the beach with him and disappeared while he was sleeping on a deckchair.", "source_domain": "www.telegraph.co.uk", "title": "British woman who died in Crete swimming pool named", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/world-news/2025/08/04/hotel-owners-arrested-after-british-woman-dies-pool/", "id": "61087bcdac445d6b8ceb81e8fb63ee557a5a636de5e9a159bbe765f9ed97253e"}
{"authors": ["James Rothwell"], "date_download": "2025-08-05 14:25:48+00:00", "date_modify": null, "date_publish": "2025-08-04 19:17:00", "description": "Appeal from Danish keepers sparks furious backlash from animal lovers", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fworld-news%2F2025%2F08%2F04%2Fzoo-asks-public-to-donate-pets-to-feed-captive-predators%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/briefs/2025/08/04/TELEMMGLPICT000434704390_17543299251710_trans_NvBQzQNjv4BqMG9jYnib85FJIfCc-bQYcdf11FLKtqwYaxK652uKeQE.jpeg?impolicy=OG-Standard", "language": "en", "localpath": null, "maintext": "A zoo in Denmark has appealed for unwanted pets to feed its predators.\nAalborg zoo in northern Jutland issued a call for small healthy animals to be donated to ensure “nothing goes to waste”.\nIn a social media post, the zookeepers suggested the animals would be fed to their contingent of European lynx.\n“Chickens, rabbits and guinea pigs form an important part of the diet of our predators,” the zoo said. “Especially the European lynx, which needs whole prey that resembles what it would naturally hunt in the wild.”\nOwners could donate a maximum of four animals, zookeepers said, which would then be euthanised before being used as food.\nAalborg Zoo is also accepting donations of horses to be fed to its animals, provided they are accompanied with the correct paperwork. In Denmark, horse owners can receive tax deductions in some circumstances when donating animals to zoos.\nAngry social media users expressed their outrage on the zoo’s Instagram page. “Shame on you,” one Instagram user wrote.\nAnother said: “Asking people to send healthy animals that they don’t want any more to you, so they can be slaughtered and fed to the zoo animals is one of the weirdest things I ever read.”\n“Go vegan and stop supporting zoos,” wrote a third commentator, adding a green vomit emoji.\nThere was outrage last week when Nuremberg Zoo in Germany killed 12 healthy baboons, citing overcrowding in their enclosure, then fed them to the lions, tigers and wolves.\nGruesome spectacle for visitors\nGerman media reported that the baboon corpses had their hands and feet removed before they were fed to the predators, in full view of visitors to the zoo.\nThe zoo has defended the decision, insisting it was a last resort after attempts to find other solutions to the overcrowding failed.\nThe furore over Aalborg Zoo is not the first time that a Danish zoo has drawn controversy for its approach to animal death and the brutality of nature.\nIn 2014, Marius, a male giraffe at Copenhagen Zoo, was killed by zoo authorities as his genes were too similar to other giraffes in their breeding programme.\nDespite an international outcry from animal lovers, Marius was also publicly dissected “to help educate people about wildlife”.", "source_domain": "www.telegraph.co.uk", "title": "Zoo asks for unwanted pets to feed to captive predators", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/world-news/2025/08/04/zoo-asks-public-to-donate-pets-to-feed-captive-predators/", "id": "2c3f6b68e55484230e821ce583f22eb0a156a2f32a225db6a91e24f500b0f1eb"}
{"authors": ["Iona Cleave"], "date_download": "2025-08-05 14:26:24+00:00", "date_modify": null, "date_publish": "2025-08-05 12:02:00", "description": "Footage showed 13 men diving in the sea and swimming to shore, where they were immediately met with fierce resistance", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fworld-news%2F2025%2F08%2F05%2Ftourists-tackle-migrants-on-spanish-beach%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/world-news/2025/08/05/TELEMMGLPICT000434744359_17543916889010_trans_NvBQzQNjv4BqfPFp9iTeZdzfkxHeASLiE70zF_b9hXgUFIP8yeMNVKg.jpeg?impolicy=OG-Standard", "language": "en", "localpath": null, "maintext": "Migrants attempting to land on a beach in Spain were tackled to the ground by locals and tourists before being taken into custody by police.\nFootage showed 13 men diving off a boat and swimming to the shore, where they were immediately met with fierce resistance from beachgoers in a tourist town in Andalusia, in the south of the country.\nThe incident took place at Sotillo beach in Castell de Ferro on Sunday afternoon.\nThe fast-moving series of events, recorded on phones by witnesses, showed a motorboat approaching the packed beach at high speed.\nThe men, reportedly of North African origin, start diving into the water and racing up onto the shore.\nOne clip showed a migrant being detained by a half-naked man in orange trunks, who sat on top of him until police arrived. Another showed a beachgoer escorting a man out of the sea.\nAmid the chaos and commotion, some of the men tried to blend in with those on the beach, according to witnesses.\n“We all stood there staring, not quite knowing what was happening,” Alberto Garcia, a nearby restaurant owner, told local newspaper Ideal.\n“We thought it was a recreational boat, but when we saw that they started throwing objects into the water and people starting to get out, we realised it wasn’t normal,” he added.\nThe Civil Guard in Castell de Ferro said they were able to arrest nine of the migrants after lifeguards on the beach alerted them to the boat’s arrival.\nWithout commenting on the role the public played, it added that the Civil Guard “did the bulk of the work”.\nIt is not clear what happened to the other four men who may have fled into the town. Those who were detained are now being held at a local migrant centre.\nJosé Antonio Martos, the deputy head of Granada’s regional authority, called it an isolated incident.\n“The arrival of migrants to Granada’s beaches is very low in 2025. In fact, this is only the second boat to reach our shores this entire year,” he said.\nSpain is now on the frontline of the EU’s migration crisis as a crackdown on small boats in the Mediterranean has pushed more people to attempt the perilous trip from West Africa to the Canary Islands.\nIn 2024, a record number of migrants – more than 63,000 – arrived in Spain through irregular routes, with over 46,000 reaching the Spanish archipelago.\nMorocco, Senegal and Mali accounted for the most common nationalities.\nThe arrivals last year surpassed the almost 40,000 migrants who reached the Canary Islands in 2023. However, the figure for the whole of Spain was below the record set in 2018 of more than 62,000.\nThe Spanish political Right have blamed Pedro Sanchez, Spain’s prime minister, a staunch advocate for greater migration – which he calls the “great motor of economic development” – for opening the door to illegal migration.\nMr Sanchez’s Left-wing government has introduced legislation giving residency to half a million undocumented migrants in Spain and allowing failed asylum seekers to get jobs.\nThe moves are at odds with Spain’s European neighbours who are tightening border controls.\nIn July, the far-Right party Vox, currently the third-largest political force, vowed to deport around eight million people who have “not adapted to our customs” if it wins the next election expected in late 2027.", "source_domain": "www.telegraph.co.uk", "title": "Tourists tackle migrants fleeing boat on Spanish beach", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/world-news/2025/08/05/tourists-tackle-migrants-on-spanish-beach/", "id": "5a3eb2d7183a66d7ad320554ab518d13d14121a8efb197700a8b4eafc5382370"}
